{"0x003c109411e96e5607ce609278536262e12afdaa65ab927632ec03d90b4c8ccc":{"description":"Setting ENS resolver contracts for dxDAO domains. More information can be found here: https://daotalk.org/t/next-steps-for-the-ens-domain-dxdao-eth/1130","title":"dxwallet.eth set resolver contract ","hash":"QmS4FqvBEAQz5owZvNvL9ph9hc5BgMrySNgXpW79zJia2p"},"0x00a6fff3bc39d362f1153029f9105ea14c080ebbf475ad8d22e8ace314f2bac1":{"description":"This proposal will sync my Eth Mainnet REP with my xDai chain REP.\nUp until now I had only claimed REP on DXdao’s xDai chain base.\n\nPast passed on-chain proposals for reference:\n\nhttps://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xe668541944718548938c37d7bf07a70d02f2355122999a865a6aaa6b8ea2de51\nhttps://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xad78b2b1fc0ab60256b66d0b081283b4cdcf2850b71694c4b5c75cadea335d17\nhttps://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xac021ea55ba73e2eae0c15506960def2f86a89718350ad62d03a2d1d19288d90\nhttps://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0x2e9cb36f0545912cc7cb9dce15c0c9eec7e54b2674dd86d264e1fd88e9251229\nhttps://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0x8257dbf963277c74f9992fd91fda76bf666edb43f7969563d2862cf6499c6d33\n\nMetaMask shows 13186.468 REP in the address.","title":"Mainnet REP sync for Nathan","hash":"QmanRf9UQp2UgfvzXiAhGHUCg6rdHuNjLV51UA4LTHVrge"},"0x010c938f9cd050e3e3112fc1241a62583dec1ad09b9a741888349dc4ab877caa":{"description":"\n\nThis proposal places a 20000 LUSD order on CowSwap for DXD. See order here: https://explorer.cow.fi/orders/0x9d31e7a407acfde841fc28752aa4976f58e3309694e5b5d92b139496b974d3cc519b70055af55a007110b4ff99b0ea33071c720a63f11e95\n\nThis order is placed in line with parameters set out in the [Approve DXD Token Model proposal](https://alchemy.3ac.vc/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xb7ff31ec2bcdb8a254b8a1b06c6d2080a4089135b03ed55e684fd41b5176d946) that passed in December..\n\nThe order is placed at 70% of the current DXdao NAV, or $586.42. This proposal will take 16 days to execute from the time of boosting. \n","title":"CowSwap Order  9d31e7a4 LUSD / DXD","hash":"QmSTvzEqnJLkypGjmVo5LXWNbxbjYgmNE9xxfhXcVFnZtS"},"0x011f8609171d99705dda26d2d82cdcc691cdf8916997d59a6746587a0f8f2faa":{"description":"As per: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xd9210249dfd1d764872c853eeb66ea5d1711071bc9daaed8118df2494706be2c\n\nCompensation is being requested for the second half of the work period from 08/20-10/20 in $3,333 in ETH and 2102 REP.\n\nProof of work:\n- https://github.com/protofire/omen-exchange/commits?author=KadenZipfel\n- https://github.com/protofire/omen-subgraph/commits?author=KadenZipfel\n\nBEGIN KEYBASE SALTPACK SIGNED MESSAGE. kXR7VktZdyH7rvq v5weRa0zkVwu7Rf 7ZFeoVRnxtr9ib1 SXnw3ulr45EnDaA bvrmSETqfZZXnvN D6NeFLOarX5V89M N9pLOWTZqyrVkrk NCXcL8z9E6b0j4p cqxgn845VZjgBKq pTkSFlhIWqqpA6k OkTDL1th8fcogup ZwNSDB04qh142qV YkDTsp2vFzb2Dk. END KEYBASE SALTPACK SIGNED MESSAGE.","title":"Worker payout 09/20-10/20 - KadenZipfel","hash":"QmSmQkE34k18GVnmeZDoqzD734EpWBGa5CGjfJyQWzeHqV"},"0x01307fd72aa360c5c2964867c47ef46afd3fa4c83a94fd96c52445511ea6d7ba":{"description":"This proposal sends 17.26 ETH to the [GP Relayer](https://etherscan.io/address/0xce0BB1a5e9c723fe189D9Bf5457DEd9b21E40f9E) intended to be used to place an order to purchase DXD in line with the DXD Buyback Program proposal, which was passed on [Mainnet](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) and [xDai](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xc122e9ea5460917347538157501f7999d82bdd9b1b8d85bee373391c4b87aa45). This was previously discussed on [DAOtalk here](https://daotalk.org/t/dxd-buyback-program-signal-proposal/2890). This funding proposal and the subsequent trade proposal use an updated version of the GP Relayer than the one referenced in the DXD Buyback Program Signal Proposal in order to add Swapr to the GP Relayer’s exchangeFactoryWhitelist.\n\nThe DXD Buyback Program Signal proposal stipulates that the purchase amount should be based on the DXD Average Daily Trading Volume (ADTV). [According to the most recent on-chain data and estimates](https://gateway.pinata.cloud/ipfs/Qmbeh8ifrY9actVgzYHbd9Qan1RJRrunsXkiXeNtJAzt6u), DXD has averaged $150k over the last 3 months, so this proposal sends 17.26 ETH to the GP relayer on mainnet, identified as `0xce0BB1a5e9c723fe189D9Bf5457DEd9b21E40f9E`, using a [$2172.47 ETH/USD price from Coingecko](https://www.coingecko.com/en/coins/ethereum). Further explanation of the [GP relayer can be found here](https://ipfs.io/ipfs/Qmd8TCEr6syKxAnmuBH3hsyvxfSgRJgANLTTorp3JGZY77). \n\nThis proposal falls under the DXD Buyback Program, because the value of the DXD circulating supply is less than the value in the ETH in DXdao’s treasury, [according to Coingecko](https://www.coingecko.com/en/coins/dxdao) and [Etherscan](https://etherscan.io/token/0xa1d65E8fB6e87b60FECCBc582F7f97804B725521).\n\nThis proposal sends funds to the GP Relayer. A separate proposal with the order parameters must also be submitted to place the order. That proposal must be executed _after_ this proposal or else it will fail.","title":"Send 17.26 ETH to GP Relayer for DXD buyback #11","hash":"QmbVZsNTqWc1jijwMgLnnqQpZmwociqRn1JUeSk56jzqRM"},"0x019e094131fce8511813564de0816bc56e368ed4c0b4c056d544df1f767ac078":{"description":"## Timeframe\n\nFrom 06/07/2020 to 07/08/2020, 4 weeks.\n\n## Responsibilities\n\nProduct: Product support & delivery of new product features for Omen, DXswap and WalletScheme.\n\nSecurity: Implement tools to enhance DXdao security monitoring and work along with JohnK to establish an ongoing auditor relationship.\n\nLandingpage: Maintanance of the [DXdao Landingpage](http://dxdao.eth.link)\n\n## Goals\n\n* Product\n  * Delivery of DXswap Alchemy Governance Interface.\n  * Delivery of DXdao Omen Arbitrator contracts and support along the audit process.\n  * General support on testing & deployment of DXswap.\n  * Collaboration along AugustoL on research and implementation of WalletScheme contracts.\n* Security\n  * Implement a [Security Bot](https://www.notion.so/Security-Bot-6e2bf2847f184318907c5ee65c01bee7) that performs certain security audits and integrates with Keybase.\n  * Work along with JohnK to establish an ongoing auditor relationship.\n* Landingpage\n  * Collect landing page updates, bugs & feature requests (https://github.com/fMercury/dxdao-landing-page/issues). Collaborate with other members on updates.\n  * Collaboration along with Pepo to define first use-cases to integrate [Prtl](https://docs.google.com/document/d/1rb3z6DlgvlSnwx9Ro2t5NANI8GiW2nyCDGuq4R6jW90/edit) into the DXdao landingpage.\n\n## Compensation\n\n* 2.199,00 USD to be paid in ETH. 40% (879.60 USD) paid in advance at proposal acceptance and 60% (1,319.40 USD) paid after its delivery.\n* 2,082 REP, to be issued together with the final payment.\n* Bonus of 1,000.00 USD in DXD (Buy price at dxtrust.eth) when goals are reached.\n\nThe compensation is submitted according to the [guidelines](https://gateway.ipfs.io/ipfs/QmeVa7NhbFieeZbt8KEm2xZkuUxjp1dK3AcNiFCHwbkp1z) for a DXdao worker with Intermediate level experience and a commitment [level of 2](https://alchemy.daostack.io/profile/0xb33b9fba681653fe263b31a95766d83d18c2128d?daoAvatarAddress=0x519b70055af55a007110b4ff99b0ea33071c720a) and 75% time commitment.\n\n## Worker Experience\n\n* https://github.com/nicoelzer\n\nDXdao Experience\n\n* [DXdao Token Registry](https://github.com/nicoelzer/dxDAO-Token-Registry)\n* [DXdao Omen Arbitrator](https://github.com/nicoelzer/Omen-Arbitrator)\n* [DXdao Scheme Deployer](https://github.com/nicoelzer/DX-Scheme-Deployer)\n* [Token Registry Generic Scheme](https://github.com/daostack/alchemy/pull/1575)\n* [Omen Arbitrator Generic Scheme](https://github.com/daostack/alchemy/pull/1575)`Preformatted text`\n\n3,87 ETH are sent in this proposal representing 879,60 USD at a rate of 227 USD/ETH, the rate of USD/ETH at the moment of submitting this proposal.","title":"Worker Propsoal 07/2020 of github: nicoelzer","hash":"QmSoBhkqwTAYmZsBkk8MWzD5gYnG26yWok768MENoAraYj"},"0x0204690f98f4706695e41d5e26a68b32f1d2bdcde0d172e5a5544fd24f2ffeec":{"description":"# Timeframe\nTwo months, from October 8th, 2020 to December 8th, 2020.\n\n# Responsibilities\nKaden will continue to focus primarily on Omen, along with participating in governance and being ready and willing to contribute to other projects either with front-end or smart contract development.\n\n# Compensation\nThe following compensation is based on the [Workers Compensation Guidelines v2.4](https://ipfs.io/ipfs/QmTLSa4uyKJ71G1GViysJLVoawqPcHZ8L6B9eZjuMeM8ok) at an experience level of 3.5 (halfway between 3 and 4).\n\n- $13,000 paid in ETH. 50% paid once proposal is passed ($6500), and the remaining 50% to be paid once the work agreement has been completed on December 8th, 2020.\n- $9,000 paid in vested DXD to a vesting contract once the work agreement has been completed on December 8th, 2020.\n- 4534 REP (~0.3334%). 50% to be paid once proposal is passed (2267 REP), and the remaining 50% to be paid once the work agreement has been completed on December 8th, 2020.\n\n# Proof of work:\n- https://github.com/protofire/omen-exchange/commits?author=KadenZipfel\n- https://github.com/protofire/omen-subgraph/commits?author=KadenZipfel","title":"Worker proposal 10/20-12/20 - KadenZipfel","hash":"QmZ2xrXpop4PReCHxXvCaZ5TcaX6jKaSWsri6EtW7jRCWH"},"0x020abc749c72ee9e6ce524b6972b8d9aced6c9b96a5017798ec052c502e2d9b4":{"description":"I am submitting my Redemption Balancer under DXD approved Token Model, following Redemption Balancer guidelines.\n\nTransfer transaction of my 38.49 DXD to the DXdao multisig:\nhttps://etherscan.io/tx/0x0b02320ed1504f6d9347ec61ee8c0c0fba6e5da46d63790a059714a9a85ec863\n\nPlease find there my screenshot of the ‘Redemption Balancer Calc’, with assets to be requested, prices and circulating supply dated to the moment of the DXD transfer to the DAO:\nhttps://daotalk.org/t/molotov-s-redemption-balancer-3-under-dxd-token-model/4938","title":"Molotov’s Redemption Balancer #3 under DXD Token Model","hash":"Qmb4oX68QhMLyzQv9zym6cDMVZCm9f6cPiDbFqdkg2wCVv"},"0x021375ebe000f38f8204eaaed2675ab5f556fdbae2a87eb4ac97ba76f63a7ba6":{"description":"The daotalk post got a lot of support with no criticism and after asking my close team I got lots of support for this level up so putting in on chain for approval. Thank you everyone.\n\n---\n\nI’ve been planning a level up as I believe the work I am doing falls under the responsibilities of level 7. However, I wanted to wait until DAVI was out there and being used by people. Although we have technically been released in beta for some time now without real use cases I still didn’t feel comfortable considering it being out. But now guilds are launched and available to all squads in DXdao to use for governance, DXgov is handling all current payments through our guild.\n\nMy last level increase came with the overall pay structure changes last year. I have been the lead of DXgov for over a year and in that time my responsibilities have changed a lot. DAVI has grown into a larger product vision for DXdao and fits in as an important part of the organisation’s vision. Responsibilities as product and squad lead are very clearly laid out in our 6 month budget 1 complete with OKRs. In addition to those management responsibilities I also continue to use my development knowledge as best I can as a hybrid role to better guide us to achieving product goals. This usually takes the form of architecture and writing tasks but also pull requests and committed code.\n\nI also hope I can continue representing the DAO more at events as I just did my first panel and then first proper talk last year. I have one more applied to already for 2023 and will continue looking for opportunities to talk about what we are doing.\n\nI included this under a contingency cost for level ups as I wanted the decision to approve my level up to be separate from the DXgov budget.\n\nThis proposal sends the additional funds for February and March ($1000*2) to the DXgov guild via the multichain MS (0x9467dcfd4519287e3878c018c02f5670465a9003). The funding for the next quarter will be requested alongside as regular funding of the DXgov guild with me at level 7. \n\nI’m super excited for this next phase of DXdao and can’t wait for what we will all build together!","title":"Ross Neilson Level up - Approval & DXgov Guild funding","hash":"QmaJxLTYFUBWKA2cxUW3Gcwute9CkAVoFGWCXhNhr4mVXP"},"0x022dcfe7d4fd61969e0e2392725833be3d12fca464a7f41abdb8bb21d5ced4a2":{"description":"Compensation requested for the second half of the following worker proposal: \n\nhttps://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x047fe94861f7e79b0b060067312a09c6a8c6466b35cf1a69bbc3f34b05fbbe53\n\nBased on $1026 ETH Price at time of proposal.","title":"Worker Payout 2/2 12/12/20 - 1/12/21 -- Pulpmachina","hash":"QmeSRxBUoGtyfNTRSfuMzUV2L7UbjZTcHqDoKtwA99rCvL"},"0x02e1c447272cdb830103936dbe7b311f381f2eac8aba0647bc17f2e2ac0ca2ee":{"description":"This payout is for the second ETH payment related to Level K’s worker proposal: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xbc20712a2da2e0a59d9eb5d01f97dd1913730094275938eba8d5a07cca7aa7b1\n\nLevel K’s worker John Kelleher is at Experience Level 5 and with 1/8th time allocated to vacation, requested 14000 USD paid in ETH and 10500 USD paid in vesting DXD.\nLevel K already has above the maximum amount of REP and is therefore not requesting more REP.\n\nThis proposal is requesting the second half of the ETH payment, 8.7288 ETH, which is 7000 USD at the current Coingecko price of $801.94 per ETH.\n\nThe worker proposal covered a wide scope of responsibilities under the headings of Governance, Product, Community Building, and Security.  While I think we should all be moving towards more specific goals and deliverables, the dynamic nature of the DXdao and the range of my previous experience with DXdao calls for my attention across a range of topics.  I met many of my goals while others were reprioritized or evolved. I try to give a solid recap of my activities below, separated by category:\n\n**Governance**\n\n- Participated in Governance 2.0 working group\n- Fielded technical questions about pausing the bonding curve (see https://daotalk.org/t/pausing-minting-from-the-bonding-curve/2469)\n- Attended meetings with DAOstack to support their development of Alchemy\n- Participated in Radicle beta testing\n\n**Product**\n\n- Worked with Zett and rest of product team on Swapr development, testing, and launch\n- Worked with Martin and Nico on Mesa product strategy and the start of development on an IDO focused Mesa\n- Supported Omen planning\n- Supported a few minor improvements to development process\n\n**Community Building**\n\n- Supported onboarding of Keenan and Mike E. for communications and marketing\n- Did an interview with FTX podcast\n\n**Security**\n\n- Coordinated audit of Gnosis Protocol Relayer and Swapr FeeReceiver as well as the re-audit of the Swapr relayer\n- Helped prioritize and plan upcoming audits","title":"Level K Worker Payout Proposal","hash":"QmSbmRBX8SvKubMnLjrn2hx9wR4sEgsu3449yyB66V7eSC"},"0x031275a4bf3a0e1af3f2acbca6277cdcd1d7d419d8eb51d3c461a1a2342ea963":{"description":"**Proposal  Summary:** Send 250 ETH to DXdev MS\n\nThis proposal is a request for 250 ETH to be sent to the DXdev Multi-Sig wallet in accordance with the most recent Treasury Diversification Proposal V3 (TDP V3). The ETH is to be exchanged to the specified stable coin / coins and returned to the DXdao treasury. The specific trade amounts will be determined after the passing of this proposal - depending on ETH price and in accordance with the targets outlined in TDP V3. The target stables are RAI, LUSD, DAI, and USDC. Any eventual excess ETH shall be returned to DXdao.\n\nAt the time of submitting this proposal, the goal is to acquire 250ETH worth of LUSD. \n\nThe DXdev multi-sig (3 of 8) is controlled by a set of active DXdao contributors who have significant REP holdings (which can be slashed by DXdao). This provides an additional safety mechanism if anything were to happen to the funds. MS wallet: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882\n\n**Note:** Due to gas changes in the Berlin Fork the funds will be sent to the MS through the following relayer: 0xb9C11a239CEb03626b439dDeD95AC51ffe000795 which can be verified on etherscan: https://etherscan.io/address/0xb9c11a239ceb03626b439dded95ac51ffe000795#code\n\n**Links**  \nTDP V3: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x8eb53175464364668890940df1f2365601e08bee6697ce4c1c01112f66dc8e19\n\nForum thread: https://daotalk.org/t/treasury-diversification-proposal-v3/3263/\n\nOwnership Verification for Multisig Addresses: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x4e46a28e1215482e2280bca2dbae7765d77c3b4e82fd68b6e16d7d03b48bdc74","title":"DXdao Treasury Diversification #23 || ETH to Stables","hash":"QmQgC95kWACNSFagpTNjdgA7ppwGV8xbqWUTTERGQiEz1Y"},"0x0371113dbfeaece670c1dc4a67b1b0cfe21f0c1149f2d00b81fcd1d5ec9570b5":{"description":"This proposal covers two audits.\n\nThe first is a re-audit of the DXswap (now Swapr) relayer.  The original audit can be found here: https://ipfs.io/ipfs/QmQdF5ZUXAq7upC9tBu27EZ7pJ9pEEFMhJBpCPUTDRJf21  After this audit, significant updates were made (see the open PR here: https://github.com/levelkdev/dxswap-periphery/pull/22) and now need to be audited.\n\n### Scope\n\nIncludes a line by line review of the following contracts:\n\n- dxswap-periphery/contracts/examples/DXswapRelayer.sol\n- dxswap-periphery/contracts/examples/OracleCreator.sol\n\nThis audit will take 4 business days to complete.\n\n\nThe second audit is of the DXswap (now Swapr) FeeReceiver which can be found here: https://github.com/levelkdev/dxswap-core/blob/master/contracts/DXswapFeeReceiver.sol  This contract is responsible for receiving fees from Swapr (in the form of LP tokens), converting these tokens to ETH, and sending the ETH to the bonding curve (DXtrust).\n\n### Scope\n\nIncludes a line by line review of the following contracts:\n\n- https://github.com/levelkdev/dxswap-core/blob/master/contracts/DXswapFeeReceiver.sol\n\nThis audit will take 1 business day to complete.\n\n### Cost\n\n$9000, paid in ETH in two parts, half upfront, half upon completion. Since DXdao can only pay in ETH for the time being, this proposal stipulates that if volatility negatively affects the dollar amount of ETH paid upon the proposal passing, then Sunfish Technology, LLC may make an additional proposal for the difference.\n\nThe first half of payment, $4500 in ETH, is included in this proposal, and a proposal for the second half of the payment will be made upon the report being delivered.  Using the current Coingecko price for ETH of $592.66, the amount of ETH requested in this proposal is 7.593\n\nTHIS AUDIT IS PROVIDED BY SUNFISH TECHNOLOGY, LLC. “AS IS” AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SUNFISH TECHNOLOGY, LLC. OR ITS OWNERS OR EMPLOYEES BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS REPORT, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","title":"Swapr Relayer Re-Audit and FeeReceiver Audit Proposal","hash":"QmRNet4qNr1zTjwrmZFRiLBLhE7tVv5Qkp6cqXpVhtVAk1"},"0x03857ecc467465a031d7a6f357006886bc16eb31e2c022ec28f67cfab816f8f4":{"description":"This proposal is a request for 100 ETH to be sent to the DXdev SAFE Multi-sig with the intent to exchange it to split of USDT and sUSD and immediately return it to DXdao treasury. \n\nIn line with \"Treasury Diversification Authorization Proposal\": https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x5dd6b9bdace1905afcf68c13425b04eb229d5e31ea463b54f591ebd2df05de41\n\nAnd forum thread: https://daotalk.org/t/treasury-diversification-authorization-proposal/2541\n\nOwnership Verification for Multisig Addresses: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x4e46a28e1215482e2280bca2dbae7765d77c3b4e82fd68b6e16d7d03b48bdc74\n\nThis will enable DXdao to continue to build its USD-based portion of the treasury. \n\nThe DXdev MS (3 of 5) is controlled by a set of active DXdao contributors who have significant REP holdings (that can be slashed by DXdao). This provides an additional safety mechanism if anything were to happen to the funds. MS wallet: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882\n\nProposal Request Summary: Send 100 ETH to DXdev MS: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882 To be exchanged to USDT/sUSD and returned to DXdao treasury. \n\n","title":"Exchange ETH to USDT/sUSD for DXdao Treasury #14","hash":"QmSsPn1F8F7x8xTiSzTjXmgFsAZ6FApvqTMerbNvJW9hR6"},"0x0399762b71be7436dc437bf31cc82c5c7e92909790567212fee46ac11d9da5da":{"description":"The purpose of this signal proposal is to ratify the pre-mint of 100,000.00 DXD which will be sent to the dxdao avatar contract address and will be vested with a duration of 4 years. Every year 25,000 DXD will be unlocked.","title":"Should the Dxdao get 100,000.00 DXD as a pre-mint with a vesting duration of 4 years?","hash":"QmT2PU6sVxiqm2BuQXopbCXphpRN64qPHgwehi5YaH4Dke"},"0x03b9044124ae8f43d385c9ded4b527a1fbbc4d6b609f83a901c50c6a81f0c984":{"description":"Hello dxDAO, KnowYourDAO will be facilitating the launch of the \"DAOstack $GEN Club DAO\". Please review [this Twitter thread](https://twitter.com/KnowYourDAO/status/1213589062591897602?s=20) for more context.\n\nRequirements to join DAOstack $GEN Club DAO are:\n\n1. Must hold at least 1k GEN in wallet.\n2. Must have a 3box profile setup and connected to Twitter.\n\nSee [KnowYourDAO's profile](https://alchemy.daostack.io/profile/0x7e19563299ed66d0b108c50a0e44232b8b41b9b6) for an example of meeting the requirements.\n\nDAOstack $GEN Club DAO will be initialized by dropping 1 REP for every 1 GEN held by the account.\n\nThere is no planned launch date, this will happen at KnowYourDAO's leisure, probably in the next week. Please [contact KnowYourDAO on Twitter](https://twitter.com/KnowYourDAO) if you are NOT [on this list](https://twitter.com/KnowYourDAO/lists/daostack-gen-club/members), you meet the requirements, and you'd like to be added to the REPdrop.\n\nAgain, I can't respond to DISQUS or other DAOstack INC. moderated comments, as I've been shadowbanned, so [please contact @KnowYourDAO on Twitter](https://twitter.com/KnowYourDAO) if you have questions or feedback.\n\nCheers.","title":"DAO Launch Announcement: DAOstack $GEN Club DAO","hash":"QmdqkXPq6Tee7opzFHdwpQxS5M4JuX4bm6FEtMC2JGb2zi"},"0x0424e607d9224e6e4d788483aaa3083d13597402240b1c7fcc4bd818730b4f6f":{"description":"**Proposal  Summary:** Send 250 ETH to DXdev MS\n\nThis proposal is a request for 250 ETH to be sent to the DXdev Multi-Sig wallet in accordance with the most recent Treasury Diversification Proposal V3 (TDP V3). The ETH is to be exchanged to the specified stable coin / coins and returned to the DXdao treasury. The specific trade amounts will be determined after the passing of this proposal - depending on ETH price and in accordance with the targets outlined in TDP V3. The target stables are RAI, LUSD, DAI, and USDC. Any eventual excess ETH shall be returned to DXdao.\n\nAt the time of submitting this proposal, the goal is to aquire 250ETH worth of RAI. \n\nThe DXdev multi-sig (3 of 8) is controlled by a set of active DXdao contributors who have significant REP holdings (which can be slashed by DXdao). This provides an additional safety mechanism if anything were to happen to the funds. MS wallet: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882\n\n**Note:** Due to gas changes in the Berlin Fork the funds will be sent to the MS through the following relayer: 0xb9C11a239CEb03626b439dDeD95AC51ffe000795 which can be verified on etherscan: https://etherscan.io/address/0xb9c11a239ceb03626b439dded95ac51ffe000795#code\n\n**Links**  \nTDP V3: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x8eb53175464364668890940df1f2365601e08bee6697ce4c1c01112f66dc8e19\n\nForum thread: https://daotalk.org/t/treasury-diversification-proposal-v3/3263/\n\nOwnership Verification for Multisig Addresses: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x4e46a28e1215482e2280bca2dbae7765d77c3b4e82fd68b6e16d7d03b48bdc74\n\n**p.s. Note:** this proposal also transfers a further 5ETH to the MS, to be used to refund gas costs incurred by MS signers for transactions related to the MS.","title":"DXdao Treasury Diversification #22 || ETH to Stables","hash":"QmVm83Cwyk66a7wMxkVDMFzmXoskVG3GMbfi1KHEZ1DVeP"},"0x04629ac2620fe087b5327894a4c0a655364556ccdfe670dab33eaa319b780189":{"description":"If this proposal passes, the omen.eth ens domain will be set to the latest release: https://github.com/protofire/omen-exchange/releases/tag/v1.1.4\n\nTo verify: \n\n- Clone the repo\n- Checkout the v1.1.4 commit\n- `nvm use v12.13.0`\n- `cd app`\n- `yarn install`\n- Fill out the env file as follows:\n```\nREACT_APP_VERSION=omen\nREACT_APP_INFURA_PROJECT_ID=\"9c6788bb15234036991db4637638429f\"\nREACT_APP_MARKET_FEE=2.00\nREACT_APP_GRAPH_MAINNET_HTTP='https://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_MAINNET_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_RINKEBY_HTTP='https://api.thegraph.com/subgraphs/name/protofire/omen-rinkeby'\nREACT_APP_GRAPH_RINKEBY_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen-rinkeby'\nREACT_APP_KEY_INFURA_API_KEY=6ad6d4a4ec79442eacfa967652729d1c\nREACT_APP_ETH_NETWORKS=mainnet\nREACT_APP_GIT_SHA=4c1b9908c4fe48be3c60eed52f3892c503671d4d\nNODE_ENV=production\n```\n- `yarn build`\n- `ipfs add -r -n build`\n\nThe site can be seen on ipfs gateway here: https://gateway.ipfs.io/ipfs/QmXFee2MXX3q1rey1BX1gLceBNB9VAyUXGbgQjQwyUnj8B/#/24h-volume","title":"Set omen.eth content hash to IPFS hash of v1.1.4 [Vote for this one]","hash":"QmWCKqLaVdiTk64mJR5M7ee7vzCkKGWWPEpDg5hvbSzMGP"},"0x047fe94861f7e79b0b060067312a09c6a8c6466b35cf1a69bbc3f34b05fbbe53":{"description":"Please read the relevant worker proposal post on DAOtalk found here: https://daotalk.org/t/worker-proposal-pulpmachina-12-12-20-1-12-21/2400\n\n**Time Frame**\n\n12/10/2020 - 01/10/2021, 1 month (trial period).\n\nPosition: Governance Ambassador\n\n**Specific Projects**\n\n- Research and prepare reports on DXdao voting trends for future DXdao governance initiatives.\n- Areas of interest include prioritizing proposal engagement, REP distribution to underrepresented stakeholders, voter participation, moving towards more decentralized governance processes, streamlining worker compensation and renewal processes.\n- Conduct worker and community surveys on improvements to current governance structure, KPIs by role (technical vs. non-technical), and signaling-to-on-chain-voting processes.\n- Update Worker Proposal format for new workers versus workers renewing contracts to show KPIs met.\n\n**Goals**\n\n- Research governance initiatives for DeFi projects that DXdao is providing governance-as-a-service to and present findings and recommendations.\n- Coordinate with the community to research and explore new governance capabilities for the DXdao itself.\n- Support organization around and execution of Governance 2.0 initiatives.\n- Coordination with DAOstack on governance platform regarding front-end related issues to improve clarity in on-chain voting process.\n\n**Compensation**\n\nExperience Level: 4\n\nWe believe our experience level places us within level 5, but in good faith, we would like to prove our worth at level 4 first. Depending on responsibilities and feedback from the DAO, we may raise our experience level to 5 for future months.\n\nFull-time (two people holding two (2) part-time roles, 50/50 for a total of 40 hours per week), second month:\n\n- $6,300 (ETH) (90% of $7,000), 50% to be paid once the proposal gets approved and 50% on or after 1/12/2021 when the work agreement finishes.\n- $4,500 (DXD) (90% of $5,000). $2,250 (DXD) vested at 1 year, and $2,250 (DXD) vested after the first year on a linear schedule.\n- 0.1667% REP\n","title":"Worker Proposal 12/12/20 - 1/12/21 -- Pulpmachina","hash":"QmerHb11Jxz2phWWmX7DifHWTALH9WUHAMpZuJTSpcysge"},"0x048a8ad818e8005ac639fecd59100b859dec51882cb21d94d1ed2cbb43c4c670":{"description":"\n    \nThis proposal places a 5000 LUSD order on CowSwap for DXD. See order here: https://explorer.cow.fi/orders/0xb923c1d2efd06be348a4e03dda8bcf907af72081665ce4625da6ac9d9b2c6881519b70055af55a007110b4ff99b0ea33071c720a63e224ca\n\nThis order is placed as part of the [DXD buyback program](https://dxvote.eth.limo/#/mainnet/proposal/0x072519e7fa7d55619fcc675c5c47e446e499ee454da1f2b370825ac447d06758).\n\nThe order is placed at a discount on the price of DXD at the time of creating the order - this is due to the multicall requiring 16 days to pass. Nevertheless, CowSwap matches at the best available price. So the discount just allows some market movement - in case there is no fill for the price, the order will turn into a limit order.\n","title":"CowSwap Order b923c1d2 LUSD / DXD","hash":"Qmf7PHEdTTJ43vppn9QgSXPmAaEJkdviiemBDqr3s3PeYu"},"0x048ea9f93f072584fb9570ea85cb2c18d8b364f85cb5761b5258e92a1a74d949":{"description":"If this proposal passes, the omen.eth ens domain will be set to the latest release: https://github.com/protofire/omen-exchange/releases/tag/v1.1.8\n\nTo verify: \n\n```\nClone the repo\nCheckout the v1.1.8 commit\nnvm use v12.13.0\ncd app\nyarn install\n```\n\nFill out the env file as follows:\n\n```\nREACT_APP_VERSION=omen\nREACT_APP_INFURA_PROJECT_ID=\"9c6788bb15234036991db4637638429f\"\nREACT_APP_MARKET_FEE=2.00\nREACT_APP_GRAPH_MAINNET_HTTP='https://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_MAINNET_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_RINKEBY_HTTP='https://api.thegraph.com/subgraphs/name/gnosis/omen-rinkeby'\nREACT_APP_GRAPH_RINKEBY_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen-rinkeby'\nREACT_APP_KEY_INFURA_API_KEY=6ad6d4a4ec79442eacfa967652729d1c\nREACT_APP_ETH_NETWORKS=mainnet\nREACT_APP_GIT_SHA=722e55bf5f3c5cca9d695b9a93d3feb3a409dbb5\nNODE_ENV=production\n```\n```\nyarn build\nipfs add -r -n build\n```\n","title":"Set omen.eth content hash to IPFS hash of v1.1.8","hash":"QmbTE63sFPnptBGgMFMUc7jf6yAxYu6FihKvJzozqwC9uv"},"0x04f0bc42de9ca796a962aff77043fe6026ac430e0f64dbe269913967029194c2":{"description":"If this proposal passes, the omen.eth and xdai.omen.eth ENS domain will be set to [Version 1.3](https://github.com/protofire/omen-exchange/releases/tag/v1.3):\n- Bonded ether to finalize an Omen market are now claimable through the Omen interface on market finalization.\n- Share precise views of the market details page like the pool or history view.\n- Added wrapped ether and wrapped bitcoin powered by the [Omni Bridge]([https://](https://omni.xdaichain.com/))\n- Network redirect popups replaced with automatic network detection\n- Minor bug fixes and UI improvements.\n\n\nSteps to verify:\n\n```\nyarn install --frozen-lockfile\nyarn build\nipfs add build -r -n\n```\n\nRequirements:\n```\nnode version v12.13.0\n```\n\nYou can access the new version via: \nhttps://gateway.ipfs.io/ipfs/QmQ23Y3fagDFELCKKULHgRZSWvNhsddZnF3NmfqU2rf6H5/","title":"Set omen.eth and xdai.omen.eth contentHash to IPFS hash of v1.3","hash":"QmSuo1uXbAXSRqv7B4zWwWhRd7Dv7FnW54bNstgPybG3jm"},"0x05cf3aa55baac3a45c1a98ce8f602198285360e0acbe68a465d262cef9414c55":{"description":"Hello, This is Tony from keybase chat. I am a full-stack developer (frontend focused), based in Ontario, Canada.\n\n*P.S. Referred by Chris Powers.*\n\n**Timeframe** : 20/12/2020 ~ 03/01/2021, two weeks. (This trial is to exposure my skills for long-term collaboration with DXdao.)\n\n**Responsibilities** : Support the frontend work of Swapr project.\n\n**Experience Level** : I would like to start at lvl 3 for trial period.\n\n**Things I love and am good at** : React, Redux, Redux-Saga, React-Native, Styled-components, ExpressJS, Typescript, NodeJS, Go\n\n**Things I want to learn but am junior with** : Rust, Solidity, Truffle\n\n**Things I don’t like and will absolutely, 100%, definitely not work with** : PHP, jQuery\n\n**My experience** : Worked as a full-stack developer for the past 4 years (mostly remote)\n\n**Past Projects**:\nhttps://apps.apple.com/us/app/id1514944246 (ReactNative + Redux + Firebase)\nhttp://app.canibuild.com/ (React Hooks + Redux + Material-UI, Node.JS + MySQL)\nhttps://snowflakestore.org/ (React + Typescript + Sass)\n\n**Personality** : Super talkative, opinionated\n\n**Some more profiles** : https://github.com/jsockchain , https://www.linkedin.com/in/-tony-xu/\n\nRegarding the compensation, at the end of trial period, I will be requesting\n\n$2250 in DAI, baseSalary 6K * 0.5(2 weeks full-time) * 0.75 (first month of trial period)\n$1500 in DXD, (4K * 0.5 * 0.75)\nThe DXD would be vested over 24 months with a 12 month cliff.","title":"Developer Proposal","hash":"QmRe2NnT5cxBZqAkaLr38KpddCXHavy6fUcFq3YeaKroBi"},"0x0602d5375b81ef4a5c96740a1229014e45f8a59561050585d7257aa48bcf5c70":{"description":"In this proposal I'm requesting trial worker payout as outlined in this [dao talk post.](https://daotalk.org/t/dev-proposal-eugene/2313)\n\nIn this month my responsibilities were mostly with zett for governance UI in swaper.\n\nhere is proof of work:\nhttps://github.com/levelkdev/dxswap-dapp/pull/146\n\nAlso i have done new design implementation and bug fixes for governance UI.\n\n-According to my post i will be applying for 2250$ (lv.3),  according to current coingecko price 584.61$ that is 3.8487ETH\n\n-And also $1500 in DXD is equal 2.5 DXD\n\nBelow is the image of calcualation on coingecko\n\n![](https://ibb.co/XWzhtj1)","title":"Dev Eugene Worker Proposal 27/11/2020 to 10/12/2020","hash":"QmWnfTNzxFaKCgHempwcqtE7EMo4DTev7LvhB7d6fR8CE7"},"0x064e0a90970442a4f7a04163c2afdcd7b65c83d00690ccb49e2af3441baddf5d":{"description":"_Below is draft text for a $1m extension of the buyback program. Some data on the buyback program in the next comment. Open for comments on things to add/subtract._\n\n**Background**\n\nThe [DXD Buyback Program](https://dxvote.eth.link/#/mainnet/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) was passed by REP holders in May of this year. Since then, 8688.98 DXD have been purchased on mainnet and Gnosis Chain for an [average price of 0.159 ETH/DXD](https://docs.google.com/spreadsheets/d/17C1fcq5JshfG8Zsi_Sv7lmqrrsdT9DKB69XMBkrUp2s/edit?usp=sharing). Using the USD price at the time of purchase, $4.6m of DXD has been purchased. This is just over 17% of the DXD circulating supply.\n\nThe [buyback program was updated](https://dxvote.eth.link/#/mainnet/proposal/0x58396cc329f5c33bfa29a2e264a05adcad53567a9dcf3e601392d65779dad153) in June to increase the slippage tolerance of trades as well as clarify the accounting measures. The buyback program has since been extended [four times](https://dxvote.eth.link/#/mainnet/proposal/0xf9ad08c10220621e2aa15eb6ef177f07acd8e2ff6ef8311a0258dd70335c4136). The total amount of DXD purchased is approaching the limit placed on it by the previous proposal and soft community consensus has demonstrated support for another $1m extension.\n\nAccounting for the 8688.98 DXD purchased and the 461 DXD that has been issued to contributors in vested contracts, the 458 DXD that has been issued to LPs for Swapr farming and the 1949 DXD in unissued DXD compensation (444) and to LPs for Swapr farming rewards (458.6), the outstanding DXD supply (41,008 DXD) represents a market cap of $22.8m - still comfortably below the $47m in ETH and stables in the DXdao treasury and the $7.8m in the buyback reserve. The buyback program is intended to address this discrepancy and acquire an undervalued asset.\n\nIn line with the [most recent buyback extension](https://dxvote.eth.link/#/mainnet/proposal/0xf9ad08c10220621e2aa15eb6ef177f07acd8e2ff6ef8311a0258dd70335c4136) the mainnet signal proposal is also sending the funds necessary to complete the buyback, and as with the previous transfer, these are being sent directly to the GP relayer on Gnosis Chain. Second, this proposal suggests the extension be done in an ETH amount, equivalent to the price of $1m at the time of writing this proposal. Hence, 305 ETH. Using ETH rather than USD in this extension allows for easier monitoring and execution of the buyback as the exact amount can simply be deposited into the GPv1 relayer on Gnosis Chain. Tracking also becomes much easier as one has to simply check the funds in the GPv1 relayer. \n\n**Details**\n\nThis proposal extends the DXD Buyback Program for another $1m to $6m total under the same conditions outlined in the original [Buyback Program signal proposal](https://dxvote.eth.link/#/mainnet/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) and [the parameter update](https://dxvote.eth.link/#/mainnet/proposal/0x58396cc329f5c33bfa29a2e264a05adcad53567a9dcf3e601392d65779dad153).\n\nThis proposal ends 305 ETH to the ETHrelayer contract, identified as, 0xb9C11a239CEb03626b439dDeD95AC51ffe000795 , which will relay the ETH to the dev multi-sig address, previously identified as 0x5f239a6671bc6d2baef6d7cd892296e678810882 whose signatories have been verified as REP holders, which will convert it to WETH and bridge it over to be deposited into the [GPv1 relayer on Gnosis Chain](https://blockscout.com/poa/xdai/address/0xA369a0b81ee984a470EA0acf41EF9DdcDB5f7B46/transactions), 0xA369a0b81ee984a470EA0acf41EF9DdcDB5f7B46.\n\nNOTE: This proposal sends a further 10 ETH to the relayer, to be wrapped and deposited into the DXdao Gnosis Chain Treasury.\n\nThese and other DXD purchases through the Buyback Program have contributed to the community’s intention to use the buyback reserve to purchase DXD. ETH from [DXdao’s general treasury](https://etherscan.io/tokenholdings?a=0x519b70055af55a007110b4ff99b0ea33071c720a) can be used in lieu of the buyback reserve until the DXD token contract is upgraded and that ETH is recovered. In total, the [buyback reserve](https://etherscan.io/address/0xa1d65E8fB6e87b60FECCBc582F7f97804B725521) has 2,499 ETH and so far, 1387.78 ETH has been used to purchase 8688.98 DXD through the buyback program.\n\n**Risks and considerations**\n\nThe program will take place on Gnosis Chain, a sidechain with less security properties than Ethereum. The Buyback Program has been running for over half a year with few problems; the GP Relayer has worked to complete the purchases at the market price. There is a concern that Gnosis Protocol v1 on Gnosis Chain will have limited support, but DXdao community members are striving to maintain the network of solvers. The community is also exploring additional options\n\nDXdao has already spent over $4.6m repurchasing DXD. This has increased the price of DXD relative to ETH but it still falls below the book value of ETH in the treasury.\n\nFull execution of this proposal relies on the Dev multi-sig, which has already bridged and transferred millions of dollars of assets to Gnosis Chain.","title":"DXD Buyback Extension #5 (Signal and Transfer Proposal)","hash":"QmYVymWY2kUA4kp5qiUBWBTWLig6wKPB5Njvr1uZap9MSA"},"0x065138adc0003b9bab76f90a46fbfd381153b6352aa3a7fe82584f4659c77a19":{"description":"During the initiation of the DXdao bonding curve sale I (Patrick Rawson) wrote an article and provided social media support across Medium, Twitter, LinkedIn, Telegram, and Discord for the sale. I did this without first asking the DXdao as it seemed like a prudent and immediately needed support effort, given the traction the sale was getting on social media. That is: waiting a week for a “marketing proposal” to pass would not have worked, as the DXdao was receiving attention in the moment. The article was ultimately successful, and shared multiple times on trending threads across social media, including: Telegram, Discord, LinkedIn, Twitter, and 4Chan.\n\nNow that the DXdao has ratified a first version of its Worker Compensation Guidelines, I am testing to see if the value delivered from my supporting “influencer marketing” is redeemable in the form of Reputation and DXD tokens. This is partially an experiment to see if the below demonstrable value translates into actual value as determined by the DXdao, i.e. I am providing a retroactive “proof-of-value.”\n\nFinally, in the event that this proposal passes I would like to be considered as a writer/influencer for additional marketing campaign support for upcoming DXdao product launches and/or major announcements. This way I can plan in advance instead of writing at the time thereof. This would translate into whatever full-time or dedicated marketing contractor for a given future campaign approaching me for support work for said campaign.\n\nFull proposal 👇🏻\nhttps://docs.google.com/document/d/1vX2THOC3UuFAQDgkpnrZoQM11NBt3a4TVL-a6id_spI/edit#","title":"📣 DXdao DXD Sale Marketing Support","hash":"QmZr7Kecvo6DMYqBiE6rXHQf33U91xVKPCtab9CCfgkwMd"},"0x065b9659c09ab315219b49ace46a7a3edb1d9e7ebd5636d6cdfb307be79acf77":{"description":"Setting ENS resolver contracts for dxDAO domains. More information can be found here: https://daotalk.org/t/next-steps-for-the-ens-domain-dxdao-eth/1130","title":"dxoracle.eth set resolver contract ","hash":"QmZojFQekMwSph4fypydYHYEhkhba7QL1hWwVgiGEY5HEb"},"0x066de32ab70c8bb3090edfe7c170041d3046c480a446f1858c6a18788ece97c4":{"description":"DXdao community seeks to incentivize contributions to DXdao products. In conjunction with [1kx Capital](http://1kx.capital/), DXdao is sponsoring two bounties at the [Gitcoin Grants R8 Hackathon](https://gitcoin.co/hackathon/gr8/?). This signal proposal lays out the conditions and rewards for the two bounties.\n\nVoting for this proposal signals a future commitment to fulfill the bounty rewards as defined below:\n\nBounty #1: Omen Integration\n\nReward:\n\n1st place: 3 ETH, 0.1% of reputation (REP) in DXdao and $500 of DXD vested over 6 months\n\n2nd place: 0.05% of reputation (REP) in DXdao and $250 of DXD vested over 6 months\n\nBrief description: Award will go to team with best integration into Omen prediction markets, some suggested areas are liquidity provisioning, scalar markets and xDai integration. Teams will be judged on the usefulness of the Omen integration and creativity in design.\n\nAdditional information and clarification on bounty will be delegated to @[Corkus](https://daotalk.org/u/corkus) and other Omen contributors\n\nBounty #2: IDOs on Mesa\n\nReward:\n\n1st place: 3 ETH, 0.1% of reputation (REP) in DXdao and $500 of DXD vested over 6 months\n\n2nd place: 0.05% of reputation (REP) in DXdao and $250 of DXD vested over 6 months\n\nBrief description: Award will go to team with best use of Mesa and servicing Initial DEX Offerings (IDOs). Teams will be judged on project’s utility and value to a fair token distribution, while utilizing Mesa\n\nAdditional information and clarification on bounty will be delegated to @[LevelK](https://www.levelk.io/) and other Mesa contributors\n\nPassage of this proposal will authorize the creation of these bounties, with additional details to be defined by delegated parties, including judging.","title":"Gitcoin Hackathon Sponsorship [Signal Proposal]","hash":"QmdFdN624cQ2JbuW1y8Arju3y4ybmeBWJVNhrMk7WpgYLR"},"0x0685ad1366d6d51899db55ed19d2cd343977df9d757fa652a374ff9422053d70":{"description":"<!-- Yay, no errors, warnings, or alerts! -->\n\n### Summary \n\nAfter the successful passing of the proposal by Stakewise to further stake 2k ETH from the DXdao treasury. This post lies out an execution plan to move forward with the proposal.\n\n### Details\n\nDXdao will rely upon the Multi-Sig `0x9467dcFD4519287e3878C018c02f5670465a9003`, which has already handled previous ETH staking proposals. Once the sETH2 tokens are acquired, the MS shall return those funds to the mainnet DXdao treasury.\n\nThe ETH will be staked natively through [https://app.stakewise.io/](https://app.stakewise.io/) \n\nThe 2k ETH will be acquired in 4 tranches of 500 ETH - limiting the amount of funds in any given MS at any given time. \n\nThis proposals moves the first tranche of 500 ETH to the above-mentioned MS - making use of the ETH Relayer: `0x3e99bEd13071176fE06b317b33e2dcd1E1c9f2BE`.\n\n\n### Risks\n\nTransfer of these funds relies on the DXdao MS. Moreover, the staking platform itself presents risks.","title":"Staking ETH - Stakewise - 1/4","hash":"QmdGyTcf14YnF93bijmUmB2FSLrtdwMi9WEG6vXFuJEED8"},"0x06fce2bab66419502452be5617cb90ca0aaa6f2878ca531d7fddab02ff9a361d":{"description":"This proposal wraps 400ETH to WETH with the Mimic Wrapping Vault: https://etherscan.io/address/0xec59469b617dec41ad9b37d2aa6732a50aeb963b#internaltx\n\n","title":"Wrap 400 ETH","hash":"Qme3vaetvC6PfCQ3Tt7eL3kUkk7BhCDAMCw8CCAEXgHrkT"},"0x072519e7fa7d55619fcc675c5c47e446e499ee454da1f2b370825ac447d06758":{"description":"_Tldr, this proposal would update the parameters of the DXD Buyback program and extend by $500k. There are new parameters that change the definition of NAV that govern purchases. This was discussed on [DAOTalk here](https://daotalk.org/t/authorize-500k-of-dxd-buybacks-with-new-parameters-proposal/4434)_\n\n## Background\n\nThe DXD token was launched through a [novel bonding curve contract](https://dxtrust.eth.limo/#/), where DXD could be minted or burned in exchange for ETH in the buyback reserve. The bonding curve [was later paused](https://develop.dxvote.dev/#/mainnet/proposal/0x97c7d7e5ed9f74f62ef5d15a6dffac8a62a4d52b883491a7e8b13cf7816991ad) and the DXD Buyback Program was launched in May 2021. The initial 3,659 DXD was purchased by DXdao’s general treasury, while almost 11,000 DXD was purchased [using funds from the buyback reserve](https://daotalk.org/t/proposed-dxd-token-model/2898).\n\nLooking ahead, the community is moving to [a new DXD token model](https://daotalk.org/t/dxd-token-working-group/4388/10), but while these discussions are ongoing, DXdao governance is considering[ more medium term](https://daotalk.org/t/dxd-buyback-update-and-next-steps-july-2022/4374) solutions to drive value to DXD. and discussing what to do once the buyback reserve is depleted after DXD Buyback Extension #9 extended it for the last 107 ETH. [DXD Buyback Extension #8](https://develop.dxvote.dev/#/mainnet/proposal/0x69a881265303706f921c9c1ad25de4b0635ff288893455b34f18cdaf9e7f86de) passed on mainnet & said:\n\n> If and when the DXD Buyback Program depletes the buyback reserve, funds from the DXdao treasury can be used to purchase DXD on the open market at up to 70% of NAV, so long as this calculation accounts for runway and future funding for product development.\n\n## Details\n\nThis proposal authorizes up to $500,000 of DXD to be purchased from the general treasury as long as the DXD NAV Ratio, which is the DXD Circulating Market Cap divided by DXdao Treasury NAV, is under 70%. \n\nOrders may be no more than 25% of DXD average daily trading volume and can only occur three times over seven days. Buyback order submissions can be above the 25% ADTV amount in the event that the previous week saw buyback orders with a combined purchase size less than 75% of the DXD ADTV.\n\nDXD Circulating Market Cap is calculated by taking the price of DXD on Swapr mainnet and multiplying it by the total amount of DXD that is outside of DXdao’s treasury (mainnet, Gnosis Chain and Arbitrum one), DXdao’s DXD vesting contract and any other DXdao-owned contracts on Ethereum, Gnosis Chain, Arbitrum or any chain with a DXdao-sanctioned base. DXD issued for contributor compensation will contribute to the DXD Circulating Market Cap calculation when the DXD vests.\n\nTreasury NAV is the assets of DXdao minus its liabilities. DXdao’s assets are made up of Core Assets and Auxiliary Assets. Core Assets consists of all ETH, staked ETH, stablecoins and Swapr LP deposits owned by DXdao on Ethereum, Gnosis Chain, Arbitrum or any chain with a DXdao-sanctioned base. Core Assets contribution to Treasury NAV is 100% of its current USD value. Auxiliary assets are all non-core assets in DXdao (excluding DXD & GEN). Auxiliary Assets have an adjustable Treasury NAV Contribution Percentage. Auxiliary Assets’ contribution to Treasury NAV is its current USD value multiplied by its Treasury NAV Contribution Percentage. As part of this proposal, all Auxiliary Assets are assigned a 25% Treasury NAV Contribution Percentage.\n\nFor Treasury NAV calculation, DXdao’s liabilities are defined as three years of DXdao’s USD monthly runway, currently estimated at $290k a month, or $8.7m.\n\nFor clarity, below is the current DXD NAV Ratio calculation.\n\n\n\n* Circulating market cap ($15.6m) - Current price on Swapr mainnet ($430) multiplied by DXD Circulating Supply. Total DXD supply (148,976) minus [DXD controlled by DXdao](https://docs.google.com/spreadsheets/d/17C1fcq5JshfG8Zsi_Sv7lmqrrsdT9DKB69XMBkrUp2s/edit?usp=sharing) (112,872) is 36,104 DXD, so DXD circulating market cap is $15.6m.\n* Treasury NAV ($28m) - Core Assets ($36m) plus, 25% of $$ value of Auxiliary Assets ($722k), minus $8.7m. [See breakdown here](https://docs.google.com/spreadsheets/d/16qohANt7KjYmknIvgHkWtWcma2_QQU12ik6fvqxk0cc/edit?usp=sharing)\n* Current DXD NAV Ratio: 55.6%\n\n## Risks and Considerations\n\nBuybacks are typically carried out on Gnosis Chain, which is a sidechain with a lower security model. The [same risk factors](https://ipfs.io/ipfs/QmUxvBCgv6nCq2BdKJTKsSbX7hQ6jAixqCBrpgW1QiZ8Lv) that were laid out in the original DXD Buyback Proposal apply here. There is no guarantee that buyback purchase will sustain the price of DXD and it does decrease the value of the treasury.","title":" Authorize $500k of DXD buybacks with new parameters","hash":"Qmcr3osA1vkR5yDQMmMbq5R9uMGLZHcu1J4frzGLTDWQh2"},"0x0727b7f67379baf262b4ecb288555c2ba79b662527cc0e572c5de13a0281adda":{"description":"This is the combined proposal for the 2nd half of my trial period month and Gitcoin bounty payment which has been merged successfully into the master branch of Omen repository along with the updated requirements.\n\nGitcoin bounty description https://gitcoin.co/issue/dxdaohackathon/omen-exchange/1/100024191\n\nDuring my first month at DXDAO, I was responsible for successfully merging Compound token integration into categorical markets including updated requirements and change requests diverging from the original bounty as well as several other bug fixes and improvements along with code-review and technical discussions.\nSome examples of my work so far can be found here-\n\nhttps://github.com/protofire/omen-exchange/pull/1590\nhttps://github.com/protofire/omen-exchange/pull/1641\nhttps://github.com/protofire/omen-exchange/pull/1570\nhttps://github.com/protofire/omen-exchange/pull/1597\n\n\nI am requesting 2.811 ETH and 811.15 REP for the second two weeks of contribution as a level 5 worker for 20 hours/week at 75% payment amount based on historical data at https://www.coingecko.com/en/coins/ethereum/usd#panel at 00:00 hours on 06/01/201 ETH price was 1067.20$\n(First half of proposal here\nhttps://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xc8503907638e9f3cb80f929762edf79a512645761eb35a2434abffc5d3a33aee )\n\nAnd 3 ETH + 1480 REP (0.1% of 1.48M) based on the guidelines in the Gitcoin bounty.","title":"Worker Payment / Pritam Roy/ Last 2 Weeks for period - 06/01/21- 06/02/21 and Gitcoin bounty","hash":"QmRa2qKsmi3P2ecGz8ikWaoFpGS7Ez9FXgZmJsz4wq7Qsd"},"0x074bba4a35b8932025cc63499cc8a60cbae8956ddbbd26c0e79682f53a6177d6":{"description":"This payout is for the second payment related to the worker proposal: \nhttps://daotalk.org/t/worker-proposal-07-2020/1654\n\nThe payment is \n\n- 3.82 ETH which is 1,319 USD at the current coingecko ETH price of $345\n\n- 3.8 DXD which is 1.000 USD at the curve at a price of 1.0172 ETH\n\n- 2,082 REP","title":"Payout 2/2 Worker Prosposal 07/20 - 08/20 for nicoelzer","hash":"QmeRSWmj1S7D8CE3QkqamQKjAp5tNt98LZbFacfhV17DX1"},"0x07a712fd4e18fdf0c2db63fdec9071366c493c30492a7302823b84fdeee47fd9":{"description":"This proposes 1.5 months (6 weeks) of work starting on 15/05/20.\n\nThere are several products which are owned and operated by the DXdao.  Below is a roughly prioritized list of efforts which could fall under the purview of this proposal.  This proposal will fund a 3 person product development team enumerated under the “Payment Description” below to work full time, as well as allow some budget for onboarding new developers.  This is the same team that launched the fundraiser and has provided support for Mesa and other DXdao efforts.  The last work proposal can be found here: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xf3ace9e04caccd90316c344ba3bd32408498f1851a3db08bfbcf7b88181d6c47\n\n### To-Do list (in priority order):\n\n- Omen integration into DXdao.\n- Release DXswap v1.0.0 https://github.com/orgs/levelkdev/projects/1\n- Release DXtrust v0.3.0 https://github.com/levelkdev/BC-DAPP/projects/1\n- Release DXdao-website v0.1.0.\n- Start development of Mix v0.1.0.\n- Improve on-chain connections for the Dxdao (https://daotalk.org/t/connections-overview/1316/4)\n\nDates: 15/05/20 to 01/7/20\n\n### Payment description\n\n- 45 Days full-time (40hs/week) engagement from github:AugustoL (Senior Full Stack JS Dev) at 3000 USD/Month salary.\n- 45 Days full-time (40hs/week) engagement from LevelK (Senior Full Stack JS Dev) at 3000 USD/Month salary.\n- 45 Days full-time (40hs/week) engagement from corkus (Product Manager, UI/UX Designer) at 3000 USD/Month salary.\n- New developer fund (to be used only to on-board new developers) at 1500 USD/Month.\n- 10050 REP (1% Rep issuance at 15/05/20) to github:AugustoL.\n- 10050 REP (1% Rep issuance at 15/05/20)  to LevelK.\n- 10050 REP (1% Rep issuance at 15/05/20) to new developers.\n- 2500 USD for corkus in lieu of receiving Reputation.\n\n### Historical REP issued to REP Recipients\n\n- Level K: 8154.75 + 42,346 pending existing proposals + amount locked in voting\n- github:AugustoL: 31,946 REP in pending existing proposals.\n\n*This is the amount of REP as issued in exchange github:AugustoL work in past proposals, github:AugustoL does not claim any ownership of the this REP, this REP was issued in exchange for under github:AugustoL cryptographic authorization to addresses outside github:AugustoL ownership or control\n*\n####\n\n*The salary was calculated based on the current salary on the market and available funds in the DXdao.  The salaries are below market rate because the team is committed to the DXdao’s success and believes it is important to spend our limited funds in a responsible manner. For reference:\n*https://www.payscale.com/research/US/Job=Senior_Software_Engineer/Salary\nhttps://www.indeed.com/salaries/senior-developer-Salaries\nhttps://www.ziprecruiter.com/Salaries/Senior-Software-Engineer-Salary\nhttps://www.payscale.com/research/US/Job=Product_Manager%2C_Software/Salary\n\n\n#### Total: 30150 REP and 18250 USD (paid in ETH, using market price at time of payment)\n\n### Payment schedule\n\n- 50% of the USD payment from the full-time agreements to be sent upfront in this proposal In ETH (8000 USD), it will be distributed internally between the three developers in a gnosis safe under their control.\n- 50% of the USD payment from full-time agreements to be sent at the time the work agreement finishes in ETH (8000 USD), which means that the payment proposal will be created a week in advance (24/06/20).\n- 2% Reputation distribution to be done directly in separated proposals (1% each) to github:AugustoL and Levelk, to be sent at the time the work agreement finishes, which means that the REP issuance proposal will be created a week in advance (24/07/20).\n- New developer fund ETH and REP will be distributed through one or more proposals submitted with cryptographic signatures of github:AugustoL, LevelK and corkus.\n\n### New Developer Fund\n\nThe developer fund for this proposal will be 2250 USD and 1% REP that would be claimable only by users who can verify the github account ownership used for their collaboration and they will have to provide cryptographic signatures that corroborate the collaboration from Levelk, corkus and github:AugustoL.\nInterested developers should join the #development chat room in our keybase community, introduce themselves and communicate on what they will be working on. The goal here is to on board new developers to the community to help the DXdao deliver better quality products and have more developers involved for future projects and products maintenance.\n\nCryptographic saltpack signatures of this proposal can be found belov of LevelK, corkus and github:AugustoL can be found below and verified in keybase.\n\nhttps://etherscan.io/block/0x56f527ebc22afb71261cec5bd7ffc7fcc5e4cdb1259828712d06f02f43f8f004\n\nMessage: 0x56f527ebc22afb71261cec5bd7ffc7fcc5e4cdb1259828712d06f02f43f8f004\n\nKeybase:AugustoL:\nBEGIN KEYBASE SALTPACK SIGNED MESSAGE. kXR7VktZdyH7rvq v5weRa0zkJQyCgF oLzFDBStBCwWMm9 3OW5XcOwMkMsH4B 4wRJq53AWjP6rcs TqUszwa7tfSnyPA UALq5QziKAdzr4O z9lS75AgGpk41M6 XBtbFU53GXCgPJo 0h95ovNuyf2ybwN q54qyYBbZ30pJN0 yWoEYhFDynSyIGM KRzkI07ivm0dqOu 2n4vg9gW3hPbPKl OGawdO2brEwHINA i62vuYPgDGhVZ71 uGynqNeJiuBthG2 wUw0f867oZ6Zpdr uXqsu. END KEYBASE SALTPACK SIGNED MESSAGE.\n\nKeybase:jpkcambridge (LevelK):\nBEGIN KEYBASE SALTPACK SIGNED MESSAGE. kXR7VktZdyH7rvq v5weRa0zkLRsla3 zRx5HYyYySBYJ3P iv6aFRMgb2Ivgob SJkOCu3Ymc6qChc Rt1T8SAA0sPRfpf d2dIX50JRN7tkXR Wj94THQ8yrpCBa2 tolVvHFh2sPHa8Q A1LmwqlzhHNPV0J fG9ME5DY9Unzb08 KWEmAhQyJ19bFFt GYH1lpnfhszDj08 yU67OhxrnqAD4Rf hjYvbO2brEwHINA i62vuYPgDGhVZ71 uGynqNeJiuBthG2 wUw0f867oZ6Zpdr uXqsu. END KEYBASE SALTPACK SIGNED MESSAGE.\n\nKeybase:geronimo (corkus):\nBEGIN KEYBASE SALTPACK SIGNED MESSAGE. kXR7VktZdyH7rvq v5weRa0zkLcj3H6 CK7cMcHJs7It1M8 ruKZXLI14hqcvSs Rbgc0O32OH5zPZC 5MGR9aI3qZpOvsE iCRj0nMveiijrTQ vGxxPgZohSCXC9K klLWTB3IRjh9GX0 WvMYpEuc6WouJVp Ludv71ddChekWBn JzPC3xaFHS7ZzSv AM4N41Ab5j9PRoL ELOMhFlCwmlWDEd Ytz7rO2brEwHINA i62vuYPgDGhVZ71 uGynqNeJiuBthG2 wUw0f867oZ6Zpdr uXqsu. END KEYBASE SALTPACK SIGNED MESSAGE.\n","title":"Development Work Proposal 2","hash":"QmdKeLecaDBdycJxPHa6sBLSuFyzUSNN6Mv9VXiGkc7cX7"},"0x07ffee99716fe56b20b9ef680412f39cc0ea1c2e25d62828645fd2e22fc248df":{"description":"I am submitting my Redemption Balancer under DXD approved Token Model, following Redemption Balancer guidelines.\n\n\nTransfer Transaction of my 72.48 DXD to the DXdao multisig:\nhttps://etherscan.io/tx/0x3467e7b85167e457815430d323ef6fbbefcf46ad13d88a8cb982414b14dc5a23\n\nPlease find there my screenshot of the ‘Redemption Balancer Calc’, with assets to be requested, prices and circulating supply dated to the moment of the DXD transfer to the DAO:\nhttps://daotalk.org/t/mainevents-redemption-balancer-under-dxd-token-model/4871\n\n","title":"Mainevent's Redemption Balancer under DXD Token Model","hash":"QmRntHx1iVmQkCqe92dz4sKuSWx5RpMDZ4ZsumCQuqMbNT"},"0x08382f2197b647b338a15bcb33287dc3edc278f8c089a12952b87ee3fbadb42a":{"description":"This proposal will update the resolver for swapr.eth to point to the content hash of the new beta 8.1 version of Swapr, described in [this GitHub release](https://github.com/levelkdev/dxswap-dapp/releases/tag/v1.0.0-beta.8.1).\n\n## Verifying the IPFS hash\n\nIn order to verify the IPFS content id (or hash), clone the repository and checkout the `v1.0.0-beta.8.1` tag. The tag points at commit `6647dd13f8eac0ebf6a6e26ef2ef65b88a5ac7fb`.\nAfter making sure you're using the correct source code/commit, install the required dependencies using node `v16.13.0` and `yarn install --force`.\nNote that there should be no env file. Once dependencies are installed, run `yarn ipfs-build`. This command will bundle the application in a format compatible with IPFS deployment.\nIn order to get the content hash of the built application once the `ipfs-build` command ends, simply run `ipfs add -rn ./build`. The resulting hash should be `QmSzviVVKBcXHMghY3ZMwQXwzGmhx5aWjtNo8CZt5aTYMn`.\n\nYou can check out the build live by clicking [here](https://bafybeicfhtvm543idbdzmtjw6o5gwkhzkjywqt2tb3qfwwkudjuvjhkjoe.ipfs.infura-ipfs.io) (the CID has been converted to v1 and the Infura IPFS gateway is being used).","title":"Update swapr.eth resolver to point to beta 8.1 release of Swapr","hash":"QmNq4hPkpd1htGgsNrPjy1wGn94bVqdNvSkAXhMQdZph88"},"0x084f14d12e448cf175d31ab6a6dd4469bfebaac47565ca93f788af16d52123ff":{"description":"The ENS .eth Registar contract is required in order to reclaim the DAO's .eth domains, after a smart contract migration by the ENS team.\n\nMore info here: https://daotalk.org/t/next-steps-for-the-ens-domain-dxdao-eth/1130/3\n\nVerify GenericScheme code here: https://etherscan.io/address/0x973ce4e81bdc3bd39f46038f3aaa928b04558b08#code","title":"Register generic scheme for ENS .eth Registrar","hash":"QmQEG4dJP3PwiPuDpRsRUXxgFuFQujeGGwkr7BcYS93PJg"},"0x0907b75de1060df04d343a050130726cbe4c3bb741b6f3a6c0b680e8940e393b":{"description":"I want to help out the DXdao in diversifying its treasury to stablecoins. I exchanged 50 ETH to 63,313.75 DAI for a price of 1266.27 DAI per ETH.\n\nhttps://etherscan.io/tx/0xdaf4f716d3598d854db38efe9592d48f7c26e31da66c2a33c4c26fb1ad4ed505\n\nI transfered 63,313.75611 DAI a few minutes later to the DXdao avatar address.\n\nhttps://etherscan.io/tx/0x12fc3caa95f4b9c564b91e9c3e8447cef65b3b3b12a231c67c89e3bfca6f613f\n\nI am requesting 50.50 ETH as compensation for my contribution to the member balancer program.","title":"Swap 50 ETH to 63,313.75 DAI  (1266.27 ETH/DAI)","hash":"QmUTBvepCtYVDSy65D1UFeP3ckmekuiHQiEv7Cf8UibVTH"},"0x0923889e7a30db558b6444d1ebfdda07052e28e71fbd3f8d51f30718cd7fc853":{"description":"Hola, \n\nThis proposal will add all recent valid markets according to the validity rules which have been curated by DXdao community.\n\nAll markets can be verified here:\nhttps://docs.google.com/spreadsheets/d/1_Ozy2NfiEog9Mh4ZbM26uY4NGFWAWTsO9VbFkn3oF20/edit#gid=0\n\nor directly on omen.eth.link ","title":"DXdao market curation - batch #6","hash":"QmYpDt8t8mWaPHjT2pc856iMbHcmrzhFgWVV8C58yRm8yp"},"0x09371541c2a1a497a9e80b5fb830f83529b1ab7e69f829b1db33cda273373ef3":{"description":"Redo of proposal based on discussion\nSee details here: \nhttps://daotalk.org/t/proposal-bizdev-and-product-focused-request-for-value-rep/1578","title":"Redo: 2.5 ETH + 0.55% REP for BizDev and Product focused work","hash":"QmRsw4wHLt7VLg7teAtrTF2NzNeVKz5JxoBQHzC3NeZvR2"},"0x0a3d700ed853358209ed8709823816ec799bfcb7f975afe4e0d41149521e173d":{"description":"Hi, this is Tony, and I've been working on the Swapr as a frontend developer since 2021. \n\n*P.S. Referred by Chris Powers.*\n\n**Timeframe**: 01/01/2021 ~ 02/03/2021, 2 months of trial\n\n**Responsibilities**: Support the frontend work of Swapr project.\n\n**Experience Level**: Level 3\n\n**Things I love and am good at**: React, Redux, Saga, ReactNative, Styled-Components, Typescript, NodeJS, Golang\n\n**Things I need to learn more**: Rust, Solidity\n\n**Things I don't like**: PHP, jQuery\n\n**My experience & past project**:\n\nI've been working as a full-stack developer for the past 5 years.\n\nhttps://apps.apple.com/us/app/id1514944246 (ReactNative + Redux + Firebase)\n\nhttp://app.canibuild.com/ (React Hooks + Redux + Material-UI, Node.JS + MySQL)\n\nhttps://snowflakestore.org/ (React + Typescript + Sass)\n\n\n*Here's what I've done so far with Swapr team*:\n\nhttps://github.com/levelkdev/dxswap-dapp/tree/feature/governance-proposals\n\nhttps://github.com/levelkdev/dxswap-dapp/tree/feature/liquidity-mining\n\nhttps://github.com/levelkdev/dxswap-dapp/tree/components/styled-search\n\nhttps://github.com/levelkdev/dxswap-dapp/tree/component/skeleton-loading\n\n**Regarding the compensation (01/01/2021~01/02/2021)**\n\n2 weeks 50% of level 3 = baseSalary(6K) * 0.25\n\n2 weeks 70% of level 3 = baseSalary(6K) * 0.35\n\nTotal : 3600 DAI + $2400 in DXD (4K * (0.25 + 0.35))\n\nThe DXD would be vested over 24 months with a 12 month cliff.\n\n***This proposal is for the first month of two months trial period and next proposal will be submitted by end of trial period.***\n\nCompensation for 2nd month would be\n\n4 weeks 90% of level 3 = baseSalary(6K) * 0.9 + 90% of DXD baseSalary(4K)\n\nTotal : 5400DAI + $3600 in DXD","title":"Tony - Developer Proposal","hash":"QmQ9pzPuza27yJvqMyNPY8Ppuy9PrzZ27ig6WkHj9kYns9"},"0x0a53f38a345c5cb0ed68b4b0423e161346cb950909df7d8c354f64fd907b3da4":{"description":"Hallo,\nnow that we have seen already two markets which are clearly agains the [market validity rules](https://omen.eth.link/rules.pdf) ( example: https://omen.eth.link/#/0x5b3bc02667456c0a881481eff858b9a5513a7bce ) I am proposing to add a blacklist to omen which will only be used if an dangerous/invalid market will get attraction/trading volume.","title":"Add Omen blacklist ","hash":"QmfTPs5JtXg6ddd44pKxTU7d4KZe7G55qGcKmY61Y7NXzE"},"0x0b197ef7733d4cd14ed15e413bfa640723034b63d9fdd0bb97724f2da59dfe40":{"description":"Hola, \n\nThis proposal will add all recent valid markets according to the validity rules which have been curated by DXdao community:\n\nhttps://omen.eth.link/#/0xf623e2503be151183fcebc400f669bb97f37df14\nhttps://omen.eth.link/#/0xea6300a77492d327f4e8269086df6d48aa86e61d\nhttps://omen.eth.link/#/0xed6940e49cee029c4664d9794c04d5f9e5597632\nhttps://omen.eth.link/#/0x32848849f5b7e30ff75f57838fea8f9663c3d9de\nhttps://omen.eth.link/#/0x13164a7daf2e5649025ec32ec0c402ddfa2a1cd9\nhttps://omen.eth.link/#/0x3a437902b8780f0b29c51d1f67f94955101dc09e\n\nAll markets can be verified here:\nhttps://docs.google.com/spreadsheets/d/1_Ozy2NfiEog9Mh4ZbM26uY4NGFWAWTsO9VbFkn3oF20/edit#gid=0\n\nor directly on omen.eth.link!\n","title":"DXdao market curation - batch #8","hash":"QmZC7ijQqRine6y33gdz4DpYXkoaSmiX7LpKsJaAsf6DEr"},"0x0b48fe8101d01217b3088fae1daef8ff95b96964dfdf7def56f517257d803d10":{"description":"This proposal will add the MKR - Maker token 0x9f8f72aa9304c8b593d555f12ef6589cc3a579a2 to the Mesa front end","title":"Add MKR (Maker) to list ID 1 (Mesa)","hash":"QmNrRRrzLaffUgo4SLmBo8bP2cAHwWtikT1EjmDtwsdx26"},"0x0ba98739cd2e23e1db6bfe50fdfd671f9d023175e838c58a9be093e408401399":{"description":"Hey everyone,\n\nthis proposal will add GNO to the omen list.\n\nThe hope is that Gnosis will provide a lot of liquidity for their own markets.\n","title":"Add GNO (Gnosis token) to Omen (3)","hash":"QmWsC7w8bwXtnSsMtT5wwzPvZHeFwxMibf3GXM9EUVsgfy"},"0x0c16adf1859b35b5ea95488e109889553a3320ae563195d9c0efef0323a6c473":{"description":"\nInfinite hackathon concluded in October 2022, with a commitment to award the following prizes:\n\n- 1 x First place prize ($6625.00)\n\n- 2 x Second place prizes (2 x $3312.50 = $6625.00)\n\n- 4 x Third place prizes (4 x $1656.25 = $6625.00)\n\n- 1 x Hacker's Choice Award ($3312.50)\n\n- 1 x People's Choice Award ($3312.50)\n\nTotaling $26500 in prizes. \n\nSince the concept of Infinite was hatched and subsequently promoted by DXdao as the lead organizer, one could say that Infinite Hackathons and its obligations, fall to DXdao to ensure they are fulfilled.\n\nThese prizes have to be paid as soon as possible as it has now been over a month since the end of the hackathon. It has been discussed with the co-organizers that DXdao will pay out the full sums for each of the prizes and will then be refunded by each of the co-organizations. \n\nHoprnet requires an invoice for the settlement of the funds for the hackathon and the prizes. CaneyFork.eth will assist DXdao and act as a proxy in providing the invoice and in turn collecting the payment from Hoprnet. The payment will then be transferred to DXdao. In the event that another organization needs an invoice CaneyFork.eth will also assist with this in a similar manner.\n\nAs a result of the above, this proposal requests the sum of $26500 in DAI, to be sent to the Infinite Guild (0x585E9f7A44161E0692fc6e4A7Cb4d72f33dF982F) from which the prizes will be distributed to the winners. \n","title":"Infinite Genesis Hackathon Prizes Proposal","hash":"QmXGg2VwMMP89KUvCv6CmFbMqqMuupCzFTXX4x7YL2uNJv"},"0x0c396e5558feeaf56bc2fb9ddf23fb48469bc92491200323f6d751bcb0e99f7d":{"description":"\nThis proposal sends 17.8 ETH to the [GP Relayer ](https://etherscan.io/address/0xce0BB1a5e9c723fe189D9Bf5457DEd9b21E40f9E)intended to be used to place an order to purchase DXD in line with the DXD Buyback Program proposal, which was passed on [Mainnet](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) and [xDai](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xc122e9ea5460917347538157501f7999d82bdd9b1b8d85bee373391c4b87aa45). This was previously discussed on [DAOtalk here](https://daotalk.org/t/dxd-buyback-program-signal-proposal/2890). \n\nThe DXD Buyback Program Signal proposal stipulates that the purchase amount should be based on the DXD Average Daily Trading Volume (ADTV).[ According to the most recent on-chain data and estimates](https://ipfs.io/ipfs/QmWE4u2i7wXyjQS1C9FiiqccJJKGXCY7beDmVYGNfWGdUV), DXD has averaged $161k over the last 3 months,so this proposal sends 17.8 ETH to the GP relayer on mainnet, identified as `0xce0BB1a5e9c723fe189D9Bf5457DEd9b21E40f9E`, using a [$2,257 ETH/USD price from Coingecko](https://www.coingecko.com/en/coins/ethereum). Further explanation of the [GP relayer can be found here](https://ipfs.io/ipfs/Qmd8TCEr6syKxAnmuBH3hsyvxfSgRJgANLTTorp3JGZY77). \n\nThis proposal falls under the DXD Buyback Program, because the value of the DXD circulating supply is less than the value in the ETH in DXdao’s treasury, [according to Coingecko](https://www.coingecko.com/en/coins/dxdao) and [Etherscan](https://etherscan.io/token/0xa1d65E8fB6e87b60FECCBc582F7f97804B725521).\n\nThis proposal sends funds to the GP Relayer. A separate proposal with the order parameters must also be submitted to place the order. That proposal must be executed _after_ this proposal or else it will fail.\n","title":"Send 17.8 ETH to GP Relayer for DXD buyback #3","hash":"QmNhs3rLqeEvU2hNWw6za8WiyWpdGAHqkW2UwzrKkrBhXM"},"0x0cc91396ced9a3eb504cfc01a15109d6fc22e06277e0cf8d6a793d5a1e5f1e75":{"description":"\n    \nThis proposal places a 5000 DAI order on CowSwap for DXD. See order here: https://explorer.cow.fi/orders/0x2392f5163b77ad82170bea23e98d247f4be6876e578092b3d349a074a3794c91519b70055af55a007110b4ff99b0ea33071c720a63da4b92\n\nThis order is placed as part of the [DXD buyback program](https://dxvote.eth.limo/#/mainnet/proposal/0x072519e7fa7d55619fcc675c5c47e446e499ee454da1f2b370825ac447d06758).\n\nThe order is placed at a discount on the price of DXD at the time of creating the order - this is due to the multicall requiring 16 days to pass. Nevertheless, CowSwap matches at the best available price. So the discount just allows some market movement - in case there is no fill for the price, the order will turn into a limit order.\n","title":"CowSwap Order 2392f516 DAI / DXD","hash":"QmYSbrrz7nJcCtifUPTQvqV2w6Yzuc5zGYBPTndKvccoLH"},"0x0cd0261e4bb06957b5842dd5185815e3be89cbe76b6d3649df0035ee5983ca3c":{"description":"The payment is 9 DXD which is 5400 USD, using the current coingecko ETH price of $585 and the current DXD minting price of 1.0203.(5400 / 585 / 1.0203 = 9.05) The vesting contract address is 0x536dbc587ab199b151bb9fa67dce8a87b1b233ac  and vests over 24 months with a 12 month cliff. This payout is for the vesting DXD payment related to altpl’s worker proposal: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xc7809cf8102fe4e8b6d2cf410a561fd948551f7ee9e95a1dfe28a378f5080e71","title":"DXD Payout Worker Proposal 10/19-11/19 - altpl","hash":"QmabsoAcGSehXpGspwRanAQ4GezcSbgetzLo1gzL2ze8R9"},"0x0d45a4dc4755088ddf227beceb1ac09b92aabe3d3919617cadc9ec2a5d3ad0ea":{"description":"This proposal is a request for ETH 100 to be sent to the DXdev SAFE Multi-sig with the intent to exchange it to USDC and immediately return it to DXdao treasury.  \n\nIn line with \"Treasury Diversification Authorization Proposal\":\nhttps://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x5dd6b9bdace1905afcf68c13425b04eb229d5e31ea463b54f591ebd2df05de41\n\nAnd forum thread: https://daotalk.org/t/treasury-diversification-authorization-proposal/2541\n\nOwnership Verification for Multisig Addresses:\nhttps://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x4e46a28e1215482e2280bca2dbae7765d77c3b4e82fd68b6e16d7d03b48bdc74\n\nThis will enable DXdao to continue to build its USD-based portion of the treasury.  \n\nThe DXdev MS (3 of 5) is controlled by a set of active DXdao contributors who have significant REP holdings (that can be slashed by DXdao).  This provides an additional safety mechanism if anything were to happen to the funds.\nMS wallet: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882\n\nProposal Request Summary:\nSend 100 ETH to DXdev MS: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882 \nTo be exchanged to USDC and returned to DXdao treasury. \n\n","title":"Exchange ETH to USDC for DXdao Treasury #5","hash":"QmRirWDxe5b9LcozpK3rg9rfxjgX6WLxcCBn8UFnL9zZ69"},"0x0d970c0edddd1f786afabf69a0b33474d8f5da46479e7cdb486cc207f11937f8":{"description":"Setting ENS resolver contracts for dxDAO domains. More information can be found here: https://daotalk.org/t/next-steps-for-the-ens-domain-dxdao-eth/1130","title":"dxoasis.eth set resolver contract ","hash":"QmaCCcHps65iv4HAGeYmJdstks7e8ANEz3cVKfdx4LttGw"},"0x0e7dc0c69c1c33d120db30356f6bf9def59432a6113f259198eb1cc181361657":{"description":"This proposal is the DXD vesting payment of the https://daotalk.org/t/worker-proposal-from-09-20-to-10-20-github-augustol/1961 proposal, using the latest values from the DXdao Worker Compensation Guidelines.\n\nTotal Payout of 12000 USD in DXD, on a vesting of 2 years that has a 1 year cliff.\n\nThe price taken for DXD is the last buy price from dxtrust 1.02 ETH and the price of USD/ETH is 390 USD.\n\n12000/390/1.02 = 30.16 DXD","title":"Worker Proposal from 09/20 to 10/20 github:AugustoL DXD Payout","hash":"Qmd4ZnB9MsQNE5qyeSxMqBWDUKhtR8fGUPikY4JpHYRUW7"},"0x0ecbd7a8feb769f9b5282ca4150b4e9df5e2d56e446a112e12a3468216dfd550":{"description":"I am submitting my Redemption Balancer under DXD approved Token Model, following Redemption Balancer guidelines.\n\nTransfer transaction of my 45.66 DXD to the DXdao multisig:\nhttps://etherscan.io/tx/0x9302446968c2eb7d27d3db6289a019d648a89d7f9482d2aa6c175e610ef4ecdb\n\nPlease find there my screenshot of the ‘Redemption Balancer Calc’, with assets to be requested, prices and circulating supply dated to the moment of the DXD transfer to the DAO:\nhttps://daotalk.org/t/molotov-s-redemption-balancer-2-under-dxd-token-model/4897","title":"Molotov’s Redemption Balancer #2 under DXD Token Model","hash":"QmPNRPwwrJkH7bNammbEHLDFvuQgEW22GwULqjUKUDT3yj"},"0x0f163a1dc86616ef05922ef9ae57cf52071b109d3502b2daeea8601ebef2f0a7":{"description":"# MultiCall Installation\n\nThis proposal installs the MultiCall on Mainnet, more details can be found here: https://daotalk.org/t/multicall-installation-proposing-governance-configuration-parameters/2479\n\n## MultiCallScheme Audit\n\nThe Post-Audit Report can be found here: https://gateway.ipfs.io/ipfs/Qman1xMBL6qHecYyBGBBk2dv3bH34Pmo8bkAjsFBDYnvUR\n\n## Scheme Configuration\n\nPlugin to Install (MultiCall): https://etherscan.io/address/0xef9dc3c39ca40a2a3000acc5ca0467ce1c250808\n\n### Governance Parameters\n\n* QueuedVoteRequiredPercentage: 50%\n* QueuedVotePeriodLimit: 1814400 (21 days)\n* BoostedVotePeriodLimit: 604800 (7 days)\n* PreBoostedVotePeriodLimit: 86400 (1 day)\n* ThresholdConst: 1200 (1.2)\n* QuietEndingPeriod: 172800 (2 days)\n* ProposingRepReward: 0 REP\n* VotersReputationLossRatio: 0 %\n* MinimumDaoBounty: 250 GEN\n* DaoBountyConst: 10\n\nHow to verify?\n\n1. Open MultiCall Contract:\nhttps://etherscan.io/address/0xef9dc3c39ca40a2a3000acc5ca0467ce1c250808#readContract\n2. Verify Avatar is set correctly. Expected Value: 0x519b70055af55a007110b4ff99b0ea33071c720a\n3. Copy the hashed Governance Parameters from 8. voteParams\n4. Open 9. voting Machine and switch to Contract address\n5. In 1. Parameters insert the params & Query\n6. You will find the Governance Parameters and can compare them with the configuration above\n\nNote: thresholdConst is a calculated value, where 1319413953331 = 1200.\n\n### Scheme Permissions\n\n[x] Mint and burn reputation, send ETH and external & native tokens. Note: Cannot turned off (Activated by default, cannot be deactivated)\n\n[x] Call genericCall on behalf of\n\n[ ] Register other plugins\n\n[ ] Add/remove global constraints\n\n[ ] Upgrade the controller\n\nHow to verify?\n\nSee proposal section “Permissions” and compare with values above.\n\n### MultiCall Whitelist\n\nContracts to Whitelist:\n\n* TokenRegistry: 0x93db90445b76329e9ed96ecd74e76d8fbf2590d8\n* ENSRegistrywithFallback: 0x00000000000c2e074ec69a0dfb2997ba6c7d2e1e\n* ENSETHRegistry: 0x57f1887a8bf19b14fc0df6fd9b2acc9af147ea85\n* ENSPublicResolver: 0x4976fb03c32e5b8cfe2b6ccb31c09ba78ebaba41\n* GnosisProtocolRelayer: 0x30AAD48F5eA5e8b2277612eB2A375fC173bB049e\n* SwaprLiquidityRelayer: 0x924a2917d43e037b724d585d434a5de9e7d701a6\n* Bonding Curve: 0xa1d65E8fB6e87b60FECCBc582F7f97804B725521\n* DXswapFeeReceiver: 0xc6130400c1e3cd7b352db75055db9dd554e00ef0\n* DXswapFeeSetter: 0x288879b3cafa044db6ba18ee638bbc1a233f8548\n\nHow to verify?\n\n1. Open MultiCall Contract: https://etherscan.io/address/0xef9dc3c39ca40a2a3000acc5ca0467ce1c250808#readContract\n2. Navigate to address from 7.SchemeContraints (the contract Whitelist is stored on a separate constraints contract)\n3. Compare values from 4.getContractWhiteList with list above\n\n### Verifying the Relayer Source Codes\n\nGnosis Protocol Relayer\n\n* Clone https://github.com/nicoelzer/gnosis-protocol-relayer\n* Run yarn\n* Run yarn build\n* Open the GnosisProtocolRelayer.json under artifacts\n* Compare the “bytecode” with the Contract Creation Code of the deployed contract at:\nhttps://etherscan.io/address/0x30aad48f5ea5e8b2277612eb2a375fc173bb049e#code\n* Go to https://adibas03.github.io/online-ethereum-abi-encoder-decoder/#/encode to generate the Constructor arguments\n* The argument types are: address,address,address,address[],address,address\n* The argument values are:\n0x519b70055af55A007110B4Ff99b0eA33071c720a,\n0x6F400810b62df8E13fded51bE75fF5393eaa841F,\n0x6F400810b62df8E13fded51bE75fF5393eaa841F,\n[0xd34971BaB6E5E356fd250715F5dE0492BB070452,0x5C69bEe701ef814a2B6a3EDD4B1652CB9cc5aA6f],\n0xC02aaA39b223FE8D0A0e5C4F27eAD9083C756Cc2,\n0x0846Ff449b107A727958264Ad8f29f16B0040327\n* The bytecode should match the Constructor Arguments on Etherscan\n\nSwapr Liquidity Relayer\n\n* Clone https://github.com/levelkdev/dxswap-periphery\n* Run yarn\n* Run yarn compile\n* Open the DXswapRelayer.json under build\n* First compare the “bytecode” with the Contract Creation Code of the deployed contract at: https://etherscan.io/address/0x924a2917d43e037b724d585d434a5de9e7d701a6#code\n* Go to https://adibas03.github.io/online-ethereum-abi-encoder-decoder/#/encode to generate the Constructor arguments\n* The argument types are: address,address,address,address,address,address,address\n* The argument values are:\n0x519b70055af55a007110b4ff99b0ea33071c720a,\n0xd34971bab6e5e356fd250715f5de0492bb070452,\n0xb9960d9bca016e9748be75dd52f02188b9d0829f,\n0x5c69bee701ef814a2b6a3edd4b1652cb9cc5aa6f,\n0x7a250d5630b4cf539739df2c5dacb4c659f2488d,\n0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2,\n0xff1ba3d761ab5fa96a409a32ce8a4d72263a86a2\n* The bytecode should match the Constructor Arguments on Etherscan","title":"Install MultiCall Scheme","hash":"QmSZDqowDTRsAGYAydivWrbUS1CMe2mDguk6Mqxj4YtPpT"},"0x0f5a74196495bb397e22ab58f84f03934dc258c8ce52d05619b2b5d09e2763a6":{"description":"DXdao has been discussing the experiment of deploying a parallel DAOstack Alchemy DAO (\"xDXdao\") on xDai Chain for the past couple months.  \n\nWith elevated gas fees on Mainnet, it is worth experimenting with the scaling solutions that are in existence today. \n\nxDai Chain has been gaining more and more momentum recently as the infrastructure gets built up.  Though it is not as secure as mainnet, it has some unique characteristics that make it a great chain to explore on in the Ethereum ecosystem.  \n\nYou can find forum discussions here:\nDXdao xDAI deployment discussion: https://daotalk.org/t/dxdao-xdai-deployment-discussion/1976\nDXdao signaling contract (Reputation mapping): https://daotalk.org/t/dxdao-signaling-contract-reputation-mapping/2087\nxDXdao Deployment – Last steps: https://daotalk.org/t/xdxdao-deployment-last-steps/2119\n\nAnd xDai resources here: \nhttps://www.xdaichain.com/\n\nThe goal of this proposal is for DXdao to fund the xDXdao with the following steps: \n1) Send $10k of ETH (28.5 ETH at current price of $350.877) to a mainnet DXdao Dev Gnosis Safe Multisig: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882\n2) Convert ETH to DAI on Sushi Swap (or other)\n3) Send DAI across xDai Token Bridge (https://dai-bridge.poa.network/) to xDXdao at wallet address: 0xe81a69caca4a99360589cfd18d9eeaa5029b5ef8\n(This is how you do it step-by-step: https://www.xdaichain.com/for-users/converting-xdai-via-bridge/alternate-receiver-send-dai-to-another-xdai-address)\n\nAnd Voila!  We will breathe some life into xDXdao!  \n(We might even use the competition scheme to choose a new name for xDXdao!)\n\n\n\n","title":"[Proposal] Initial Funding of xDXdao with ETH","hash":"QmNN6obMma5oPoEWm5QSrCBha367pJZUZjUd6juWntbaG2"},"0x0f98a7c9d10917351793fb176f530279713dc240ece994dc958130353a38a8df":{"description":"Due to the restructure and moving to payments via guilds in the new year I have 2 weeks of a new proposal before moving to the new process and budgetary process.\n\nIn order to save time and voter attention I am going to extend this proposal to the end of the year. The scope of the work remains valid and relevant.\n\nIn addition I am adding a rep sync on mainnet.\n\n**Past period reflection:**\n\n**Did well:**\n\n* **Budget** - I haven’t ever had to make a budget or OKRs before and all things considered, I think the budget creation went well. It certainly took a good bit of time but also provided an opportunity for introspection around what we are doing, how we use funds, what we aim to achieve and the resources required.\n* **DAVI Releases** - We continued releasing almost fortnightly with detailed release notes, full QA testing and no new bugs. A practice I hope we can maintain into the new year and increased use of production. The changes inside these releases has also set us up well for the use of guilds for squads in the new year.\n* **Architecture** - This was a period of fairly extreme amounts of architecture discussion in DAVI as we tackled subgraph, monorepo and data architecture in the app. With big thanks to Madusha and the rest of the team I feel I was able to continue to help evolve our architecture and improve the system.\n\n**Did ok:**\n\n* **Increased coordination** - I feel I did a far better job connecting with teams outside of development for DAVI during this period. I talked a lot with DXbiz and Voice about DAVI which helped inform me of our goals in relation to more than just development. Looking forward to working closely with them over the next year!\n* **More development** - I think I ended up writing more actual PRs this period than normal. This is something that has been gradually decreasing as other responsibilities take precedence but its always nice to jump into code and build something.\n* **Improving developer experience** - Its been a rough few months for everyone in DXdao and its clearly affected everyone. We made some attempts such as setting aside Wednesday afternoons for ideation but there is still much we can try in the new year.\n\n**Could have done better:**\n\n* Not much time to finish off side projects I start related to DAVI\n\n**Salary -**\n\nI will be receiving my funds via devx the new service provider we have partnered with and as such proposals will transfer stablecoins to an address other than my own.\n\n**2nd month:**\n\n$8000 DAI\n\n$6000 DXD\n\n0.1667% REP (3640 REP)\n\n**2 week period:**\n\n$4000 DAI\n\n$3000 DXD\n\n0.08335% REP\n\n(2224143*0.08335 = 1854 REP)\n\nPayment are made to Devx.eth\n","title":"Ross Neilson Worker Proposal 18/11/2022-31/12/2022 Stablecoin payment","hash":"QmTPGtPDUUFAaSixKXUnwDeuFqhrqARY9UZ7QLXJWQYNAL"},"0x0fe236fc74e9cb227097bb246ee46ea6fd6711961af448c3262dd2e2068c2b44":{"description":"Requesting compensation for my contributions to business development, ecosystem development, marketing, and product governance, during the months of September & October.\n\nSocial Media Milestones:\nTwitter Management\nRails breaks 800 followers\nDXdao breaks 3000 followers\nMesa breaks 1000 followers\nOmen breaks 2000 followers\n\nTelegram Management\nDXdao breaks 2000 followers\nOmen breaks 300 followers\nMesa breaks 300 followers\n\nContent & Marketing\n\n[Omen Updates Blog ](https://medium.com/@ingamar/omen-development-updates-september-2020-f0fdbe5c18c4)\n\n[Omen Authereum Announcement Article](https://omen-eth.medium.com/omen-users-dxdao-wants-to-sponsor-your-gas-fees-37e949d68fce)\n\n[Collaborated with Chen on producing Mesa listing guidelines ](https://dxdao.medium.com/how-to-get-your-token-listed-on-mesa-d3d9d52cdc6e)\n\n[Reimagine 2020 appearance](https://www.youtube.com/watch?v=Q90vKgIOXwo) (not counting livestream views)\n\n[Rails Launch Article](https://medium.com/rails-ethereums-layer-2/instant-gasless-transfers-now-available-through-dxdaos-launch-of-rails-eth-44baca7a3134)\n\n[Edited Rails Pre-Launch Article](https://medium.com/rails-ethereums-layer-2/rails-a-new-l2-product-from-loopring-and-dxdao-enables-gas-free-ethereum-transfers-3975789a706d)\n\nBD\n\nCreating agendas for, and facilitating the Monday weekly BizDev calls.\n\n[Web3API partnership](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x56381e944df8bbd2ae820c01b1b5e1598f0878289f8243ca3be0b5c6ae7ea1ca) - Proposed an MOU to sign that would result in the exploration of using and giving feedback on the web3 tooling.\n\n[Aluna Social partnership](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x757e8418da455333252969c8e2a58a9fefa443f787dde1124b955b82d7ee6604) - Facilitated and led the proposal of marketing collaboration between Aluna’s social trading platform & ALN token with Mesa and DXdao, with an agreement of exploration of further product integration.\n\nCoordinated with Rails Launch, with coordinated retweets by Alex Saunders and Anthony Sassano\n\n[Proposed](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x2cceae56cb5a92c6bcf1c1da604aef9777d603d1a91e29eb4f48e748dfb86f1d) to set Swapr default fee at .25% - Best positioning the product to have agreeable default fees for every new trading pair.\n\n[Presented DXswap for DAO Rush Week](https://docs.google.com/presentation/d/1aMovt4SdUhbnBfeMKE9lNXp8IlAgqd2x8o2K1u_ef3A/edit#slide=id.p) \n\n[Facilitated Etherisc Appearance & DIP Listing ](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xe62c5c586a39db64a8d0c687f3abb7dd2940f0c13d92d840cb62282e6a41825f)- Introduced the CEO of Etherisc on a BD call and facilitated consensus on the listing of DIP on Mesa\n\n[PlotX](https://plotx.io/) Introduction and ongoing conversation regarding governance as a service and integration with their prediction markets platform.\n\nHelped coordinate introduction and proposal of listing [Fuse](https://daotalk.org/t/fuse-io-on-mesa/2028) token on Mesa by having Mark on our BD call\n\n[Listing of DXdao on DeFi Rate](https://defirate.com/dxdao/)\n\nEcosystem development- Brought Jikun Liao as a DXdao developer\n\n1.75 months at Level 4 pay, due to less availability in October.\n$12,250 in ETH\n$8,750 in DXD with 24 months of vesting, based on the DXtrust price of DXD\n.32% REP","title":"Workers Compensation Proposal - Ingalandia Sept-Oct 2020 (ETH)","hash":"QmfRAXL3ds6jyyZ18aRDGjStjFU2if1z4GwuuVHiUGzjsd"},"0x1074d97023bc54a2815cdc1621a8e99991434af488591f7a9a33f0b60bd03247":{"description":"*\n_Tldr: The below is a signal proposal that approves a DXD vesting issuance plan for already passed worker proposals. See the [PDF](https://gateway.pinata.cloud/ipfs/Qmf6imfDsxjtfjqJN92pYJm9KGd1DzN8tKHk2HJLA2Kr2r) and [CSV ](https://gateway.pinata.cloud/ipfs/QmVkZRUWeqesBE6WoWEUof9DHo6thigHUNJ6gFrQP5eLGE) of the vested DXD distribution.. This was discussed on [DAOtalk here](https://daotalk.org/t/approve-dxd-vesting-distribution-to-multiple-addresses-signal-proposal/3659). *\n\n\n\n**Background**\n\nDXdao’s [Worker Compensation Guidelines](https://dxvote.eth.link/#/mainnet/proposal/0xc9ebd5e6c96b87ee1ab09cbe7f301eb2c885068073ca4db4a5a01ab5c40ecf5b) stipulate that contributors are to be paid in both stablecoins that are immediately receivable every month and DXD that is to be “vested continuously for two years with a one year cliff”. Some contributors have DXD vesting in smart contracts on Ethereum mainnet. Because setting up a vesting contract incurs high gas costs and requires some technical skill and that this DXD was not immediately redeemable, many contributors have not formally received their DXD. Instead, it is a ‘DXD debt’ for DXdao.\n\nThe Contributor UX squad [started tracking unissued DXD for contributors](https://daotalk.org/t/dxdao-dxd-tracking/2900) in May by matching up a passed on-chain proposal (on mainnet and xDai) with their DXD compensation. The latest sheet shows DXD accrued through proposals that have passed as of the December 3 2021. For ease of accounting and deployment purposes, the vesting date for DXD will be at the beginning of the month it was earned.\n\nThere has been [discussion on where to vest the DXD](https://daotalk.org/t/dxd-worker-payout-draft-proposal/3449) and how to manage the process. Soft consensus was reached on the [Nov. 3 Governance discussion](https://daotalk.org/t/governance-discussion-nov-3-2021/3463) to have the DXgov squad facilitate the DXD vesting contract creation on xDai. \n\n**Details**\n\nThis proposal authorizes the DXgov team to facilitate vesting contract creation and DXD deposits into the vesting contracts that abide by the amounts and vesting dates to the specified addresses as laid out in this spreadsheet ([PDF](https://gateway.pinata.cloud/ipfs/Qmf6imfDsxjtfjqJN92pYJm9KGd1DzN8tKHk2HJLA2Kr2r) and [CSV](https://gateway.pinata.cloud/ipfs/QmVkZRUWeqesBE6WoWEUof9DHo6thigHUNJ6gFrQP5eLGE))\n\nContributors with earned DXD must initiate the vesting process and confirm the address on xDai before any DXD is transferred to a vesting contract.  \n\n**Risks and Considerations**\n\nThe vesting contracts will be deployed onto xDai, which means contributors’ DXD payments will depend it for security as well as the bridge that connects to Ethereum. Stubbornly high gas prices on Ethereum mainnet as well [as positive signs on a potential merger or acquisition by Gnosis](https://forum.gnosis.io/t/gip-16-gnosis-chain-xdai-gnosis-merge/1904) suggest that the future of xDai is bright.\n\nThis proposal relies on facilitation from DXdao contributors as well as initiation by contributors with earned DXD.","title":"Approve DXD vesting distribution to multiple contributor addresses","hash":"QmVAnjfJWaNxQX1LXLFypNvzH7qvaiR1mhyfyuV8NBdc1h"},"0x110d5b0da61f44b4fd10b6b0bb767c65393a06b1343da5b7da703774dcaa5b61":{"description":"**Timeframe**\n\nFrom 14/09/2020 - 15/11/2020, 2 months\n\n**Responsibilities**\n\n## Responsibilities\n\n* Product management for Omen which includes:\n  * Weekly dev/all-hands/biz calls\n  * Task management and quality assurance via github (example: [Omen.eth](https://github.com/protofire/gnosis-conditional-exchange))\n* UI/UX design for Omen:\n  * Playgrounds which allows developers and the community to see and feel the UI.\n  * Design specification\n* Supporting Zett on development of creative direction for DXdao brand\n* Landing page updates / redesign\n* Exploration / design for a DXdao “dashboard”, Governance interface, DXD guild.\n\n## Goals\n\n* [Finish Omen Version 2 ](https://daotalk.org/t/omen-version-2/1571)\n* [Start with Omen Version 3 ](https://github.com/protofire/omen-exchange/issues?q=is%3Aissue+is%3Aopen+label%3A%22Omen+Version+3%22)\n* [Finalize Gelato Integration ](https://daotalk.org/t/proposal-automatically-withdrawing-liquidity-from-prediction-markets-on-omen-with/1689)\n* [Finalize Kleros verification process ](https://github.com/protofire/omen-exchange/issues/1118)\n\n## Compensation\n\nCorkus has already received the max amount of REP in past proposals. According to the [guidelines ](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x11934f3831906c55e3dc738bc5943022bfbefbe92ee2a9b64492a20f2c6bc7c4) for a DXdao worker with expert level experience and a commitment level of 6, total compensation value of ETH + DXD would be $12,000 per month. Because there was some feedback that this is high, Corkus is asking for a lesser rate of $11,000 per month, $7500 in ETH and the rest in vesting DXD.\n\n* 15000 USD to be paid in ETH. 50% to be paid once the proposal gets approved and 50% on 15/10/2020 when the work agreement finishes.\n* 7000 USD to be paid in DXD vesting over 24 months with a 6 month cliff, based on the buy price on https://dxdao.eth.link/#/exchange at time of vesting/lockup contract creation. The vesting/lockup contract is already active because of previous proposals which will be funded at final payment and use 01/07/2020 as the starting date of the vesting.\n\n20.70907886017 ETH are sent in this proposal representing 7500 USD at the current coingecko price of 362 USD/ETH\n\nPrevious work:\n\n* [Design UI/UX and Branding of mix.eth](https://daotalk.org/t/mix-eth-seeking-feedback-on-proposal/1183)\n* [Design UI/UX/Branding and product management for omen.eth Version 1](https://daotalk.org/t/omen-mvp-overview/1229)\n* [Design UI/UX for omen.eth Version 2 ](https://daotalk.org/t/omen-version-2/1571)\n [Design UI/UX for omen.eth Version 3 ](https://github.com/protofire/omen-exchange/issues?q=is%3Aissue+is%3Aopen+label%3A%22Omen+Version+3%22)\n* [Design UI/UX and product management for dxdao.eth](https://daotalk.org/t/landing-page-designs-for-dxdao-eth/1270)\n* Designed the first truly on-chain decentralised exchange called [Oasis](http://oasis.app/) (previously maker-market)\n* Designed [oasis.direct](http://oasis.direct/) which was one of the first swap interfaces.","title":"Corkus Worker Proposal 14/09/2020-15/11/2020","hash":"QmXaMLtZjWQjzQoaYA1eZzWKU66YEmhdqLEauWC62XZGJw"},"0x115354120b63ccc1b1087052d57bb76b17aff0af6ae8973269a9609719abe4b2":{"description":"Zett Worker Proposal 22/11/2020 - 22/01/2021\n\n## **Responsibilities**\n\n - Product management for Swapr\n   -   Managing Project on Github\n   -   Managing developer asignment \n   -   Testing and Reviewing\n   -   Team Onboarding for new devs\n   -   Weekly Swapr Meetings\n\n-   UX/UI design for Swapr\n    -   Create UI/UX for Governance\n    -   Create UI/UX for Liquidity Mining\n\n-   UI/UX for ERC20 Guild\n\n-   Prototyping and mockup Mesa v2\n    -   Support Corkus on mockups\n    -   Support Martin on roadmap and vision\n\n-   Support Marketing\n    -   Partnership graphics\n    -   Announcement graphics\n    -   Support Mike\n\n-   Support Communications\n    -   Help setup DXdao Discord\n    -   Support Keenan\n\n## Main Goals\n\n-   Swapr Beta out on mainnet\n    -   Governance live\n    -   Liquidity mining live  \n\n-   Mesa V2 MVP\n\n### Proof of work\nhttps://github.com/zamli\n\nhttps://swapr.dev/\n\n### Previous work and Experience\nhttps://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xff7a8b3b939be7badadf89f1bca8e744de774630c6fad9271c5c8b7742c8f62d\n\n\n## Compensation\n\nThe compensation is submitted according to the worker compensation guidelines\n\n -   Experience Level: 4 (expert)  \n -   Full-time\n - Monthly Salary\n   -   $7,000 (10.85 ETH) distributed end of each month. Price of ETH chosen from a weekly average from 21-28 december. A price of 645 USD.\n   -   $5,000 (DXD) over 24 months with a 12-month cliff. \n   -   0.16667%% REP (voting power in DXdao)","title":"Zett Worker Proposal | FT Product Manager & UI/UX | Dec 2020 - Jan 2021","hash":"QmZY8oKCC3pNWtTobvm2X6ASoswkUXRzhCjMZpWAQxEomb"},"0x11613f6677e6f11a107d15cc2fd8a7cc22873569a0a9301af847e5f63c331f0a":{"description":" I (DAOtalk name : gogyaru) am requesting 0.1% REP as part of the December 2020 Community REP Boosts\nhttps://daotalk.org/t/community-rep-boosts-december-2020/2435/4 ","title":"REP Boost : gogyaru","hash":"QmPNqofoy1EpKy7y63tDmc2TwtMBmiL89uNbrpDXsJ3w6o"},"0x1161a9af303415a4dc82505ede823d66fee6472181905954e07f46a6be8cf94e":{"description":"This proposal sends 5.1 ETH to fund the Governance gas refund round #6 smart contract. These refunds include gas costs incurred during Q3 2021, specifically from block 12738509 to 13330089. Any ETH not claimed within 3 months will be reclaimed by DXdao.\n\nGas costs are refunded as follows:\n\n90% Proposal creation\n90% Staking\n90% Voting\n90% Redeeming\n100% Executing\n100% Boosting   \n\nForum post: https://daotalk.org/t/dxdao-gas-governance-refunds-round-6/3371\n\nDeployed contract: https://etherscan.io/address/0xfaed5aaa89d6f76a2e64cc7985f7b33d902574de","title":"Fund Gas Governance Refund #6 Smart Contract","hash":"QmQpMHqAG9a4UrAmJdA9sy5wNMZdRWaUoN772BnTsHU11w"},"0x11934f3831906c55e3dc738bc5943022bfbefbe92ee2a9b64492a20f2c6bc7c4":{"description":"This proposal signals the validation and acceptance by the DXdao REP holders the *DXdao Workers Compensation Guidelines 2020*.\n\nThe document is uploaded on IPFS:\n### https://gateway.ipfs.io/ipfs/QmeVa7NhbFieeZbt8KEm2xZkuUxjp1dK3AcNiFCHwbkp1z\n\nThe document is meant to be used to help DXdao workers to estimate their financial and reputation compensation from the DXdao during the year 2020.\n\nIn the case of the change of the document, a new signal proposal sharing the document proposed would be created and voted upon.","title":"DXdao Workers Compensation Guildelines 2020","hash":"QmVaVo74WsLvbKrT6gMfzgFkSEN8u3TpnznV3DywzvUjVr"},"0x1195dc9baf7ed45e7c0af7d9e5a7b8189d8239c7e588e464a128e7a9db7e65c8":{"description":"If this proposal passes, the omen.eth ens domain will be set to the latest release: https://github.com/protofire/omen-exchange/releases/tag/v1.1.7\n\nTo verify: \n\nClone the repo\nCheckout the v1.1.7 commit\nnvm use v12.13.0\ncd app\nyarn install\nFill out the env file as follows:\n\n```\nREACT_APP_VERSION=omen\nREACT_APP_INFURA_PROJECT_ID=\"9c6788bb15234036991db4637638429f\"\nREACT_APP_MARKET_FEE=2.00\nREACT_APP_GRAPH_MAINNET_HTTP='https://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_MAINNET_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_RINKEBY_HTTP='https://api.thegraph.com/subgraphs/name/protofire/omen-rinkeby'\nREACT_APP_GRAPH_RINKEBY_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen-rinkeby'\nREACT_APP_KEY_INFURA_API_KEY=6ad6d4a4ec79442eacfa967652729d1c\nREACT_APP_ETH_NETWORKS=mainnet\nREACT_APP_GIT_SHA=4c1b9908c4fe48be3c60eed52f3892c503671d4d\nNODE_ENV=production\nyarn build\nipfs add -r -n build\n```\n\nThe site can be seen on ipfs gateway here: https://gateway.ipfs.io/ipfs/QmfCeBSbtwiaB35Nhcbr1qr5iNsJEzTEWRBvK9vA8WAbjV/","title":"Set omen.eth content hash to IPFS hash of v1.1.7","hash":"QmPerhFnz95gmgs63KrbRX47LNMHm2Y4PhGTL19uzN5vik"},"0x11bfab6550819de6300aa60204eb4b4112323853c0073c9a22c8aba7fd3b8f27":{"description":"If this proposal gets approved, the dxdao.eth ens domain will resolve to the new landing page/fundraising application.\n\nYou can verify the codebase and the IPFS hash by going through the instructions here:\nhttps://github.com/levelkdev/BC-DAPP/blob/master/docs/VerificationInstructions.md\n\nReplace the env file content with:\n`REACT_APP_ETH_NETWORKS=mainnet\nREACT_APP_GIT_SHA=4088669915b1b7c04d36d80b23f7d9016939310d\nNODE_ENV=production\n# Override network rpc urls here\nREACT_APP_SUPPORTED_NETWORK_1=\"https://mainnet.eth.cloud.ava.do\"`\n\nReplace the src/contracts.json content with:\n`{\n  \"contracts\": {\n    \"mainnet\": {\n      \"multicall\": \"0x742121cD0BB9784c1f17f25B8da1bF3445b93ED4\",\n      \"DAT\": \"0xa1d65E8fB6e87b60FECCBc582F7f97804B725521\",\n      \"implementationAddress\": \"0x845856776D110a200Cf41f35C9428C938e72E604\",\n      \"collateral\": \"0x0000000000000000000000000000000000000000\",\n      \"DATinfo\": {\n        \"collateralType\": \"ETH\",\n        \"name\": \"DXdao\",\n        \"symbol\": \"DXD\",\n        \"currency\": \"0x0000000000000000000000000000000000000000\",\n        \"initReserve\": \"100000000000000000000000\",\n        \"initGoal\": \"4898979485566395000000\",\n        \"buySlopeNum\": \"1\",\n        \"buySlopeDen\": \"48000000000000000000000\",\n        \"investmentReserveBasisPoints\": \"1000\",\n        \"revenueCommitmentBasisPoints\": \"1000\",\n        \"minInvestment\": \"1000000000000000\"\n      }\n    }\n  }\n}`\n\nYou can access the landing page and the continuous fundraising dapp with an IPFS gateway: https://gateway.ipfs.io/ipfs/QmPGoRqffPozaQcgu4q2CKaBcTxV8KpocPVPN6qddA6ACP/#/","title":"Set dxdao.eth content resolver to new landing page/fundraising application","hash":"QmfNfpea7ANnE5cNm8mJNdKB5geuR9yBQpd6vDXaaMFzh1"},"0x1212be578b8ee549c6ebec91b6f6d814fc2cf5812372b0bdef7ed86926b25a99":{"description":"Hallo,\n\nthis proposal approves the reimbursement of transfering ownership of mix.eth to the DXdao.\nMix.eth is already owned by the DXdao since today: https://app.ens.domains/name/mix.eth\n\nI am requesting 4 ETH in total for:\n3.369417611824283  ETH - Registering the ens domain \n0.63058238818 ETH - For my work\n\n\n","title":"Reimbursement for transfering mix.eth","hash":"QmXnm32PQqgnATHi4pjDo8vFjmC2YqtHUEqPPzhhunb3PX"},"0x127c62c2f12052e9e5e0645c3109cbe1a06acdc1aa9c44300751749a6fc0436b":{"description":"Remove the following tokens from the Mesa list, which is also used by Swapr:\n\nOld Aluna Token: 0x1b7B723e66A0Dd33E8f5e8ec039B51acafCD66a5\n\nOld ANT Token: 0x960b236A07cf122663c4303350609A66A7B288C0","title":"Remove Tokens from Mesa List","hash":"QmS4ZEiBoxf5Ta5DszwvA6MxKTRQdgNtu5YxERmGDF7Tdh"},"0x127f1af8b1e7d87f7e10c6b80178810da54ada2d5ceced60c72f49df0892f5b0":{"description":"\nThis proposal provisions liquidity on DXD/WETH pair using the Swapr Liquidity Relayer. This is authorized from the proposal that approved a new DXD Token Model. A separate funding proposal was submitted to send the DXD & WETH to the relayer. This order deposits either 91 DXD or 40 ETH at the market price at the time the order is executed.\n\nThis was discussed on[ DAOtalk here](https://daotalk.org/t/provision-liquidity-on-dxd-weth-on-swapr-mainnet-proposal/4790), and is the first of at least two proposals to provision liquidity on DXD/WETH\n\n\n## **Background**\n\nIn the proposal to[ Approve New DXD Token Model](https://alchemy.3ac.vc/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xb7ff31ec2bcdb8a254b8a1b06c6d2080a4089135b03ed55e684fd41b5176d946) that passed last month, one of the implementation provisions was to use DXdao treasury assets to increase DXD liquidity. It committed up to $1m of DXD/ETH. The proposal authorizes liquidity to be provisioned once the DXD Treasury NAV ratio surpasses 60%. The[ latest calculation is 68%](https://docs.google.com/spreadsheets/d/1mS1sVmyP0Z3YiA1JiZpHgPHjSIh3da7MawpjQodE34Y/edit#gid=0).\n\nDXD liquidity has remained low. With DXdao serving as an LP, there is also a possibility that DXdao earns fees from LPing. LPing on DXD/ETH has been profitable, likely given the higher fees on mainnet (0.5%) and Gnosis Chain (0.6%), despite pretty significant movements in the DXD/ETH price over the last few months. Given the commitment to 70% floor price from DXdao, impermanent loss should be less of a concern.\n\n\n## **Risks and considerations**\n\nImpermanent loss is a risk for all 50/50 constant-product automated market makers. That should be limited here because of the higher fee as well as the price range that DXD/ETH should trade in. Using the Swapr Liquidity Relayer comes with its own set of risks as it relates to oracle manipulation. Breaking the deposit amounts down into smaller increments makes it more expensive to manipulate.\n\nLastly, there is a risk that there will be some DXD issuance should the price of DXD/ETH go above what the pool was deposited at. This issuance would be offset by more ETH and thus shouldn’t have a large effect, but DXdao should be mindful whenever it considers a DXD issuance.\n\nNote on Treasury NAV: This liquidity provision was approved as part of the new DXD Token Model, but there was not specifics on how it affects Treasury NAV. Many projects do not include protocol-owned liquidity as part of treasury calculation, but for clarification, the ETH in the DXD/ETH LP position counts toward Treasury NAV, but the DXD in it does not count towards circulating supply\n","title":"Provision DXD/WETH liquidity on Swapr (2/3)","hash":"QmQmzRcrySSnVbZNAdQMJcogw7A52G1GBqaTbpBQiGLy25"},"0x1308bd91f7515591637563c176943292e8adf682c4000e286c81821b7dbf8130":{"description":"This proposal is for the authorization and initial funding of the Communications and Marketing Multi-sig wallet on mainnet Ethereum. You can find the forum discussion and changes [here](https://daotalk.org/t/the-communications-and-marketing-multi-sig/2972).\n\nA yes vote for this proposal authorizes the Communications and Marketing squad to utilize any requested funds as outlined in this proposal and as laid out in the DAOtalk thread.\n\nA no vote for this proposal indicates a gross misestimation of terms or initial funds for the multi-sig, requiring a subsequent reevaluation. \n\nThe details are as follows:\n\n\n\n## What is it?\n\nThe Communications and Marketing squad multi-sig wallet is a multi-signature wallet on mainnet Ethereum that will hold a portion of funds designated for squad use. Essentially, the funding proposal for this wallet allows the squad to utilize the requested funds as it sees fit in order to operate. The initial funding proposal will account for a variety of initiatives and allocate a percentage of budget accordingly. Multi-sig signers are to remain respectful to these earmarked funds but may agree on alterations provided reasonable factors exist, such as time sensitivity. Allocations would be \"reset\" upon each subsequent funding proposal.\n\n**Branding and design expenses** - Up to $25,000\nThese include any initiatives directly related to the brand and identity of DXdao or any of its products. It also includes design related expenses until DXdao onboards a design focused contributor, which would remove these costs.\n* Landing pages\n* Product videos\n* Brand exploration and refinements\n* Collateral for pull strategy\n  * Social media visuals\n  * Announcement visuals\n  * Any other design requirements related to ongoing marketing strategy\n\n\n**Events and public face** - Up to $10,000\nThese include any costs associated with DXdao or its products having a presence at events or live initiatives that give direct exposure. This does NOT include covering the costs of individual contributor attendance, this initiative is separate and can be found [here](https://daotalk.org/t/draft-dxevents/3028).\n* Hackathons\n* ETH events\n* Podcasts\n* Articles and publications\n\n**Marketing and community expenses** - Up to $25,000\nThese expenses relate to public outreach surrounding launches, releases, or other time sensitive initiatives we want to reach as many people as feasible. This can also include regular marketing expenses without time constraints, and initiatives with a community focus.\n\n* Advertisements \n* Community events/incentives\n* Influencer advertisement\n* Push strategy\n  * Global marketing outreach\n  * Targeted marketing outreach\n* Pull strategy expenses\n  * Websites\n  * Blog\n  * Social media \n* X-community promotions\n* PR agency (P)\n* Advertising agency (P)\n\n\n**Squad operation expenses** - Up to $1,000\nThis would be utilized in the event that the squad has increased in size as such that a suite of tools is necessary to coordinate. It is not expected to be utilized right off the bat, especially not for smaller expenses considering mainnet gas costs.\n* Airtable\n* Calendars\n* Community tools\n\n**Market research** - Up to $15,000\nThese expenses surround any research concerning the users of our products, our investors, research and surveys. A similar roll-out of utilization is expected to the above.\n* Customer research\n* Surveys\n* Market research teams\n* Data analysis\n\n**Contingency**  - Up to $5,000\nThis allocation accounts for variables not reasonably identifiable without the benefit of hindsight. This can be used to supplement any category provided reasonable circumstances require additional funds. \n\n### Total initial allocation - $75,000\n\n**Context for the initial funding**\nSince marketing expenditure is incredibly low currently, it is not expected that these numbers are utilized immediately. It is expected that the squad rolls into this initial allocation within the first few months of use, and prepares a consistent budget to be requested for the following funding proposal. Regardless of this, there are some potential short term needs (1-4 weeks) of the Communications and Marketing squad multi-sig. These include:\n\n* Omen landing page - ~$20,000 (Pre-negotiation, some of payment could be in OMN token)\n* Omen marketing video - $12,020 ([Bypassing the multi-sig due to time constraint](https://daotalk.org/t/proposal-to-fund-omen-marketing-video/3015), will instead be requested from the DAO directly).\n* Swapr landing page - $8,500\n* DXdao branding work and landing page - $10,000 ($5,000 already paid by the DAO).\n*  Week in Ethereum advertisement - $345\n*  Bigcoin Vietnam - Up to $10,000.\n*  XZcrypto China - Up to $8,000\n*  Influencer campaign - Up to $5,000\n\n## Who?\n\nThis multi-sig will be made available to Communications and Marketing squad members or supports with a full-time engagement who hold at least 0.5% REP. No transaction will come as a surprise; discussions, decisions, and the signing process will be held in the usual squad channels. This process will require 3/5 signers.\n\nCurrently eligible include (but isn’t limited to):\n\n* Keenan Luke\n* Tammy\n* Skymine Labs\n* Caney Fork\n* Zett\n\nThere are other contributors who fit the profile that have not yet been invited in an effort to avoid detracting from busy schedules. This group will be satisfactory for the time being and can be expanded upon or altered as the squad grows into the future.\n\n## How much?\n\nAfter this forum post has been discussed, a proposal will be made requesting $75,000 to the Communications and Marketing multi-sig. This was deemed to be an appropriate amount to kickstart the initiative and should cover an initial batch of costs. Looking to the future, Keenan Luke will coordinate with the squad to develop a Communications and Marketing budget based on DXdao expenditure. This should be requested as a quarterly top-up. (EG. With a hypothetical yearly budget of $1m USD, a quarterly request to bring the multi-sig balance to $250k USD will be made). This of course will be another separate proposal, while this one focuses solely on the establishment of the multi-sig.","title":"Initial funding proposal for the Communications and Marketing Multi-sig","hash":"QmQBKUh1yFAQZH9gdSadjpHRvgbfXCEhD5K9hdxfH7kFgJ"},"0x134c17975ee0e486cdf4719c647c93f94b3bc991b9155193215807521cfce20d":{"description":"This proposal would extend the DXD Buyback Program for another $1m to $3m total. This was discussed on [DAOtalk here](https://daotalk.org/t/extend-dxd-buyback-program-for-another-1m-draft-proposal/3319).\n\n## Background\n\nThe [DXD Buyback Program](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) was passed by REP holders in May of this year. Since then, 5,230 DXD have been purchased on mainnet and xDai for an [average price of 0.144 ETH/DXD](https://docs.google.com/spreadsheets/d/17C1fcq5JshfG8Zsi_Sv7lmqrrsdT9DKB69XMBkrUp2s/edit?usp=sharing). Using the USD price at the time of purchase, $1.9m of DXD has been purchased. This is just over 10% of the DXD circulating supply. \n\nThe [buyback program was updated](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xd6c4bfd03d87c365432c073ff0f36578c3cba9da080b75de5058357319908039) in June to increase the slippage tolerance of trades as well as clarify the accounting measures. The[ buyback program was then extended](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x6f4bb1bb12469639b4af6f67ee04b174b07df211b3de45e6254de65082446af0) for another $1m. The total amount of DXD purchased is quickly approaching the limit placed on it by the previous proposal and soft community consensus has demonstrated support for another $1m extension.\n\nAccounting for the 5,230 DXD repurchased, the outstanding DXD represents a market cap of $24.1m - still comfortably below the [$46m in ETH in the DXdao treasury](https://etherscan.io/tokenholdings?a=0x519b70055af55a007110b4ff99b0ea33071c720a) and [the $8m in the buyback reserve](https://etherscan.io/address/0xa1d65E8fB6e87b60FECCBc582F7f97804B725521). The buyback program is intended to address this discrepancy and acquire an undervalued asset.\n\nThe [proposed DXD token model ](https://daotalk.org/t/proposed-dxd-token-model/2898)that has been embraced by the community intends to upgrade the DXD bonding curve and shift to a different buyback method for DXD. While the community moves toward a new model, the methods outlined in the DXD Buyback Program and purchases through the [GP Relayer](https://ipfs.io/ipfs/Qmd8TCEr6syKxAnmuBH3hsyvxfSgRJgANLTTorp3JGZY77) on xDai and Mainnet enable DXdao to drive value to DXD holders now. \n\n## Details\n\nThis proposal extends the DXD Buyback Program for another $1m to $3m total under the same conditions outlined in the original [Buyback Program signal proposal](https://alchemy.daostack.io/dao/0x519b70055af5), [the parameter update](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xd6c4bfd03d87c365432c073ff0f36578c3cba9da080b75de5058357319908039) and the [first extension](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x6f4bb1bb12469639b4af6f67ee04b174b07df211b3de45e6254de65082446af0). This proposal further stipulates that DXD or xDXD in the GP Relayer does not contribute to the count of DXD circulating supply.\n\nThese and other DXD purchases through the Buyback Program have contributed to the community’s intention to use the buyback reserve to purchase DXD. ETH from [DXdao’s general treasury](https://etherscan.io/tokenholdings?a=0x519b70055af55a007110b4ff99b0ea33071c720a) can be used in lieu of the buyback reserve until the DXD token contract is upgraded and that ETH is recovered. In total, the [buyback reserve](https://etherscan.io/address/0xa1d65E8fB6e87b60FECCBc582F7f97804B725521) has 2,499 ETH and so far, 756 ETH has been used to purchase the 5,230 DXD purchased through the buyback program.\n\n## Risks and considerations\n\nThe program will take place on xDai, a sidechain with less security properties than Ethereum. The Buyback Program has been running for four months with few problems; the GP Relayer has worked to complete the purchases at the market price. There is a concern that Gnosis Protocol v1 on xDai will have limited support, but DXdao community members are striving to maintain the network of solvers.\n\nDXdao has already spent almost $2m repurchasing DXD. This has increased the price of DXD relative to ETH but it still falls below the book value of ETH in the treasury.","title":"Extend DXD Buyback Program for another $1m","hash":"QmUYSsSeJmuc38vaSKUr4SbQiLvuw8K54K8ARDErW2y3df"},"0x13848d002665591048dcd57a6933338911dd6cdb065ba16f02cb38d46d0cc92d":{"description":"This proposal funds the vesting contract https://etherscan.io/address/0x1Ea64d68ab8cFb1A529c08bC698b98934e44fD0A with 23.4375 DXD. Average DXD price over JAN / FEB $640\n\nPrice source: https://api.coingecko.com/api/v3/coins/dxdao/market_chart/range?vs_currency=usd&from=1672556401&to=1677654001\n","title":"DLABS Vesting Contract JAN FEB","hash":"Qme3QSCstqbdn8ocXPn1qDbTU622TXeRCuu4zW3QFedvzc"},"0x13918282551e80238051ba8382899cc3ef84b0d6bd91bd940c2066d2c3aef34e":{"description":"The DXdao xDai base needs xGen to operate. I transferred another 15000 GEN to the xDai base so it can operate without any issue for a couple of months.\n\nTransfer:\nhttps://blockscout.com/xdai/mainnet/tx/0xf76bb57f73fd516b12089bc2bbba60c88a289534a7105065af8dfa1997b2090b/token-transfers\n\nI am requesting 15000 GEN and 0.1 ETH (transaction costs) as compensation for my contribution to the member balancer program.\n\n","title":"Transfered 15000 GEN to xDai Base","hash":"QmWDv5D6qYEFzNnuHWpGu6nb2F79LMwZ1gshhD3rx9pR6w"},"0x13bcbaf9d93744597c5b118833bae1c1ad443f1f4f514a4cff04fb162e6e4389":{"description":"Hey everyone,\n\nthis proposals approves the connection to the newest public resolver version (0x4976fb03c32e5b8cfe2b6ccb31c09ba78ebaba41).\n\nThe Dxdao has already a connection to an old version of the ENS Public Resolver (0x226159d592E2b063810a10Ebf6dcbADA94Ed68b8) which needs to be removed once it connected to the new ENS Public Resolver.\n\nCheck out the attached URL for more information about the voting parameters.","title":"Add new ENS Public Resolver ","hash":"Qmd2AeWbCSuQCUvUXmyYnbYmfSq7B6JZZ1nXLQoaJWcq6m"},"0x13d0434abf78845b739a2c193c425244eccc8dc1244241081aed49b2582c13a1":{"description":"Proposal to remove ENSRegistrarScheme 0x973ce4e81BdC3bD39f46038f3AaA928B04558b08\n\nThis proposal is created following a schemes cleaning operation discussed in the daotalk forum on the topic https://daotalk.org/t/remove-old-schemes-mainnet-gnosischain/4209","title":"Remove ENSRegistrarScheme 0x973ce4e81BdC3bD39f46038f3AaA928B04558b08","hash":"Qmb3ap5PKmtXbVzUyzu2JG3QdjoD6bVCVmgHTxeq8X1b7v"},"0x140e02a2b89c765e110799e4a3b7e173eebfa4928e02299af835f6e542ad53f6":{"description":"This proposal requests 50.408 DXD to be sent to the following vesting contract: 0x9eCD726A27751F117b8C3024E0afA66E08DE67df\n\nThe vesting contract has 3 years duration starting in April 2021 with 1 year cliff (I bulked 4 months together and delayed overall vesting, because I don't want to have 30+ different vesting contract i.e. one per month). Params can be verified in the contract creation txs: https://etherscan.io/tx/0xa278f48b2db6be3bb4498c20064966698e2b013d158266ff24012eababd2345d\n\nThe vesting amounts have been [calculated by @AllyQ](https://docs.google.com/spreadsheets/d/1IXYsUKzJVltsp9J7YSouTqyUXwg-e6cRky9m7KSFa7I/edit#gid=0):\n\n[1/2022](https://daotalk.org/t/decentral-labs-worker-proposal-18th-of-january-to-18th-of-march/3791)\t2/2022\t[3/2022](https://daotalk.org/t/decentral-labs-worker-proposal-18th-of-march-to-18th-of-may/3987)\t4/2022.  \n13.996\t13.727\t12.697\t9.988\n\nTotal: 50.408","title":"dlabs vesting contract Jan - Apr 2022","hash":"QmV2eFyBi9H1xdoQcgTEvZah5aqTfUFiBtspMRG8qZiyM7"},"0x143ae553809605d2c67136b86f84dd900733b9757ba4fe78aec7d568254edebb":{"description":"Proposal to remove DutchXScheme 0x199719EE4d5DCF174B80b80afa1FE4a8e5b0E3A0.\n\nThis proposal is created following a schemes cleaning operation discussed in the daotalk forum on the topic https://daotalk.org/t/remove-old-schemes-mainnet-gnosischain/4209","title":"Remove DutchXScheme 0x199719EE4d5DCF174B80b80afa1FE4a8e5b0E3A0","hash":"QmUvfaCD8qQ6nQ1KBbtqUhdrCu5mzM1yj4YQ37wiBdFVRs"},"0x143d6f283708372301062fa2ed2da58069eeb503c376e7a1f69cd3d504667639":{"description":"This proposal will create the subdomain rinkeby for omen.eth.","title":"Create subdomain rinkeby for omen.eth","hash":"QmZHPxGYNJk3jLpr1gV8k693ubNsxde5AuRmP7aELEDJSy"},"0x147823b06fe758c9d730ce414b4c557a999ba55beeabbdbde3ee5b57d255b9e6":{"description":"If this proposal gets approved, the dxtrust.eth ens domain will resolve to the latest release of the fundraising application.\nYou can verify the codebase and the IPFS hash by going through the instructions here:\n\nhttps://github.com/levelkdev/openraise-dapp/blob/master/docs/VerificationInstructions.md\n\nusing the config specified here:\nhttps://github.com/levelkdev/openraise-dapp/releases/tag/v0.2.3\n\nYou can access the continuous fundraising dapp with an IPFS gateway: \nhttps://gateway.pinata.cloud/ipfs/QmUJKG2kjQYrsGmkyCR2NVcoif8nXRa8uCARoZWuoZuNxV/","title":"Set dxtrust.eth contenthash to latest release of fundraising dapp","hash":"QmXxS39aAs1TgrKnKXyN5BszQ213HtbJrAV6R1KfZzDC5t"},"0x1492d422f69148c5ebbf4622a533721f8664698cbae5b38c97f4f53beec9f4d6":{"description":"If this proposal gets approved, the omen.eth ens domain will resolve to the latest release of Omen, v1.1.3. The code can be found here: https://github.com/protofire/omen-exchange/releases/tag/v1.1.3\n\nYou can verify the code and IPFS hash by cloning the repo, checking out the v1.1.3 commit, and running the following commands with node version v12.13.0:\n\n```yarn install \nyarn build\nipfs add dist -r -n\n\nFill in the env file:\nREACT_APP_VERSION=omen\nREACT_APP_INFURA_PROJECT_ID=\"9c6788bb15234036991db4637638429f\"\nREACT_APP_MARKET_FEE=2.00\nREACT_APP_GRAPH_MAINNET_HTTP='https://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_MAINNET_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen'\nREACT_APP_GRAPH_RINKEBY_HTTP='https://api.thegraph.com/subgraphs/name/protofire/omen-rinkeby'\nREACT_APP_GRAPH_RINKEBY_WS='wss://api.thegraph.com/subgraphs/name/protofire/omen-rinkeby'\nREACT_APP_KEY_INFURA_API_KEY=6ad6d4a4ec79442eacfa967652729d1c\nREACT_APP_ETH_NETWORKS=mainnet\nREACT_APP_GIT_SHA=4c1b9908c4fe48be3c60eed52f3892c503671d4d\nNODE_ENV=production\n```\n\nYou can see the site on ipfs gateway here: \nhttps://gateway.pinata.cloud/ipfs/Qme1YFiVZTe6cPozktZZhUMBgcpZVwojY8oWPPUpWDxnbL/","title":"Set omen.eth contentHash to IPFS hash of the latest release (v1.1.3)","hash":"QmXcx27FgHNhyuwRD2u6MfStKcVCXHzsWcGdzrAep5FAfV"},"0x14d317fc90f18931486ba691d94cac53d4b0865c5c1e2b85b7cd9d3e91d9f701":{"description":"This proposal will add MTA token to Mesa UI. MTA is protocol token for mstables.\nGP token ID for MTA - 72","title":"Add MTA to list ID 1 (Mesa)","hash":"QmdXngiXaCWgyno6Qzb2Rn8YCkAShJapF8M1Kr6Pdk6inn"},"0x1525609baddd87b0fa867c43ff24449b7e70cbe63f524a0dff0753a664ef1be3":{"description":"\n\nBelow is a reflection on Caney Fork’s October and November worker proposal and a payment request for the second half. The first half of this [proposal passed on-chain here](https://dxvote.eth.limo/#/xdai/proposal/0x97acf5a48c52ada055db848361d5e35bade2495aca32bd6db17cb7a1e5a10437). Caney Fork’s upcoming worker proposal can be [found here](https://daotalk.org/t/caney-fork-worker-proposal-dec-2022/4750).\n\nNote: This proposal also includes a REP sync. It is claiming 3,653 REP for November from this proposal, as well as [3,653 REP earned in October](https://dxvote.eth.limo/#/xdai/proposal/0x97acf5a48c52ada055db848361d5e35bade2495aca32bd6db17cb7a1e5a10437) and [3,631 REP earned in September](https://dxvote.eth.limo/#/xdai/proposal/0xf76d5dd827bda05f8a299b66b6f92bd0289297af19ff8d88fb62519df1d75b59). In total, 10,937 REP to be minted, in addition to the $8,100 USDC payment.\n\nWhat I did well:\n\n\n\n* Leading the DXD Token Working Group. The [proposal to approve the new model was submitted last week](https://dxvote.eth.limo/#/mainnet/proposal/0xb7ff31ec2bcdb8a254b8a1b06c6d2080a4089135b03ed55e684fd41b5176d946), and if passed, would represent a major shift in how DXdao operates. I led the weekly calls and crafted the proposal itself. This took governance attention and resources but I think a worthwhile investment to find a resolution. I’m hopeful this new model will create a better incentive structure for DXdao expenses and engage new DXD holders.\n* Phase 2 restructuring and Phase 3 implementation. In Bogota, I presented three new pillars of DXdao governance - Six month budgetary cycles, priorities board and guild councils. Ultimately, these were all approved in the Phase 2 proposal. So far, I created the [v1 budgetary process](https://daotalk.org/t/phase-3-dxdao-budgetary-process-v1/4711/2) and submitted an [Operations Guild Budget for review](https://daotalk.org/t/operations-guild-h1-2023-budget-proposal-draft/4735/2). \n* ENS DAO delegation - this period was the first full worker proposal with Caney Fork’s ENS delegation. I got the chance to meet many of the ENS DAO community in person in Bogota along with a couple other DXdao contributors. In addition to posting two [This Month](https://daotalk.org/t/this-month-in-ens-dao-september-2022/4592) in [ENS DAO](https://daotalk.org/t/this-month-in-ens-dao/4713), I was also an active follower of the ENS Endaoment vote ([ultimately voting for Karpatkey](https://discuss.ens.domains/t/social-ep2-2-5-selection-of-an-ens-endowment-fund-manager/15188/56)) and [voted](https://ensgrants.xyz/rounds/12) in [ENS small grants](https://ensgrants.xyz/rounds/11)\n* Bogota! It was a great experience. I posted [my reflections here](https://daotalk.org/t/reflections-from-colombia/4628).\n\nWhat I did okay on\n\n\n\n* DXD buyback execution. This went okay because we did not do that [many USD purchases of DXD](https://daotalk.org/t/using-stablecoins-for-dxd-buybacks-instead-of-eth/4695). Attention has shifted towards the price floor implementation in the new DXD token model\n* Expenses! - I provided an [extensive update on DXdao expenses](https://daotalk.org/t/dxdao-expenses-update-november-2022/4721) a few weeks ago. This is now in a familiar format but still lags a few months behind because of late proposals. This data gathering will change in the shift to guild budgets. I hope to make these updates quarterly.\n\nWhat i did not do well on\n\n\n\n* Treasury deployment strategies did not materialize. Progress has been made with Mimic but it’s been slow to do more on the treasury front. This will exacerbate further as more of Dave’s time goes to Treasury.\n* SWPR governance - we have been unable to find consensus on a strategy forward for SWPR emissions. I submitted a snapshot but [the winning option was None of the above](https://daotalk.org/t/the-future-of-swpr-emissions/4572/14). I don’t think we’ve had the governance bandwidth to grow Swapr governance.\n* Swapr - I put in this proposal that I would write a post on Swapr & DAOs. I did not get to that. I have contributed to the Swapr conversation but have not been able to provide value on a new direction.\n* Vibes in the DAO - the bear market (and perhaps actual winter in the Northern hemisphere) is taking its toll on contributors and the DXdao community. Many are burnt out after two years of exhaustive work while the DAO shifts in a new direction. To all I would say: this too shall pass. It’s okay to feel frustrated and disappointed. Bear markets are tough! But by definition they do not last forever. Instead of doom and gloom, we should embrace the contraction and the slow pace of the market. Fewer distractions means deeper focus and allowing for independent research or more time-intensive activities.\n\nNovember compensation (90% at Level 8)\n\n\n\n* $8,100 in USDC/Dai \n* $8,550 in DXD, using 30 day average for DXD price or minimum $523, vested for 3 years with one year cliff \n* 0.1667% REP (3,653 REP)","title":" Caney Fork Worker Proposal Oct/Nov 2022 [2/2]","hash":"QmdAAmG1QMVtWEac42YCgdL14X66GGmr7hunuj9VqWbbg4"},"0x16296d5981f201c2084d5a0a1ff19dfcef0d70d7d8fcc9115882c899da0aacb6":{"description":"Now that the tokens have been fully released via script, the final bootstrapping scheme can be removed.\n\nThe original LockToken4Reputation proposal is viewable at \nhttp://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x78929822a8abec81e5faf670f39bae4b0bddf9386010e0ad3524396cf2eb1ba9\n\n\nThe empty contracts can be viewed at\n\nhttps://etherscan.io/address/0x1cb5b2bb4030220ad5417229a7a1e3c373cdd2f6\nhttps://etherscan.io/address/0x4564bfe303900178578769b2d76b1a13533e5fd5\n","title":"Remove last bootstrapping scheme","hash":"QmWVYJBfozrjKvueHsAkdJAfeyREDF1iMjawq7rhkBQgdt"},"0x1639243f443c473080c69719413548f846fc731651f828704c0099968d2d66d7":{"description":"I am submitting my Redemption Balancer under DXD approved Token Model, following Redemption Balancer guidelines.\n\nTransfer transaction of my 150 DXD to DXdao:\nhttps://etherscan.io/tx/0x58e8722c36ed82aab2b519372903e71a91a16f510615b6143fc14440661b88ee\n\nPlease find there my screenshot of the ‘Redemption Balancer Calc’, with assets to be requested, prices and circulating supply dated to the moment of the DXD transfer to the DAO:\nhttps://daotalk.org/t/petroperus-redemption-balancer-under-dxd-token-model/4865","title":"PetroPeru's Redemption Balancer under DXD Token Model","hash":"QmPD4fXW5Cs2mebX5vX2Y7STMBQRs9WcTzZkNY4anjFTRk"},"0x1671f98969c98f61dfbc3e57c1b3a043a5a0d7b2548bf3150bb2aecb995ba461":{"description":"I just completed the two week trial period outlined in this DAOtalk post https://daotalk.org/t/draft-worker-proposal-v1-altpl/2151\n\n**Timeframe**\nFrom 05/10/2020 to 16/10/2020, 10 working days.\n\n**Responsibilities**\nWork with Geronimo, Kaden and others on Omen, full time.\n\n**Compensation**\nBased on the latest compensation guidelines (https://ipfs.io/ipfs/QmTLSa4uyKJ71G1GViysJLVoawqPcHZ8L6B9eZjuMeM8ok 1), I am at experience level 5. This is my first time working for DXdao so this will be the start of my first month where compensation level starts at 75% of normal. Based on this, for two weeks of full time work, I am requesting $3,000 of ETH and $2250 of DXD. According to the worker guidelines, the DXD will vest over 2 years with a 1 year cliff. Half of the ETH payment will be paid upfront and the second half at the end of the two week period. The DXD will be requested at the end of the two week period with a vesting start date of 05/10/2020.\n\n**Proof of work**\nhttps://github.com/protofire/omen-exchange/pull/1181\nhttps://github.com/protofire/omen-exchange/pull/1149","title":"Worker proposal 05/10-16/10 - altpl","hash":"QmUqq1X2GRSqgfJb1ETsvPuRz2dRo8xRqQR4NKJma3VRNn"},"0x168ca80db89e979aa8a54c64894b6ee8a86224e5d60a9526b36f022d88f88861":{"description":"This proposal withdraws the DXD requested in this proposal: https://dxvote.eth.limo/#/mainnet/proposal/0x818f357112024d61671175e650473b2dcfd5548f4a0f0975a1ccb71324d950bf\n\nThis proposal must be executed after the withdrawl one, otherwise this process will fail.","title":"1999 DXD Withdrawal from GPv1 Relayer","hash":"QmSDZ2LP5asaJfcqg5h6UdaxrJgPRbPP56jBmKZN5BRprS"},"0x16d648db714a8602167f2a6599989d2ec4ffe365b4e7b67e02fafe982c645d6a":{"description":"# DutchX badge and frontend forks\n\n## Introduction\n\nDutchX first came with a pre-added list of tokens. The dxDAO then decided to remove some of them (POLY, BNT, NMR, FUN and DNT). The tokens HOT and WBTC were then added.\n\nThe tokens currently whitelisted for MGN generation are the following: WETH, BAT, MANA, GNO, KNC, LOOM, MKR, OMG, REP, SNT, ZRX, ANT, BLZ, LINK, GEN, GRID, LRC and OST.\n\nWe propose to create DutchX badge on the [*Token² Curated Registry*](https://tokens.kleros.io) as a due diligence tool for token listing. The dxDAO still being the one ultimately listing/delisting tokens for MGN generation.\n\nWe also propose to fork slow.trade and fairdex, allowing all tokens with a ERC20 badge to be traded. Tokens with a DutchX badge would benefit from a special highlight by being displayed first.\n\n## Problematics\n\n### Unclear token listing rules\n\nCurrently, there is no clear set of rules for a token to be listed.\n\nThis gives really low clarity for projects about whether their token would be listed and seems arbitrary.\n\nListing a token takes time (reading the doc, starting the auction, setting up bots) and uncertainty about token listing is likely to discourage projects from starting the process. We need a set of conditions to be fulfilled to be tradable on DutchX.\n\n### Lack of interface for most tokens\n\nEven if a token is listed to generate MGN, the market does not really start as there isn’t a frontend for traders ([*slow.trade*](https://slow.trade/) and [*fairdex.net*](https://fairdex.net/) only list a fixed list of tokens which is hardcoded).\n\nWe need frontends allowing people to trade tokens which satisfy the conditions to be listed on DutchX.\n\n### Danger of infinite MGN generation\n\nA single mistake in token listing would allow a malicious party to generate an arbitrary high amount of MGN.\n\n1.  **Stealth auction for arbitrary high price:** A malicious party could make an auction between the token and WETH, without informing anyone and buy its own tokens at an arbitrary high price. He would then create an auction between this token and another whitelisted token (different from WETH, see [1]). The system would see a very high amount of volume because it would believe this token has high value. This can be abused to generate a large amount of MGN.\n    ⇨ We should only list tokens which are trading on DutchX at values of the same order of magnitude than the market price and all auctions between whitelisted tokens and WETH should be displayed in an easy to use UI.\n2.  **Rare token:** Similarly some tokens may be almost impossible to find. To exploit this, the attacker needs to own some of these tokens, create a WETH auction which can be bought by this token and only put a really small quantity of it. If there are no other DutchX participants with this token, he will be able to buy his own WETH paying with really few tokens. As previously, he could then run an auction with this token and another whitelisted token to make DutchX “see” really high volume giving the attacker tons of MGN.\n    Note that even tokens which were widely distributed can become rare. The DAO token, which was the most famous token of its time, is now really hard to find.\n    ⇨ We should only whitelist tokens which are widely distributed and available on other exchanges.\n3.  **Blocking token transfer:** Some tokens allow a centralized operator to block the transfer of tokens. This can be done by blocking the transfer function, restricting transfer to a list of whitelisted addresses or being able to burn tokens belonging to other addresses (you can’t transfer your tokens if someone burns them first). This can be used for an attack similar to the above one. The attacker able to block transfers (the operator or someone who managed to get control of his keys) can create a WETH auction which can be bought with this token, bid with his tokens and block transfer of other tokens. He will then buy his own WETH with really few tokens, leading the system to believe they have high value. He can then make an auction between this token and another whitelisted token.\n    ⇨ We should not list tokens having a centralized operator able to block token transfers or burn them.\n4.  **Creating an arbitrary amount of tokens:** Some tokens allow a centralized operator to mint arbitrary amount of tokens. An attacker able to do so (the operator or someone who managed to get control of his keys) can then create an arbitrary high amount of tokens. He can then create auctions between this token and another whitelisted token. Using his token as a buy token, he can clause these auctions using a lot of tokens before the auction between WETH and the token which would update the price finishes. This can create an arbitrary high amount of volume, thus creating an arbitrary high amount of MGN.\n    ⇨We should not list tokens having a centralized operator able to mint a high amount of tokens.\n5.  **Smart contract vulnerabilities:** Vulnerabilities in smart contracts can cause the same issues as in “**Blocking token transfer”** and **“Creating an arbitrary amount of tokens”**.\n    ⇨We should only list tokens which undertook proper security procedures: External security audit and/or bug bounties.\n\n[1]  To determine the amount of MGN generated, DutchX looks at the amount of WETH in the trade. But if you trade on a non-WETH pair, the last value (according to last auctions with this token and WETH) of the buy token is used instead.\n\n## Proposal\n\nWe propose to:\n\n-   Create a DutchX badge on the [*Token² Curated Registry*](https://tokens.kleros.io) as a due diligence tool for token listing.\n-   Fork fairdex and slow.trade to allow trading of all tokens with a ERC20 badge. Tokens with a DutchX badge would have additional attention drawn to them by being displayed first.\n\nThe [*Token² Curated registry*](https://tokens.kleros.io), is a registry of tokens where Kleros jurors solve disputes about token specifics (Project Name, Logo, Ticker and network address).\n\nIt is made to prevent scam tokens (tokens impersonating projects and giving wrong addresses) and to provide a way for dapps to access a personalized list of tokens with the characteristics of their choice.\nIt serves as a due diligence tool for token listing (see this [*blog post*](https://blog.kleros.io/decentralize-your-exchange-listing-process-with-kleros/)). The registry contains more 240 tokens, 60 badges, has seen 100 of disputes and had 350 000$ worth of value passed through as deposits. It is used by [*Ethfinex*](https://www.ethfinex.com/) (becoming DeversiFi), [*uniswap.ninja*](http://uniswap.ninja) and the [*Kleros escrow*](https://escrow.kleros.io).\n\nThe DutchX DAO will create its listing criteria (you can see tentative listing criteria below). Projects wanting their tokens to be listed on DutchX will apply for the badge by submitting a deposit.\nAnyone who believes they do not satisfy the criteria will be able to create a challenge by making a deposit against the submission. If no one does within the challenge period, the badge will automatically be granted. If someone does, a dispute will be created. Parties will have the opportunity to submit evidence. Then jurors will vote on whether or not the criteria are satisfied. The winning party will get the deposit of the losing one (minus juror fees). If jurors vote that the criteria are satisfied, the badge will be granted.\n\nThere is already a similar process in place to verify that tokens are ERC20 and are (likely to be) bug free (see [*the criteria*](https://ipfs.kleros.io/ipfs/QmPNEWTyUVqBJtwXn3m6uSp3Tbr8UfGpnAHVhS2FNnF8PN/erc20-standard-token-badge-primary-document.pdf)). It is used to pull the list of tokens which can be used on [*uniswap.ninja*](http://uniswap.ninja) and the [*Kleros escrow*](https://escrow.kleros.io).\n\nWe will fork fairdex and slow.trade. All tokens with ERC20 badge will be tradable on those forks. Tokens which are granted a DutchX badge will be displayed on top of the list.\n\nNote that due to (A) “Stealth auction for arbitrary high price”, it is better for tokens to be displayed in the interface before they are whitelisted for MGN generation.\n\nThe dxDAO will still be the one listing/delisting tokens for MGN generation. But the due diligence process will significantly simplify their review as members would have a guarantee that due diligence has been made for the token proposed to whitelisting.\n\n## Tentative Listing Criteria\n\n1.  **Active project**\n    The token corresponds to a real active project. This can be demonstrated by the following:\n    *(Only one stipulation is required)*\n\n    1.  The token is usable in an application and this application was used at least once during the last 30 UTC days.\n        *Accept if: The token acts as a payment token in a Dapp in production with users.*\n\n    2.  There is a significant amount of open source code in development and new open source code was released during the last 30 UTC days.\n     *Accept if: There are 5000 lines of original and useful code on the project Github. The last commit was 5 days ago.*\n\n2.  **Correct price**\n    The token is trading at the right price.\n    *(All stipulations are required)*\n    1.  There has been at least 1 DutchX auction of the token on the buying and selling side in each of the last 7 UTC days before the submission.\n    *Accept if: There has been 3 or 4 auctions each of the past 7 days.*\n    \n    2.  The token is traded on at least one of the following exchanges with a cumulative volume greater than 10 000$ in the last 30 UTC days:\n\n        i.  The following centralized exchanges: Binance, Bitfinex/Ethfinex, Bitflyer, Bitstamp, Bittrex, Coinbase Pro, Gemini, itBit, Kraken, and Poloniex.\n        \n        ii.  The following on-chain exchanges: Uniswap, IDEX, Bancor, DeversiFi, Etherdelta/ForkDelta, OasisDex, Kyber Network, DDEX and Radar Relay.\n        \n        *Accept if: The token is traded on uniswap with a volume of 1000$ on each of the past 30 UTC days.*\n\n    3.  The final price of all auctions in the last 7 UTC days before the submission is comprised between 0.5 and 2 times the market price.\n        The market price is the average price of the token on exchanges listed in the previous criterion weighted by daily volume.\n     *Accept if: The token has been trading on DutchX at prices between 0.8 and 1.1 of market price previously defined.*\n\n1.  **Secure contract**\n    The contracts are unlikely to have vulnerabilities.\n    For the purpose of this section, “contracts” refer to the token contract, contracts it relies on and contracts which have authority toward it.\n    *(All stipulations are required)*\n\n    1.  There are no vulnerabilities in the contracts which would allow to burn tokens, block transfers or create a high amount of tokens.\n    *Reject if: Someone found a way to block token transfers.*\n\n    2.  The contracts should have undertaken an external security audit (with public results) or a public bug bounty published on a dedicated external platform.\n    *Accept if: The contracts were audited by Consensys Diligence and does not concern a Consensys project.*\n\n    3.  There isn’t a small group of actors (such as an external address or a multisig) able to create a high amount of tokens, burn tokens of other accounts or block transfers.\n    *Reject if: The token contract has a “controller” which is able to create an arbitrary amount of tokens. This “controller” is a multisig.*\n\n**Criteria prevent from the risks of infinite MGN generation:**\n\n-   (A) “Stealth auction for arbitrary high price”: Is dealt by (2c) and by providing a graphical interface to tokens.\n-   (B) “Rare token”: Is dealt by (1) and (2).\n-   \\(C\\) “Blocking token transfer” and (D) “Creating an arbitrary amount of tokens” are dealt by (3c).\n-   (E) “Smart contract vulnerabilities” is dealt by (3a) and (3b).\n\nIf the proposal is accepted, the final criteria will be determined by the dxDAO and the dxDAO will be able to update them.\n\n\n","title":"DutchX badge and frontend forks","hash":"QmeicvM6apfnT5dUre8X7vtYqZdUJK4wFKDKce6SpwFbQh"},"0x16ea12acd26238ea77ddfeed47458d1b0b0fba369aad73217ed0374f9e8cb38c":{"description":"As per: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x92f195df52185bac65a06b4f2acb0184e662f87d1cf294f45b9749a9ed0ad73b\n\nCompensation is being requested for the second half of the work period from 12/20-01/21 in 7000 DAI and 2442 REP. Note that I did request payment in ETH on my initial proposal, but now that we have stablecoins I am requesting DAI.\n\nSummary of work:\n- Implement scalar markets\n  - Complex interactions across several smart contracts requiring a deep understanding of the underlying infrastructure\n  - Math-heavy UI integrations including a slider to dynamically generate payout and profit/loss across multiple positions\n  - Subgraph updates implemented for access to requisite data\n- Bug fixes (both subgraph and front-end)\n\nhttps://github.com/protofire/omen-exchange/pulls?q=is%3Apr+author%3Akadenzipfel\nhttps://github.com/protofire/omen-subgraph/pulls?q=is%3Apr+author%3Akadenzipfel+\n\nBEGIN KEYBASE SALTPACK SIGNED MESSAGE. kXR7VktZdyH7rvq v5weRa0zkVwu7Rf 7ZFeoVRnxtr9ib1 SXnw3ulr45EnDaA bvrmSETqfZhXjbQ p3UZb5pk7qIpuRJ ylLxaCTIvLhBLOv GmsFKRxv7DuM966 pwZWQXW70ICTOai 2svnNvRugN86YLa 8qCKS6TcJT4RVtg OHIdbIp1AjPRhWi f438yDQ5BV2AEO. END KEYBASE SALTPACK SIGNED MESSAGE.\n","title":"Worker Payout 12/20-01/21 - Kaden Zipfel","hash":"QmehkzNoygQnysfs2KHKt8JCycgB47p3xUoc5N38eutoYd"},"0x174b38db47106a7c824a60cc670b8b83eb58a5e03a8809a531d7682d5b6ba2fc":{"description":"De-whitelist SNT from MGN generating tokens","title":"De-whitelist SNT from MGN generating tokens ","hash":"QmW9NBd4SumDX3raU962fv6WiMGmSasfUfFQNhnPJwZo3M"},"0x17515e5a522a37870e04f66729f653942f67513119339716d1da9b74a9bb318f":{"description":"\n**Overview**\n\nDXdao currently holds over 12k ETH in its treasury. Staking ETH gives DXdao an opportunity to help secure the Beacon Chain while retaining exposure to ETH and also receiving a reward for the staking.\n\nThree proposed liquid staking options:\n\n\n\n* Lido\n* Stakewise\n* RocketPool\n\n<table>\n  <tr>\n   <td>\n   </td>\n   <td>\nLido\n   </td>\n   <td>Stakewise\n   </td>\n   <td>RocketPool\n   </td>\n  </tr>\n  <tr>\n   <td>Token\n   </td>\n   <td>stETH\n   </td>\n   <td>sETH2\n   </td>\n   <td>rETH\n   </td>\n  </tr>\n  <tr>\n   <td>APY\n   </td>\n   <td>4.9%\n   </td>\n   <td>4.86%\n   </td>\n   <td>4.77%\n   </td>\n  </tr>\n  <tr>\n   <td>Fees\n   </td>\n   <td>10%\n   </td>\n   <td>10%\n   </td>\n   <td>5-20%\n   </td>\n  </tr>\n  <tr>\n   <td>Total ETH staked\n   </td>\n   <td>1.4M\n   </td>\n   <td>26k\n   </td>\n   <td>2.6k\n   </td>\n  </tr>\n  <tr>\n   <td>Suggested stake\n   </td>\n   <td>50%\n   </td>\n   <td>30%\n   </td>\n   <td>20%\n   </td>\n  </tr>\n</table>\n\n\nLido is clearly the most established option, with over 1.4 Million Ether staked through the platform. Which also makes it easily available on platforms such as Curve, Uniswap etc.\n\nStakewise uses a dual token model, with a separate token for the staked eth and the reward eth. This, eventually allows restaking the reward tokens. See more: [https://docs.stakewise.io/tokens](https://docs.stakewise.io/tokens)\n\nWhile just recently released, RocketPool is a very promising staking option as it aims to be fully decentralized. While the protocol is very “new” on mainnet, it has gone through extensive testing on testnets and has been audited by top-tier auditors. Allocating some ETH to RocketPool would also signal DXdao’s support for decentralized products.\n\n**Proposal**\n\nThis proposal suggests deploying an initial amount of ETH, distributed between the three liquid staking options mentioned, with the following breakdown:\n\n\n\n* 500 ETH on Lido for stETH\n* 300 ETH on Stakewise for sETH2\n* 200 ETH on RocketPool for rETH\n\nFor the purposes of staking the ETH, the DAO will rely upon the Multi-Sig `0x5F239a6671BC6d2bAEf6D7Cd892296e678810882`, which has already handled all treasury diversification proposals as well as bridging funds to different bases. Once the given tokens are acquired the MS shall return those funds to the mainnet DXdao treasury.\n\nThis proposal also authorizes the MS to handle up to 500ETH in one transaction for the purpose of staking it.\n\n**Acquiring the staked assets**\n\nDue to limitations on the tech-side and with an interest to move forward in the near future, if the proposal passes, the most pragmatic solution is to make use of the dev multi-sig.\n\nBelow are a set of ways we could acquire the assets, by either trading ETH for them or minting new tokens.\n\nstETH:\n\n\n\n* Available on Curve ETH/stETH\n* Has Gnosis Safe integration\n\nsETH2:\n\n\n\n* Has Gnosis Safe integration\n\nrETH:\n\n\n\n* Wallet Connect / Gnosis Safe\n\n**More info**\n\n[https://docs.lido.fi/](https://docs.lido.fi/)\n\n[https://docs.stakewise.io/](https://docs.stakewise.io/)\n\n[https://docs.rocketpool.net/](https://docs.rocketpool.net/)\n\n**Details**\n\nThis proposal sends 500 ETH to the ETHrelayer contract, identified as, `0xb9C11a239CEb03626b439dDeD95AC51ffe000795`, which will relay the ETH to the dev multi-sig address, previously identified as `0x5f239a6671bc6d2baef6d7cd892296e678810882` whose signatories have been verified as REP holders. The MS will stake the ETH and return the staked ETH tokens back to the DXdao treasury.\n\n**Risks**\n\nTransfer of these funds relies on the [Dev multi-sig](https://etherscan.io/address/0x5f239a6671bc6d2baef6d7cd892296e678810882). Moreover, the staking platforms themselves present risks.\n","title":"Staking 1000 ETH - Signal and Transfer Proposal","hash":"QmV4yBuvaGAyTps545uouMS8yk7bEnG23nazijxWxzv7jo"},"0x17811e443ed266d709be54b7df36421b31abec4d42fa7589de2c4e6c7178dad3":{"description":"\nThis proposal places an ETH/DXD order on Gnosis Protocol v1, using the [GP Relayer](https://etherscan.io/address/0xce0BB1a5e9c723fe189D9Bf5457DEd9b21E40f9E). This proposal uses funds from “[Send 17.5 ETH to GP Relayer for DXD buyback #7](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xcdc9d2141b887dfae7d21942a3067437776c9a7d59e43831b912b30709c20663)”. \n\nThis proposal would place a limit order on the Gnosis Protocol at a price that is 5% above the time-weighted average price of DXD/ETH on Swapr when the proposal is executed and the [Oracle contract is called](https://etherscan.io/address/0x0e5443a2c6f71e18b9f4f191f52f2d572ccb5a54). The 5% slippage tolerance is under the parameters approved in the [DXD Buyback Program Parameters Update #1](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x58396cc329f5c33bfa29a2e264a05adcad53567a9dcf3e601392d65779dad153) proposal that passed on [mainnet](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x58396cc329f5c33bfa29a2e264a05adcad53567a9dcf3e601392d65779dad153) and [xDai](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xd6c4bfd03d87c365432c073ff0f36578c3cba9da080b75de5058357319908039) The order requires 50 ETH in the Swapr DXD/ETH pool when the oracle checks and has a minimum amount of DXD accepted of 50 DXD. The order is live until Sat Aug 07 2021 15:00 UTC. \n\n \n\nFurther explanation of the [GP relayer can be found here](https://ipfs.io/ipfs/Qmd8TCEr6syKxAnmuBH3hsyvxfSgRJgANLTTorp3JGZY77). \n\nThis proposal abides by the DXD Buyback Program, which was passed on [mainnet](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) and [xDai](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xc122e9ea5460917347538157501f7999d82bdd9b1b8d85bee373391c4b87aa45) and discussed on [DAOtalk here](https://daotalk.org/t/dxd-buyback-program-signal-proposal/2890).\n","title":"DXD Buyback Order # 7","hash":"QmWqrzMA9FCsgZBj2CZYRDpwA5QbEepBLJRqcDVZTcFEmT"},"0x17cec25e38025763d302c13d1daa2f1f75ad4e1b6ddc278792f4fae2ada15817":{"description":"![](https://global.discourse-cdn.com/standard14/uploads/daostack/original/2X/6/60a95bc388b4ef443a14a2c18725a15aa6cff909.jpeg)\n\nI am submitting my Redemption Balancer under DXD approved Token Model, following Redemption Balancer guidelines currently under signal voting.\n\n","title":"Triangulair’s Redemption Balancer under DXD Token Model","hash":"QmTPfrN3MqYWo8FtnWv4m8o4NnHHHLesADDTLeuGEbygTN"},"0x18acacef9b972079eef0e51b230d15e40e09bcb185677bc4ef3e1618d93a74f9":{"description":"Time Frame: 1/12/2021 - 03/12/2021, 2 months.\n\nPosition: Governance Ambassador, continuing in this role.\n\nBackground: We finished a trial period of one (1) month in the position of governance ambassador from 12/12/20 - 1/12/21. In this position, we have been largely working with @powers and @keenanL on governance and internal communication initiatives, along with other DXdao contributors.\n\nCOMPLETED PROJECTS: During the past 1.5 months (since this proposal is about 2 weeks late), we’ve completed the following responsibilities:\n\n* [Contributor Guidelines](https://docs.google.com/document/d/1z5PQfBiU_owixIEO1O1wU7mqq9bS3Qr7iy6frVGYXK0/edit) -- Draft and circulate the Contributor Guidelines, along with various how-to documentation on submitting worker proposals and onboarding new contributors. This document acts as a type of “contributor handbook” to inform members of DXdao on compensation, work culture, and policies. The Contributor Guidelines will be put to a proposal on Alchemy this week.\n* [Governance Descriptions for Resource Book](https://docs.google.com/document/d/1q39id3blZJn5UmrW9oYCZqkdOjZjpAupecwNkjGjCEg/edit) -- Draft Governance descriptions for the DXdao Document Book -- in coordination with @keenanl, we’ve been putting together a wiki and documentation book for new contributors and the general public to learn about DXdao and how to engage with governance and our products. This info will also eventually be available on DXdao’s landing page.\n* [Contributor Covenant](https://www.contributor-covenant.org/version/2/0/code_of_conduct/) -- Research standards of conduct for DXdao online forums. We shared the Contributor Covenant, which has been ratified by various DAOs, on how moderators engage with the community. We’ll be doing a post on DAOtalk about this to see community interest in ratifying a Contributor Covenant.\n* [Governance 2.0 Organizational Assistance](https://docs.google.com/spreadsheets/d/1EEJOAz63TCQQi_9HK38-cT8KLKIMZ12PgUTRD5AC4wI/edit#gid=0) -- prepared spreadsheet on Governance 2.0 presentations to assist community in coming to a consensus on DXdao’s new governance structure.\n* Light Mesa IDO research -- attempted to participate in various IDOs in order to gain a user experience perspective for Mesa and provide informal feedback to DXdao contributors.\n* [Swapr Positioning Spreadsheet](https://docs.google.com/spreadsheets/d/10BpfHfikUyj50hB1bsL2VVfD6IgvfkO7SJvtoK54whw/edit#gid=0) -- prepared positioning spreadsheet regarding Strategy for Swapr.\n* Research for DXdao’s buyback program.\n* [Editing Omen’s Market Validation Rules](https://docs.google.com/document/d/15NN5YUG6XLF3tgqGqWI8P7F9Hqxw2WDDfk7_UDW28EA/edit) -- In consideration of the arbitration that occurred for one of the Omen markets, DXdao contributors thought it’s time to clarify Omen’s market validation rules. Did a first edit of the rules, but want to go into more detail with this and submit updated rules for the DXdao community’s approval.\n\nSELF EVALUATION: The following is a self-evaluation on what we’ve done well, okay, and not well based on our last worker proposal found [here](https://daotalk.org/t/worker-proposal-pulpmachina-12-12-20-1-12-21/2400):\n\n* Did Well: Produced good internal communication documentation to streamline processes. Specifically, got through the Contributor Guidelines, Governance documentation information, and routinely included community feedback on these projects. Researched some strategy issues for DXdao that we’ll continue to take a role in.\n\n* Did Okay: While we did some research on what other projects are doing as far as governance initiatives as well as our own internal governance practices, this was largely informal. We want to make it a larger priority to produce more documentation of how DXdao is doing regarding key parameters on governance, and hopefully produce some articles -- in coordination with @powers -- regarding DXdao’s governance initiatives to make DXdao’s unique governance system more known to the crypto community.\n\n* Needs Improvement: Need to start doing surveys on squad peer performance reviews. Based on some comments in DAOtalk of late, it seems the community thinks this is a priority. We agree, and we’ll make it more of a priority to establish a performance review system for contributors.\n\nSPECIFIC PROJECTS::\n\n* Research and prepare articles on DXdao voting initiatives and trends\n  * Areas of interest include proposal streamlining, voter engagement, Governance 2.0, staking as used in governance.\n* Conduct worker and community surveys on improvements to current governance structure, KPIs by role (technical vs. non-technical), and signaling-to-on-chain-voting processes.\n* DXdao Buyback research\n* Omen Guild governance research regarding ERC20 Guilds and which system works best for Omen\n* Updated Omen market validation rules\n* Governance & economic research on staking\n\nGENERAL GOALS:\n\n* Research governance initiatives for DeFi projects that DXdao is providing governance-as-a-service to and present findings and recommendations.\n* Coordinate with the community to research and explore new governance capabilities for the DXdao itself.\n* Support organization around and execution of Governance 2.0 initiatives.\n\nCOMPENSATION:\n\nExperience Level: 4\n\nWe believe our experience level places us within level 5, but in good faith, we would like to further prove our worth at level 4. Depending on responsibilities and feedback from DXdao, we may raise our experience level to 5 for future months.\n\nFull-time for total of 40 hours per week, for two months (1.12.21 - 3.12.21):\n\n* $7,000 (ETH) 50% to be paid once the proposal gets approved and 50% on or after 3/12/2021 when the work agreement finishes.\n* $7,000 (DAI) 50% to be paid once the proposal gets approved and 50% on or after 3/12/2021 when the work agreement finishes.\n* $10,000 (DXD). $5,000 (DXD) vested at 1 year, and $5,000 (DXD) vested after the first year on a linear schedule.\n* 0.3334% REP\n\nWe joined DXdao as a full-time contributor as of 12/12/20. Prior to this, we’d been contributing for the past two (2) months through DAOtalk topic posts, meeting participation, and Keybase / Telegram discussions. See our list of posts [here](https://daotalk.org/u/pulpmachina/summary).\n\nIn case of any change in the compensation guidelines during this work period, the amounts of the compensation in this proposal will be adjusted to match the latest one from the agreed worker compensation guidelines.\n\nETH price pulled from Coingecko at time of proposal: $1575","title":"Worker Proposal 1/12/2021 - 03/12/2021 -- Pulpmachina - 1of2","hash":"QmNiYHnRLRaULEEpWmJSoPMqqwERsWqsMgw1cm7YCCA7dc"},"0x18d30442eba0568bdb35d36933add53ee59298a009103217335e871b2fd2a1fb":{"description":"This is a proposal to engage BlockRocket for an initial project.\n\nBlockRocket is a passionate Web3 focused team based in Manchester, UK with close ties to the Ethereum community. To give a sense of their past work, a sample of past work includes:\nhttps://medium.com/blockrocket\n1https://medium.com/blockrocket/blockrocket-2019-587c202ffb4a\n1https://wakelet.com/wake/efbb4941-ded3-40c7-bfe1-e4407cf52029\nWith expertise across many aspects of the space (vuejs / nuxt front end, node/js, solidity, testing, the graph, governance), this team can add value to DXdao.\n\nBelow is a draft proposal to work with BlockRocket. This initial engagement focuses on testing code related to contracts to be used in DXdao’s expanding governance structure, summarized here: https://github.com/AugustoL/dxdao-contracts/issues/15\n\nTesting Proposal\n\nERC20 Guild Contracts: https://github.com/AugustoL/dxdao-contracts/tree/dxdao-contracts/contracts/erc20guild 1\n\nCost: $3,000 paid in ETH in two parts, half upfront, half upon completion. Since DXdao can only pay in ETH for the time being, this proposal stipulates that if volatility negatively affects the dollar amount of ETH paid upon the proposal passing, then BlockRocket may make an additional proposal for the difference.\n\nScope:\n\nWrite tests to reach 100% code coverage of all contracts in the contracts/erc20guild folder.\nDon’t add any new dependency, it should be good enough with the @openzeppelin/test-helpers tests helpers libraries.\nThe tests should follow the code guidelines specified in the linter.\nTimeline: The testing project will take 4-5 days to complete, and will begin on a business day no earlier than September 14th.\n\nThe first half of payment is included in this proposal, and a proposal for the second half of the payment will be made upon the report being delivered.\n\nFirst half of payment is $1500 at reference of ETH/USD 375 = ETH 4","title":"[Proposal] ERC20 Guild Contract Testing by BlockRocket","hash":"Qmad7DWRtRbayocEePJPnrZT3CsWW8uZdYFBJmudZAgZqh"},"0x192cc63181b5f53dd883bc89cef36bbbcb0ad1ae47ea605c792e599a6686d5f3":{"description":"The execution bot that will automatically execute Alchemy proposals is about to run out of funds that have been sent by this proposal: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xceecffe1843557a547d7525e3f0e3b5a7903122183abda13ca2ad43e271e033c\n\nThis proposal will fund the bot with 10 ETH.","title":"Funding the Proposal Execution Bot","hash":"Qme7xv83YUdm5HicbmvL9XZmfqBpuHxMzJhC7Y957pLMS2"},"0x19be5ea2cbd24ed30743d1c53153cd5e9b54805ad2d2490898e9fe754a00f734":{"description":"This proposal sends 24.25 ETH to fund the Governance gas refund round #4 smart contract. These refunds include gas costs incurred during Q1 2021, specifically from block 11565019 to 12150244. Any ETH not claimed within 3 months will be reclaimed by DXdao.\n\nGas costs are refunded as follows:\n\n- 90% Proposal creation  \n- 90% Staking  \n- 90% Voting  \n- 90% Redeeming  \n- 100% Executing  \n- 100% Boosting  \n\nDAOtalk link: https://daotalk.org/t/dxdao-governance-refunds-round-4/2697/5\n\nDeployed contract: https://etherscan.io/address/0x8BE9b5456079737F3aA97fBE7B0d77A5eE74822F","title":"Fund Gas Governance Refund #4 Smart Contract","hash":"QmdcYo8eVumkXJvwG49seBmBjurnL97VtztX8YLGm7AHwo"},"0x19cdc46bebf1ae62333af4d241cdc6d9586c4e9c0758c78213de32d22702888c":{"description":"\n**TIMEFRAME**\nFrom 27.09.2020-27.10.2020, one month\n\n**Responsibilities:**\n\n- Support Omen as a front-end developer.\n\n- Homepage improvements for the dxdao.eth.link website\n\n**Compensation:**\n\nAccording to the worker compensation guidelines I would consider myself as an experienced level 2. I will be applying with an experience level 1 because I need to first learn react. Lastly I can currently only commit 5 out of 8 hours per day.\n\n**- 1875 USD to be paid in ETH. Instead of 8 hours per day (which is a regular full time developer) I can work 5 hours per day which results to a monthly salary of 2500 USD. I am starting with an experienced level 1 and doing a trial period of one month which reduced my monthly salary by 25% to 1875 USD. 50% (937 USD) to be paid once the proposal gets approved and 50% on 27/10/2020 when the work agreement finishes.**\n\n**- 0.10% REP (voting power in DXdao)**\n\n**- 500 USD to be paid in DXD vesting over 12 months with a 6 month cliff, based on the buy price on https://dxdao.eth.link/#/exchange at time of vesting/lockup contract creation. A lockup/vesting contract which will be funded at final payment and use 27.09.2020 as the starting date of the vesting.**\n\n**Work Experience:**\n\nI have been a web developer for the past two years. In the beginning I was doing mostly html and css gigs, along with learning Vue.js. Since December 2019 till the beginning of September 2020 I was working with the crypto project Origin Trail as front-end developer.\n\n- I have done mostly Vue.js,html,css and smart contracts related technologies (solidity, ethers.js,infura…) . I was in charge of monitoring the platform which collects data from smart contract events and displays it on charts.\n\n- I’m also studying economics at university, which has helped me alot in this space.\n\nGithub:\nMi-Lan (Violet) · GitHub","title":"Dev Violet Worker Proposal 27.09.2020-27.10.2020","hash":"QmSTtYA5U1dBdF4ResEBWuTnHPZrQHt1ammCjTTAYe5KUx"},"0x1a4473fd8eac5a2d0e48b904aa0260c6a9293b38d175fcf07b3a9250f0c071e2":{"description":"\nHello everyone,\n\nI am propose to create dxDAO incentive and give Mesa custom market makers (CMM) set up  owners  lifetime possibility to ask 1000 dxDAO REP points per each CMM created according to this dashboard  \nhttps://explore.duneanalytics.com/dashboard/gp-passive-liquidity-provision-with-cmm-yield-farming-dashboard?p_w4270_deployment_id=108&fullscreen\n\nAt the time of writing this would be a maximum of new 20000 REP or aprx 1.6% of total REP.\n\nI am also ask 0.2 ETH for my self for gas costs compensation for pushing this proposal\n","title":"Signal proposal: granting Mesa Custom market makers creators dxDAO REP","hash":"QmbKqKmu24NrSLyVB7rU1nmc9F88h9KPifnPWdhsR2jcdB"},"0x1a6a2b852369cfc98b0eeb2a2a1bafe6f6367af1e11c8d32d9bf15ec8d3d7f8e":{"description":"This payout applies for the final and second payment of the worker agreement for July and August that was approved here https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x21dc2eba5e197170dce3248ac57a11debdd24a37d0236cc8da2da909170e5bf4\n\nYou can verify the work I have done in the following links:\n\n- [DAOtalk activity](https://daotalk.org/u/augustol/activity)\n- [dxswap-core v0.1.0 release](https://github.com/levelkdev/dxswap-core/releases/tag/v0.1.0)\n- [dxswap-periphery v0.1.0 release](https://github.com/levelkdev/dxswap-periphery/releases/tag/v0.1.0)\n- [dxswap-periphery v0.2.0 release](https://github.com/levelkdev/dxswap-periphery/releases/tag/v0.2.0)\n- [dxswap-sdk v0.1.0 release](https://github.com/levelkdev/dxswap-sdk/releases/tag/v0.1.0)\n- [dxswap-sdk v0.2.0 release](https://github.com/levelkdev/dxswap-sdk/releases/tag/v0.2.0)\n- [DXswap Kovan Deployment](https://daotalk.org/t/dxswap-kovan-v0-2-0/1857)\n- [Payable Genesis Protocol implementation](https://github.com/AugustoL/dxdao-contracts/pull/5)\n- [Signed Genesis Protocol implementation](https://github.com/AugustoL/dxdao-contracts/pull/6)\n- [ERC20 Guilds smart contracts with tests](https://github.com/AugustoL/dxdao-contracts/tree/dxdao-contracts/contracts/erc20guild)\n- [DXD Vesting Factory for Workers](https://daotalk.org/t/dxd-vesting-factory/1864)\n- [DXD Action Relayers for DXdao](https://daotalk.org/t/dxd-action-relayers-4-dxdao-burn-sell-and-pay/1926)\n- Leading weekly developer calls each Tuesday.\n- Attending governance calls each Wednesday, general weekly calls each Thursday and DXswap calls each Friday.\n\nThe only goal I wasnt able to met was the DXtrust v0.3.0 release, nevertheless I was able to advance a lot on DXswap release and publish tested code implementing new tools that can be used in our governance system, this would be the governance research that I commited to do.\n\nThis proposal will send the second payment of 4000 USD ETH and 4000 REP that were also proposed in the agreement as part of the payment, using the rate of ETH at the moment of submitting the proposal of 395 USD/ETH.\n\nThe 2400 USD in DXD remaining to be set will be submitted in another proposal to a vesting contract I deployed with the settings I proposed in the worker agreement.","title":"Payout Worker Proposal 07/20-08/20 of github:AugustoL ","hash":"QmY9ZvDPT6qfLGELmwHeZCbzCu6YNtHA2AMER1rynnT8a3"},"0x1ae5b02454f47970d97713d43d8a54466da416bee8cb55a1fcb52f9cebdf0464":{"description":"**Overview**\n\nRAI currently has a [redemption rate of -9.7%](https://stats.reflexer.finance/), meaning that as of now RAI is expected to devalue 9.7% p.a. DXdao currently holds 278,635 Rai ($800k). DXdao already offloaded a majority of it's RAI in [Offloading RAI from Treasury](https://daotalk.org/t/offloading-rai-from-treasury/4291).\n\nWith the above in mind, it’d make sense for DXdao to sell the remainder of its RAI. This proposal suggests selling the remaining RAI in the treasury to DAI.\n\nFor more information about RAI and how the redemption rate works, please see: [https://reflexer.finance/faq/ ](https://reflexer.finance/faq/)\n\nDXdao will actively monitor RAI, to reacquire it if the redemption rate reaches -1% or better. Which would be done by submitting a further on-chain proposal.\n\n**Details**\n\nThis proposal sends 278,635 RAI to the DXdao MS `0x9467dcFD4519287e3878C018c02f5670465a9003` to execute the trades.","title":" Offloading remainder of RAI ","hash":"Qma4eTWKJU7fUuPzeo6f6baREBcHP9herYMB2jL2w5XyoM"},"0x1af28e4c5a36965ebb0cc17f7cbcb5481d205055b38268b625f95848be6850a4":{"description":"Setting ENS resolver contracts for dxDAO domains. More information can be found here: https://daotalk.org/t/next-steps-for-the-ens-domain-dxdao-eth/1130\n","title":"dxoracle.eth set resolver contract","hash":"QmP8a98qQVWTmiBnP6gLHAptuGK7wo6ANgDDknPPiLVcue"},"0x1c9d2ae269d685c5d3087b0217c780b54cd3e6cca78d59784d0193d51b6ff095":{"description":"I'm requesting compensation for the first half of my Worker Proposal (12/1 - 1/31) on behalf of Caney Fork LLC. I am active on the forums as @Powers, Keybase & Telegram @powers_chris and on calls as \"Chris\".\n\nThe details of this proposal and reflection on previous proposals can be found here:\nhttps://daotalk.org/t/caney-fork-worker-proposal-12-1-1-31/2491 \n\nThe $ Compensation is $6,400 based on 80% of Level 5 worker. As outlined in the post, given ETH's volatility, I will use the average ETH price over the last week of $1,181.72 for a payment of 5.416 ETH.\n\nThe REP compensation is 0.1667% of total REP or 2438 REP\n\nI have not submitted any of my DXD compensation but will when there is a more robust system.\n\nETH Price average taken from Coingecko \"Open & Close\" for past 7 days and then averaged together:\n\t\t\n                 Open\t            Close\t  average\n\n2021-01-14\t$1,132.02\t$1,225.00\t$1,178.51\n\n2021-01-13\t$1,045.41\t$1,132.02\t$1,088.72\n\n2021-01-12\t$1,092.91\t$1,045.41\t$1,069.16\n\n2021-01-11\t$1,267.73\t$1,092.91\t$1,180.32\n\n2021-01-10\t$1,282.98\t$1,267.73\t$1,275.36\n\n2021-01-09\t$1,223.73\t$1,282.98\t$1,253.36\n\n2021-01-08\t$1,229.47\t$1,223.73\t$1,226.60\n\t\t\t\t\t\n\t\t\toverall average\t$1,181.72\n\nhttps://www.coingecko.com/en/coins/ethereum/historical_data/usd#panel ","title":"Contributor Payout - Caney Fork","hash":"QmPnDTCmXePSy6zyWWmAsSD76WXtMNsYEAK6MyptPbaT86"},"0x1cb20d414ee336a947b841311c0a84c8b7ecc48c6c7cbd69e418538c3cf7cc32":{"description":"I propose that the UAX token be added to the Mesa front end for the Gnosis Protocol. UAX has already been added to the protocol and initial liquidity provided. UAX was issued by XRESERVE   and holders redeem it for Ukraine national currency - hryvniya with 1:1 ratio. From my point of view UAX have strong grown potential and active community. Creating easy access for UAX trading on Mesa open doors for ukrainian crypto-traders who using fiat-UAX gateway.  \n\nhttps://etherscan.io/token/0x1fc31488f28ac846588ffa201cde0669168471bd\n\n","title":"Add the UAX Token to the Mesa Front End","hash":"QmQv9iwCHaGqYXUtNvYvLvJAjTwCuxERFBgCCHH4Wp3J4D"},"0x1cd3adc9f7f1260da20f31ea86c6719cd2976a7757d52c9f1454ab8e13bab8bb":{"description":"This proposal places an ETH/DXD order on Gnosis Protocol v1, using the [GP Relayer](https://etherscan.io/address/0xce0BB1a5e9c723fe189D9Bf5457DEd9b21E40f9E). This proposal uses funds from “[Send 15.9 ETH to GP Relayer for DXD buyback #2](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xaddc28eede071a8f0f0cc0b11f695809d2e0308553167bd0e13d0f3015739611)”. \n\nThis proposal would place a limit order on the Gnosis Protocol at a price that is 2.5% above the time-weighted average price of DXD/ETH on Uniswap when the proposal is executed and the [Oracle contract is called](https://etherscan.io/address/0x0e5443a2c6f71e18b9f4f191f52f2d572ccb5a54). The order requires 12 ETH in the Uniswap DXD/ETH pool when the oracle checks and has a minimum amount of DXD accepted of 50 DXD. The order is live until Fri Jul 23 2021 18:13.\n\n \n\nFurther explanation of the [GP relayer can be found here](https://ipfs.io/ipfs/Qmd8TCEr6syKxAnmuBH3hsyvxfSgRJgANLTTorp3JGZY77). \n\nThis proposal abides by the DXD Buyback Program, which was passed on [mainnet](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) and [xDai](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xc122e9ea5460917347538157501f7999d82bdd9b1b8d85bee373391c4b87aa45) and discussed on [DAOtalk here](https://daotalk.org/t/dxd-buyback-program-signal-proposal/2890).\n","title":"DXD Buyback Order #2","hash":"QmSJ4rTTwCSiniXudNfJZGWvCjNVM2z3AqN7CBCRGmf3Bf"},"0x1d03fbd54a4501bdf3a0dd4aaaeed692df2a56e25141692f8af241003f649149":{"description":"So in the community call last couple days, it was discussed by many that the bonding curve currently suppresses DXD to have organic price discovery, and allow people to mint significant amounts of DXD at very low cost and slippage that can quickly dilute active supply.\n\nThe reason the bonding curve discourages free price discovery and cause price suppression is because everytime someone pushes DXD on the spot market above the price of the bonding curve, someone can easily mint a significant amount of DXD to arbitrage the price back down.\n\nThe bonding curve is initially meant to raise $ for the treasury and the DAO, and have done well at it. Currently DxDAO and MolochDAO holds the biggest ETH treasuries and both own over 4 million USD worth of Ether\n\nSome members mentioned that we could consider either halting the bonding curve until the DAO needs more funding, or make the curve significantly more exponential so that it is much harder to mint DXD.\n\nSince redesigning the bonding curve is a complex matter, I propose that we halt the bonding curve, and in the meantime we can discuss what exact modifications to the bonding curve is optimal.\n","title":" Halting the bonding curve","hash":"Qmc1T6QcPst8AUbzRoX23MN7UzmrgSSqEvjSpgteFAyv9m"},"0x1dc5b19b0ce259553c574a0b0e4af1c5ae9bea0d756efdfbd3aab4afb2b71afd":{"description":"If this proposal gets approved, the rails.eth ens domain will resolve to the latest release of Rails, v1.0.2. The code can be found here: https://github.com/luzzif/rails/releases\n\nYou can verify the code and IPFS hash by cloning the repo, checking out the v1.0.2 commit, and running the following commands with node version 12.18.2:\n\nyarn install --frozen-lockfile\nyarn build\nipfs add build -r -n\n\nYou can see the site on ipfs gateway here: \nhttps://gateway.ipfs.io/ipfs/QmcDqAS2HTRamb5LjHJEFMMpTtCA3gxsAds6vKjfaWoiXa/","title":"Set rails.eth contenthash to IPFS hash of release v1.0.2","hash":"Qmc42GkEkvoDamRiAC9sp3141tvwzJDFTMiPS4wQ1GgmHH"},"0x1dd325d8ac9b1d88be5f7af70b758e94de1197b77e9ee1f418b268c73a37ba3b":{"description":"\nThis proposal places an ETH/DXD order on Gnosis Protocol v1, using the [GP Relayer](https://etherscan.io/address/0xce0BB1a5e9c723fe189D9Bf5457DEd9b21E40f9E). This proposal uses funds from “[Send 16.5 ETH to GP Relayer for DXD buyback #9](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xf4d843c6a7f2fc09c798fffac654c114b483628fc2cf971a149dfcffbd248f0f)”. \n\nThis proposal would place a limit order on the Gnosis Protocol at a price that is 5% above the time-weighted average price of DXD/ETH on Swapr when the proposal is executed and the [Oracle contract is called](https://etherscan.io/address/0x0e5443a2c6f71e18b9f4f191f52f2d572ccb5a54). The 5% slippage tolerance is under the parameters approved in the [DXD Buyback Program Parameters Update #1](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x58396cc329f5c33bfa29a2e264a05adcad53567a9dcf3e601392d65779dad153) proposal that passed on [mainnet](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x58396cc329f5c33bfa29a2e264a05adcad53567a9dcf3e601392d65779dad153) and [xDai](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xd6c4bfd03d87c365432c073ff0f36578c3cba9da080b75de5058357319908039) The order requires 50 ETH in the Swapr DXD/ETH pool when the oracle checks and has a minimum amount of DXD accepted of 50 DXD. The order is live until Thu Aug 12 2021 19:00 UTC. \n\n \n\nFurther explanation of the [GP relayer can be found here](https://ipfs.io/ipfs/Qmd8TCEr6syKxAnmuBH3hsyvxfSgRJgANLTTorp3JGZY77). \n\nThis proposal abides by the DXD Buyback Program, which was passed on [mainnet](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x40dd1973f7434d192946695919deb58176a192db0c37c8b9316202e006a88ba8) and [xDai](https://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f/proposal/0xc122e9ea5460917347538157501f7999d82bdd9b1b8d85bee373391c4b87aa45) and discussed on [DAOtalk here](https://daotalk.org/t/dxd-buyback-program-signal-proposal/2890).\n","title":"DXD Buyback Order # 9","hash":"QmRXyv6npZi62HBkYvWVjrcfnn4xXVbWKzLActQvYSm3rA"},"0x1e5d88a5a7d62c185e43ddad5f0674788074150f8cc6c42ab12ea3b650e26bec":{"description":"This is a first test transaction to deposit 5000 DAI and a corresponding amount of ETH into the Swapr DAI/ETH pool.","title":"Deposit ETH and DAI Liquidity Into Swapr","hash":"QmbFk1G8D1uJdnSXNxFjfoJBR1C6sk2n92TgHoZCAREmAj"},"0x1f1d5c3c5482f6e54faacb1b4ad93364825b4f9aa45d26e1667ab26fecd5aab3":{"description":"Discussion on this topic may be found here: https://daotalk.org/t/proposal-payment-for-dune-analytics-dashboard-bounty/1734\n\nAs discussed, I would like to formally request 11.05 ETH (10 for myself, 1 for kwiz - will send to him upon receipt, and 0.05 to cover gas fees for this submission) and 1000 dxdao REP (as suggested by ykplayer8). \n\nI look forward to completing more bounties and dashboards in the future, and will continue maintaining this Omen Dashboard as necessary.","title":"Payment for Omen Dune Analytics Dashboard","hash":"QmTRtK1puVM5DrJsnyZP9uin8uhPpbprDYRwfTxMTCMsv3"},"0x1f6f5f760bc4629ff2bfad7021b48d6fea53db3fef3cb059d76335856f2c263e":{"description":"Adding the TCR Scheme.\nDetails can be found here: https://daotalk.org/t/proposal-generic-scheme-dxdao-token-curated-registry/1283","title":"Token Registry GenericScheme","hash":"QmQbigZCmMMchg6QBv7m9bQqvmcAfCimaQS3bzokFPQ8Vq"},"0x200c84aabcee1945e6847d33f627371976dc0ca98cef4b69d4dd8eb25056f5bd":{"description":"De-whitelist ZRX from MGN generating tokens","title":"De-whitelist ZRX from MGN generating tokens ","hash":"QmUdty5sGZNJtjxhWyEBqxZQoJNLnbFPYRAHzh9cf8Q48s"},"0x201d6e798bd407dceddb37fcaa6bc56010137b32fefed935571560daf27e44f7":{"description":"**Timeframe**\n\n01/09/2020 - 31/10/2020, 2 months.\n\n\n**Responsibilities/Goals**\n\nGovernance\n- Support organization around and execution of the 5-point plan outlined here: https://daotalk.org/t/dxdao-5-point-plan/1951\n- Support github:AugustoL and others with Kovan deployment of DXdao contracts\n- Support github:AugustoL and others with research, development, and auditing of WalletScheme, ERC20Guild and DXDVotingMachine both at smart contract and UI levels\n- Support coordination with DAOstack on governance platform development\n- Support next generation decentralized infrastructure exploration and experimentation, such as with Urbit and Radicle beta trials\n\nProduct\n- Help facilitate creation of product roadmaps for Omen, DXswap, and Mesa\n- Help update landing page to include roadmaps, manifesto, and improved information about DXdao in general\n- Time permitting, DXswap code review and/or development\n\n\nCommunity Building\n- Support onboarding of technical and non-technical roles\n- Support evolution of worker compensation guidelines\n\n\nSecurity\n- Finalize proposal to audit DXswap scheme\n- Prioritize upcoming auditing needs and coordinate audits\n- Continue to be on the look out for potential auditing partners\n- Assess potential auditing partners\n\n**Compensation**\n\nLevelK has already received the max amount of REP in past proposals.  According to the guidelines for a DXdao worker with expert level experience and a commitment level of 6, total compensation value of ETH + DXD would be $12,000 per month.  Because there was some feedback that this is high, LevelK is asking for a lesser rate of $11,000 per month, $7500 in ETH and the rest in vesting DXD.\n\n- 15000 USD to be paid in ETH. 50% to be paid once the proposal gets approved and 50% on 31/10/2020 when the work agreement finishes.\n- 7000 USD to be paid in DXD vesting over 12 months with a 6 month cliff, based on the buy price on https://dxdao.eth.link/#/exchange at time of vesting/lockup contract creation.  The vesting/lockup contract would be created and funded at final payment and use 01/09/2020 as the starting date of the vesting.\n\n20.38 ETH are sent in this proposal representing 7500 USD at the current coingecko price of 368 USD/ETH\n\nThe compensation is adjusted to the expert level and commitment level 6 of the current worker compensation guidelines, but in case of any change in the compensation guidelines during this worker period, the amounts of the compensation in this proposal will be adjusted to match the latest one from the agreed worker compensation guidelines.\n\n**Worker Experience**\n\n- LinkedIn: https://www.linkedin.com/in/john-kelleher-86190b/\n- Github: https://github.com/jpkcambridge\n- Level K: https://www.levelk.io/\n\n\n**DXdao Experience**\n\n- Top Contributor to OpenRaise DAPP: https://github.com/levelkdev/openraise-dapp/graphs/contributors\n- DAOtalk Summary: https://daotalk.org/u/johnkelleher/summary\n- Worker Proposal 07/20-08/20 Payout With Work Done: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x2b8ea83d9f13055df5a4f4db70f430f1a16e9d1f8fb7a4b92a8ccea30eb8bccd","title":"Level K Worker Proposal 09/2020-10/2020","hash":"QmcbCv97XUhwVKFm1QKcpwFLn3sb9oZ8k6YDwhigSX81Mv"},"0x20604ea26a2ca4250f97f69a3d7bc3891510bcd6ed6a633e3f07fd8f8d8128b7":{"description":"This proposal will result in a mint of 41,711.0017 REP for the work done between 08/2020 and 02/2022.\n\nThe calculations can be found [here](https://ipfs.io/ipfs/QmSRRRosf79waDHgbD4RyUEbvq748to2wYWJ4ze6r1rS5M), and alternatively attached in the original [DAOtalk post](https://daotalk.org/t/mainnet-rep-sync-luzzifoss/4453).","title":"REP mint - luzzifoss","hash":"QmVVT5rsGCL8B7bLuwwaKXNWjSDYv6TGRxnfDjHKnJMywN"},"0x20808b87e977a9b13123dfc533407fac47ab475c21409c101e7a14bcf90acaa2":{"description":"**Timeframe**\n\nFrom 20/07/2020 to 20/08/2020, 4 weeks.\n\n**Goals**\n\nAs explained in the [Discussion thread](https://daotalk.org/t/discussion-automatically-withdrawing-liquidity-from-prediction-markets-on-omen-with/1689/8) on DaoTalk, I will implement an automatic withdrawal feature on Omen.eth using gelato in order to greatly improve the UX of liquidity providers and boost the adoption of Omen. For more details around this, please see the Discussion thread.\n\n**To Do's:**\n\n- Deepdive into Conditional Token Smart Contracts\n- Deepdive into Omen.eth UI\n- Create local test suite, showcasing & testing the automatic withdrawal feature for liquidity withdrawals based on time using Users' Gnosis Safe and Gelato as a Safe automation module.\n- Update Omen.eth UI to enable users to schedule future withdrawals, based on these [wireframes](https://www.figma.com/proto/GNoehJ64fqfptghsjYqvTJ/Playground-V2?node-id=3301%3A8094&viewport=295%2C107%2C0.583652913570404&scaling=min-zoom) \n\n**Compensation:**\n\nI find the current compensation guide slightly confusing but based on the estimated work of a month, my reputation of ~0.34% and me being an experienced senior Solidity / web3 developer, I think around $3500 paid in ETH would be adequate. The whole sum will be paid AFTER the thing is done so that there is no risk for the dxDAO. Also, I think one gets 2082 REP for a month, so that would be nice as well. \n\nAs I have to request some reward, let's do 0.05 ETH to acknowledge the proposal now.\n\n**Worker Experience:**\n\n- Co-author of the [Gelato Automation Protocol](https://github.com/gelatodigital/gelato-network)\n- Won prizes at several hackathons, including [ETHParis](https://devpost.com/software/arc-de-refinance), [ETHBerlin](https://blog.chain.link/showcasing-the-winners-of-the-etherlin-zwei-hackathon/) & [KyberDeFi Hackathon](https://blog.kyber.network/kyberdefi-hackathon-meet-the-winners-bea5bc9ec983)\n- Very experienced working with Gnosis Safe's, got some [ideas](https://github.com/gnosis/safe-contracts/issues/181) merged into the latest versions\n- Github profile [here](https://github.com/hilmarx)\n\n**DXdao Experience:**\n\nFounding member ;) \n\n","title":"Worker Proposal: Automatic Withdrawal feature on Omen.eth by hilmarx","hash":"QmfXfufj1vwAbvkGCMoWqF1w9NdYQ7uMsUxSVkn9T586wc"},"0x20a7cdb0c5da3493d12861e2bef201798f5f7212b5ceaec85234f37d85e05b25":{"description":"**ETHDenver 2022 Sponsorship On-Chain Proposal**\n\n**Overview:**\n\nThis is an on-chain proposal for DXdao to sponsor and support ETHDenver 2022 with 20,000 DAI in exchange for a Meta Sponsorship Package under the conditions outlined in the ETHDenver Sponsorship Agreement, including all five articles, and the 2022 Sponsorship Invoice (hereafter, the “On-Chain Proposal”).\n\nPassage of this On-Chain Proposal presented by ETHDenver/SporkDAO (“EthDenver LLC”) to DXdao shall be considered a full and complete agreement between DXdao and ETHDenver/SporkDAO (“EthDenver LLC”).\n\nAt passage of this On-Chain Proposal, an on-chain payment of 20,000 DAI will be transferred from the DXdao treasury to the Ethereum mainnet wallet address of ETHDenver/SporkDAO (“EthDenver LLC”),0xbD61Ef27f0793cC3A4A0AfbEb00b206FC5C89c2C \n\nThe initial signal proposal, discussion and community poll can be found in the forum here.\n\n**Details:**\nETHDenver is the largest and longest running Ethereum event in the world.  \nThe main hackathon event will be held on February 17th-20th, 2022. In addition, there is a Virtual Kickoff + #BUIDL Week starting Feb 11, 2022.  More details of the event can be found here: https://www.ethdenver.com/.\nThe details of the Meta Sponsorship Package can be found in the 2022 Sponsorship Invoice and Sponsorship Inclusions docs. \n\n**Payment:**\nPayment made on Mainnet to 0xbD61Ef27f0793cC3A4A0AfbEb00b206FC5C89c2C \nTotal funds: 20,000 DAI\n \n","title":"ETHDenver 2022 Sponsorship On-Chain Proposal (Mainnet)","hash":"Qmbfcip5UUhjw4mCQDs3BtCbYrYd7H36XyLFH6C2Q8QD7S"},"0x2110cfaf339df799f2f857b757dc853f76e6a7b748f2c970c0907013de1fcce3":{"description":"Proposal details posted here: \nhttps://daotalk.org/t/proposal-bizdev-governance-and-product-focused-request-for-value-rep/1869\n\nThis proposal covers the 8 week period (Jun 26th - Aug 21st) that I have been operating as an active part-time contributor to DXdao, contributing regularly to many varying aspects of the DXdao ecosystem. Once again, I am submitting this proposal AFTER contribution and work performed for DXdao.\n\nProposal Summary:\nETH 7.8\nREP 0.25% (3,245 REP)","title":"ETH + REP for BizDev, Governance and Product focused contribution","hash":"QmPJ6EfWRuQZz9G9PfcwExpTizDxZdNpiakZ7845jo3BjQ"},"0x211d55afbe0aa9a0645061241775b911311ec762833d91074c51d08f56461a04":{"description":"This proposal is for the audit of the Omen Arbitrator smart contracts which will be used to allow DXdao to act as an arbitrator for Omen as well an engagement to review and improve DXdao’s software development security posture and proposal monitoring posture.\n\n### Scope\n\n**Omen Arbitrator**\n\nIncludes an audit of the smart contracts in the following folder:\n\nhttps://github.com/nicoelzer/omen-arbitrator/tree/master/contracts\n\nThis audit has already been delivered and took 2 business days to complete.\n\n**Software Development Security Posture**\n(1 day of Phil's time to complete)\n\n- Go through steps in Software Development Security Posture Worksheet furnished by Phil\n- Answer questions from DXdao devs as they add to / create documentation\n- 1 hr review of documentation with Phil for each step\n\n**Proposal Monitoring Posture**\n(7 days to complete)\n- Review overall monitoring process and procedures\n- Review monitoring scripts to ensure full coverage\n\n### Cost\n\n$18000 for 10 days of work, paid in USDC in one part, included in this proposal.\n\n\nTHIS AUDIT IS PROVIDED BY SUNFISH TECHNOLOGY, LLC. “AS IS” AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SUNFISH TECHNOLOGY, LLC. OR ITS OWNERS OR EMPLOYEES BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS REPORT, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.","title":"Omen Arbitrator Audit and Security Posture Review","hash":"QmNxx4qupgkDaSwwu2LXPtbbwhBAqXspyJ45TYD4biuAzr"},"0x2155ca4e4344447f1e86cb95e9be413348ee82274c1bcacee446e5954bd960dd":{"description":"### Background\n\nThe purpose of this proposal is to signal support for the outlined framework for a bounties program intended to promote mesa.eth brand, create content, tutorials, docs and more. Vote “For” to signal support of this proposal.\n\n### Governance\n\nThe program is proposed to run on a new DAO (dxChallenge) created as an Aragon DAO specifically with the program’s needs in mind.\n\nThe voting scheme for dxChallenge will be 1 token, 1 vote. **Every dxDAO member can claim his place in dxChallenge by submitting a signalling proposal to the dxDAO with his ETH wallet address.** The UI does not support WalletConnect at the moment. For now a regular MetaMask-connected address is recommended.\n\n### Funding\n\nFunding for the program is based on a grant by Gnosis of up to 10,000 OWL tokens. OWL is currently traded on mesa.eth for ~0.7$, you can read more about its utility [here](https://blog.gnosis.pm/owl-token-use-cases-6094027ecb37).  \nInitially, 5,000 OWL will be deposited to dxChallenge. Additional 5,000 OWL will be deposited upon successful use of the initial funding.\n\n### The Bounty process\n\nThe process includes a few steps in order to fully fund and pay out a bounty:\n\n-   **Create a bounty** - using the Aragon UI or directly in the Github repo, anyone can create a bounty and suggest it to the community. This stage requires a title and a description of the bounty.\n    \n-   **Fund the bounty** - In this stage the dxChallenge community will vote whether to fund the bounty. 25% quorum is needed to fund bounties in the regular process (1 day) and 50% quorum will fund it immediately. The application will contain a description, a reward amount and token (OWL in this case). Furthermore, there is an option to define whether a signalling proposal (application to work on the bounty) will be needed before submitting a claim proposal for the reward.\n    \n-   **Submit application** - Needed only if configured in the previous stage.\n    \n-   **Submit work** - In this stage the applicant will submit a proof of his work. dxChallenge members will review the work and will vote whether to approve or reject the proposed work. 25% quorum is needed to approve the bounty in the regular process (1 day) and 50% quorum will approve it immediately. If approved, the contributor will receive the tokens staked against the issue. If rejected, other contributors can apply to work on the issue.\n\nA detailed explanation with screenshots can be found [here](https://autark.gitbook.io/open-enterprise/apps/projects).\n\n### Examples\n\n-   Mint a cool meme NFT and propose to sell it to the dao\n    \n-   Create a tutorial for minting meme NFTs and proposing them to the DAO\n    \n-   Create an example proposal claiming reward for promotion work and document it as a tutorial\n    \n-   Proposal for content (tweets, reddit posts, articles, videos, tutorials, podcasts, etc) that promotes or explains the Gnosis Protocol and / or Mesa\n    \n-   Creating an open tool to check volume per address and its relative share of total volume. (might be done on dune analytics / custom script using thegraph.com or web3)\n    \n-   Create an example proposal claiming reward for volume on mesa.eth.","title":"Mesa challenge bounties program","hash":"QmRA1giW7E9hCm1ZMH4DSU4oADME1WZFGqqs53QjWe3uDp"},"0x21c180f2d19008cfaed5b93d58a08c78ef1341f235961e3e60ac6193495d1b9f":{"description":"https://daotalk.org/t/introducing-dxdao-community-rep-boosts/1979\nRecognizing selfless contributors to DXdao","title":"REP Boost: Brent","hash":"QmXc5RDfSQXsrTyoqz9prcYvUBTpWzBW5stFUoaULy5Kwq"},"0x21ced878e0a12ea293711f6ac88546a730bba9a35f4dc9347c0a589562329797":{"description":"### Overview\nCurrently, DXdao has 1K ETH staked across multiple providers: 500 with Lido, 300 with StakeWise, and 200 with Rocket Pool. With another ~8.5k ETH still idle within the treasury, it is important for the DAO to consider investing these assets. Liquid ETH staking remains an optimal solution, providing ~4.5% returns with minimal risk vs other solutions, such as Aave, providing only ~0.4% APY.\n\nThere are early signs that the ETH staking network is getting congested, with validator queues reaching up to 3 weeks recently. As the demand for staking increases in the run-up to, and after the Merge, network congestion could increase further. It is an optimal time for DXdao to get ahead of the market and deploy further funds into ETH staking.\n\nWhilst diversifying across staking providers is important, this proposal will focus on adding further ETH only to the StakeWise pool. Lido’s TVL has grown significantly since the first staking proposal and there are growing concerns about their size and the amount of leveraged ETH staked within their pool. On the other hand, Rocket Pool are having issues scaling given their current infrastructure model, with their staking pool frequently closed to any new deposits.\n\nStakeWise has recently launched liquid staking on Gnosis chain and is currently the only liquid staking provider on the network. This provides DXdao with an opportunity to put further treasury assets to work in a liquid fashion.\n\nAs a reminder, StakeWise uses a dual token model - paying rewards in a separate token, rETH2 (rGNO), mapped to ETH (GNO) earned in the Beacon Chain. sETH2 (sGNO) represents the initial ETH (GNO) deposit into the staking pool and acts as an interest-bearing wrapped ETH (GNO). StakeWise has deep liquidity for both sETH2, rETH2 and sGNO 2, allowing DXdao to un-stake, with minimum slippage, should the need arise.\n\n|     | **Ethereum** |\n|:------------:|:------------:|\n|     **Token**    |     sETH2    | \n|      **APY**     |     4.25%    |    \n|     **Fees **    |      10%     |     \n| **Total Staked** |     ~72k     |  \n\n### Proposal\nDeploy a further **2k ETH** to StakeWise. DXdao will rely upon the Multi-Sig 0x9467dcFD4519287e3878C018c02f5670465a9003, which has already handled previous ETH staking proposals. Once the sETH2 tokens are acquired, the MS shall return those funds to the mainnet DXdao treasury.\n\n### Acquiring the staked assets\nStake natively via the [StakeWise UI](https://app.stakewise.io/).\n\n### More info\n[Website](https://stakewise.io) / \n[Docs](https://docs.stakewise.io/)\n","title":"Stake 2k ETH to StakeWise - Signal Proposal","hash":"QmT6XAigJxf4jADeyLd5oRqhDwyEGXGpCbSkJTCcxHg8nE"},"0x21dc2eba5e197170dce3248ac57a11debdd24a37d0236cc8da2da909170e5bf4":{"description":"## Timeframe\n\n#### From 01/07/2020 to 31/08/2020, 2 months.\n\n## Responsibilities\n\n* Maintenance of [openraise-dapp](https://github.com/levelkdev/openraise-dapp), [dxdao-snapshot](https://github.com/AugustoL/dxdao-snapshot) and [voting-dapp-daostack](https://github.com/AugustoL/voting-dapp-daostack).\n  * Fix production bugs.\n  * Maintain repository dependencies and hosting up to date.\n  * Review new pull requests.\n  * Help collaborators.\n  * Provide technical support to the community.\n* Host weekly dev calls each Tuesday and publish dev call notes each Wednesday.\n\n## Goals\n\n* Release of openraise-dapp v0.3.0, finish all [v0.3.0 milestone issues](https://github.com/levelkdev/openraise-dapp/milestone/1).\n* Release of dxswap v1.0.0 deployed on mainnet, have the uniswap fork with less changes as possible deployed on mainnet , owned by the DXdao and documented.\n* Research and development of WalletScheme, ERC20Guild and DXDVotingMachine, present production ready contracts with tests and documentation in [dxdao-arc fork](https://github.com/AugustoL/arc/tree/dxdao-contracts).\n\nWork on all goals has already started, ideally all of them would be done in two months, but it depends on how much time it takes the maintenance responsibilities. At least openraise and dxswap should be accomplished by the time this worker agreement finishes.\n\n## Compensation\n\nThe compensation is submitted according to the guidelines for a DXdao worker with expert level experience and a commitment level of 4. github:AugustoL already received 39500 REP from past proposals and at the end of this worker agreement he would be on commitment level number 5 with his max reputation already reached and DXD in vested contracts.\nTherefore his financial compensation should be near ~5200 USD per month plus 4000 REP.\n\n* 8000 USD to be paid in ETH. 50% to be paid on when the proposal gets approved and 50% on 31/08/2020 when the work agreement finishes.\n* 2400 USD to be paid DXD in a vesting contract of 12 months with a 6 months cliff. Uints the price from buy price of dxtrust.eth.link at the time of creation. The vesting contract would be created and funded in the final payment the 31/08/2020 and use 01/07/2020 as the starting date of the vesting.\n* 4000 REP, to be issued on 31/08/2020 when the worker agreement finishes.\n\nThe compensation proposed is for a total of 10400 USD (8000 USD in ETH and 2400 USD in DXD) and 4000 REP.\n\n17.777 ETH are sent in this proposal representing 4000 USD at a rate of 225 USD/ETH., the rate of USD/ETH at the moment of submitting this proposal\n\n## Worker Experience\n\n* https://coderstats.net/github/#AugustoL\n* https://github.com/AugustoL\n* http://git-awards.com/users/search?login=AugustoL\n* http://augustol.eth.link/\n* [https://linkedin.com/in/augustolemble/](https://www.linkedin.com/in/augustolemble/)\n\n## DXdao Experience\n\n* [openraise-dapp #2 collaborator](https://github.com/levelkdev/openraise-dapp/graphs/contributors)\n* [dxdao-snapshot author](https://github.com/AugustoL/dxdao-snapshot)\n* [voting-dapp-daostack author](https://github.com/AugustoL/voting-dapp-daostack)\n* DAOTalk summary: https://daotalk.org/u/augustol/summary\n* Author of [DXdao Worker Compensation Guidelines 2020](https://daotalk.org/t/dxdao-worker-compensation-guidelines-2020/1518)","title":"Worker Proposal 07/20-08/20 of github:AugustoL","hash":"QmXPtnrpQ4Cz4EPNhNzx2qPL3BWm3wDUsAiuo3UWxNuaxM"},"0x21ebc35a3bd791d9bef65c704bf4dc75c3115f755e887a3b69da9b9296a362ee":{"description":"Release: https://github.com/nicoelzer/dxstats/releases/tag/v1.0.0-alpha.1\nDeployment: http://gateway.ipfs.io/ipfs/Qmaz1BHw91K6ciABzumvjJ7FdmyK1cw8nBwi3sxyN5uVrz\n\nVerifying IPFS Hash\nNode version:  v12.13.0\n\nENV setup:\nREACT_APP_FACTORY_ADDRESS=\"0xd34971bab6e5e356fd250715f5de0492bb070452\"\nREACT_APP_FACTORY_STARTING_BLOCK=11401277\n\n- yarn\n- yarn ipfs-build\n- ipfs add build -r -n\n\nIpfs hash: Qmaz1BHw91K6ciABzumvjJ7FdmyK1cw8nBwi3sxyN5uVrz","title":"Update dxstats.eth to Alpha1 release","hash":"QmaygZnB7mZY8ZHjPijw68CbWj4u7J71k5DVNJMMo9nVLx"},"0x221af4d539cdbbd574bd7cae186ebbdb2970bd97d3545eb45c00e4357ccd5dc6":{"description":"\n    \nThis proposal places a 15000 LUSD order on CowSwap for DXD. See order here: https://explorer.cow.fi/orders/0x5f1940f4a74b0d1b27cd1bc54676fe7452ce63eea95e761e400a642b198517d3519b70055af55a007110b4ff99b0ea33071c720a63ef9593\n\nThis order is placed as part of the [DXD buyback program](https://dxvote.eth.limo/#/mainnet/proposal/0x072519e7fa7d55619fcc675c5c47e446e499ee454da1f2b370825ac447d06758).\n\nThe order is placed at a discount on the price of DXD at the time of creating the order - this is due to the multicall requiring 16 days to pass. Nevertheless, CowSwap matches at the best available price. So the discount just allows some market movement - in case there is no fill for the price, the order will turn into a limit order.\n","title":"CowSwap Order 5f1940f4 LUSD / DXD","hash":"QmamBxSzk2hpD2KWoHrjaj5ueAehPKm1DF7jN7K4ufQTJB"},"0x2292c81cbd2f86bd37bc43c08dbbe444405d9ee418031d4f7d6c7f7ef61dfa1a":{"description":"On August 27, 2021, DXVentures made a proposal for the DXdao community to signal the approval of a $100,000 grant to Incentive Alignment Ltd., the developer of Hats.Finance. The DXdao community signaled to go forward with an on-chain proposal for a $100,000 grant to Incentive Alignment. \n\n\nAgreement for Grant from DXdao to Hats.Finance \n(“Grant Agreement”)\n\nThe following states the terms of the Grant Agreement between DXdao and Incentive Alignment Ltd., the developer of the Hats.Finance protocol.  \t \t \t\t\t\t\t\t\t\nUpon execution of this on-chain proposal, DXdao (“Grantor”) makes a grant to Incentive Alignment Ltd. (the developer of the Hats.Finance protocol), a British Virgin Islands Company (“Grantee”), in the amount of $100,000.00 paid in USDC stablecoins (“Grant Amount”). \nThis Grant Amount is approved as an unrestricted gift to Grantee in furtherance of its support of the Grantee, which developed a decentralized cyber security network on Ethereum (“Grant Agreement”). \nThe Grant Amount is provided in exchange for: \n27,777.78 $HATS Rewards (“$HATS Token Allocation”), to be vested into Grantor’s Ethereum mainnet treasury contract address 0x519b70055af55a007110b4ff99b0ea33071c720a (“DXdao Wallet Address”). The $HATS Token Allocation will begin to vest at three (3) months from the Token Genesis Evolution date, on August 24, 2021, (“TGE Date”), to be vested on a linear schedule, fully vested no later than eighteen (18) months after the TGE Date (“Vesting Period”).\nIn the event that the DXdao Wallet Address no longer functions as a DXdao-approved contract address used to hold DXdao treasury funds during the Vesting Period, a separate on-chain proposal must be made to a DXdao-Approved Voting Platform to determine the appropriate Ethereum contract address for which to send any outstanding amount of the $HATS Token Allocation. \nA DXdao-Approved Voting Platform is defined as any on-chain governance platform Grantor actively uses for its on-chain decentralized governance voting that manages its on-chain treasury. Currently, DXdao-Approved Voting Platforms include DXdao Alchemy mainnet and xDAi bases located at the following addresses: \nhttps://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a; and \nhttps://alchemy.daostack.io/dao/0xe716ec63c5673b3a4732d22909b38d779fa47c3f. \n\n\nConditions:\t\t\t\t\t\t\nUpon reasonable request by Grantor, Grantee shall provide updates of the progress, and / or status of objectives including how the Grant Amount was expended to attain objectives.\t\t\t\t\t\nAgreement to Arbitrate: \n\nAny dispute, controversy or claim arising out of or relating in any way to this Grant Agreement, or the breach thereof, including the issue of arbitrability, shall be exclusively settled by Kleros decentralized arbitration service (“Kleros”), under Kleros arbitration rules. The number of arbitrators shall be based on the Kleros juror selection pool model. \t\t\n","title":"Proposal for Grant Investment from DXdao to Hats.finance","hash":"QmNiY5LsvyY4bp4nxSgqkXSKHMWBqFmvGt2oDQoWz8wSEH"},"0x22a3d5fa63c18198aed247d7cc7f480402ee538ec6ec51b007e763119c541ba9":{"description":"Legacy Synthetix tokens are causing problems with the Mesa UI.  They should probably be removed at this point anyway.  This proposal is to remove the legacy SNX: https://etherscan.io/address/0xC011A72400E58ecD99Ee497CF89E3775d4bd732F","title":"Remove Legacy SNX","hash":"QmYhqZ48bz4PHWdQBf96d3CtYSBorZgtNg5UEMs8bF4hiU"},"0x22a451cd8d34d948259e5338e7ace8f13eef2a83173bf288bae00b3ae13e1dbb":{"description":"*TLDR: This proposal transfers 695 ETH to a new [ETH relayer contract](https://etherscan.io/address/0x3e99bed13071176fe06b317b33e2dcd1e1c9f2be) to a new DXdao Multichain MS, to be converted into specified assets, bridged over to Arbitrum One and deposited in aDXdao. This was discussed on [DAOtalk here](https://daotalk.org/t/fund-adxdao-base-and-provision-liquidity-on-swapr-on-arbitrum-one/3280). This is proposal 2 of 2, a [previous test proposal](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xc44b72b160568e10fe2383728677a1fff3cebd7102dbe5cda5ceb8e243f2e62d) sent 5 ETH* \n\n**Background**\n\nDXdao agreed to expand to Arbitrum One in June with [a signal proposal ](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x48d8b86601016189d9df6b2319f2a907b256db65835cac4dbe4c9d2850a43735)that authorized deployments of Swapr and a DXdao base. After months of community discussion, REP [holders passed a proposal this week ](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x2d00135332c28271ba27c6f02f9aa79a480b4d7c58df37fb30e6a55353470910)that authorized the SWPR Token and Swapr guild. More recently, a proposal to anoint the DXdao base on Arbitrum One with specified addresses is set to pass. \n\nThe Arbitrum One expansion proposal committed $2.25m in DXdao capital to be deposited in aDXdao to be used for liquidity provisioning on Swapr and general operating expenses. DXdao has already [provisioned close to $3m in Swapr on mainnet and xDai](https://daotalk.org/t/depositing-additional-funds-into-swapr/3136) and has enjoyed a positive return as a liquidity provider, particularly on stablecoin pairs and the ETH/Dai pair. \n\nGiven the quickly shifting liquidity landscape that coincides with a new chain launch, this proposal empowers the dev multi-sig signers to acquire tokens that fall within the conditions laid out below.\n\n**Specifics**\n\nThis proposal sends 695 ETH to an ETH Relayer Contract, `0x3e99bEd13071176fE06b317b33e2dcd1E1c9f2BE`, which will relay the ETH to the DXdao Multi-chain Gnosis Safe multi-sig, hereby identified as `0x9467dcFD4519287e3878C018c02f5670465a9003` whose signatories were all on the previous dev multi-sig and have been verified as REP holders, to be converted into tokens that fit the conditions laid out below, bridged over to Arbitrum and deposited into aDXdao, which is identified as `0xe086305858d49f65a5d20adaccd31c523d32694f`. It is up to aDXdao to provision the funds in Swapr or use for general operating expenses\n\nThe 695 ETH is part of total 700 ETH, which is approximately $2.25m (using a ETH price of $3215). The funds should:\n\n\n\n* Include at least 250k Dai for operating expenses\n* At least $500k and up to $1.5m in Swapr liquidity provisioning for ETH-stablecoin pairs, which may include Dai, USDC, USDT, LUSD, or HUSD\n* At least $500k and up to $1.5m in Swapr liquidity provisioning for stablecoin-stablecoin (or stable asset), which may include, RAI, Dai, USDC, USDT, LUSD, or HUSD. \n* Up to $500k in Swapr liquidity provisioning for WETH-WBTC, WETH-DPI or WETH-LINK\n\nDev multi-sig signers can use their own discretion - within these guidelines - to allocate to the most optimal liquidity provisioning.\n\n**Risks & considerations**\n\nArbitrum One is the first permissionless Layer 2. It has gone through almost a year of a public testnet as well as numerous audits. There are some guardrails for the initial launch but there remains risk for DXdao’s funds given how new the technology is. The benefit of being a first-mover on Arbitrum One justifies the risk.\n\nThis proposal relies on the Arbitrum One bridge and uses a new Gnosis Safe multi-sig that has the same address across mainnet, xDai and Arbitrum One. While Gnosis Safe has promised support for Arbitrum One, this is not live yet.","title":"Fund aDXdao base and provision liquidity on Swapr on Arbitrum One with 700 ETH (2 of 2)","hash":"Qmanxh8RXPuucK7ZzsKdm5mqEAW2EeRBxnNj8f8oFMvQWW"},"0x22f03adea5bdca3b942f69da3d73127cf462ec56611767dbaa43e282721f1f11":{"description":"This proposal is the DXD vesting payment of the https://daotalk.org/t/proposal-biz-dev-m-a-strategy-and-community-proposal-request/1954/8 proposal, using the latest values from the DXdao Worker Compensation Guidelines.\n\nTotal Payout of 12,000 USD in DXD, on a vesting of 2 years with a 1 year cliff.\n\nThe price taken for DXD is the last buy price from dxtrust 1.0203 ETH and the price of USD/ETH is 395 USD.\n\n12000/395/1.0203 = 29.7753 DXD","title":"Worker Proposal from 09/20 to 10/20 (SkyMine Labs) DXD vesting payout","hash":"QmQUwfsjAVS8wTWPug1kdipcwiXyC6rLdgf7PdgAYr6E6P"},"0x22f95c133896a2d4eb4ca3ded58968c01ef8004a3e2ac748842ebb4dc056d53c":{"description":"This proposal will create the subdomain sokol for omen.eth.","title":"Create subdomain sokol for omen.eth","hash":"QmQZ8oWHpgCS1uCbyZ1me7cssJfG4yeJPeW1WPwD44tj22"},"0x23566acd2168051cbc84ee787dda2541af714c86b76a4e392df7895acc699598":{"description":"I am submitting my Redemption Balancer under DXD approved Token Model, following Redemption Balancer guidelines.\n\nTransfer transaction of my 67.60 DXD to the DXdao multisig:\nhttps://etherscan.io/tx/0xa568edbea0c352c7caf2fe7d8de51b473dd77f7dca92c65308369849496a4052\n\nPlease find my screenshot of the ‘Redemption Balancer Calc’, with assets to be requested, prices and circulating supply dated to the moment of the DXD transfer to the DAO:\nhttps://daotalk.org/t/plutos-redemption-balancer-under-dxd-token-model/4877","title":"Pluto's Redemption Balancer under DXD Token Model","hash":"Qmd2CF5hwqbwZ7cSGyLRUwHFMvCnaEdZsL1j56XU8zTxoU"},"0x23cf6a1b9c556db6ca379746fbc6ce3ddbf5728f9527865afc27529bc2178910":{"description":"This DXD Redemption Balancer claims 27462.11 DAI + 39.89 ETH as part of the new DXD Token Model.\n\nDAOtalk post with accompanying screenshot: https://daotalk.org/t/xagxau-dxd-redemption-balancer-3/4892\n\nEtherscan tx link: https://etherscan.io/tx/0xd9b841a2480c643de13ed8ef8ce738608562535ce0cce65cc7b4badf6ee88cc4","title":" Xagxau DXD Redemption Balancer #3","hash":"QmU89UoCMHQzadwfwM3PjksNt5MaJaoMmBHt8aB65Zyx5i"},"0x257aa323de4ae0d5801b0c30a2f38a799ea4d03289e71d1b534eea8531dec694":{"description":"test","title":"Test proposal - monitoring","hash":"QmcgbW17zLFyWubvkHp1vLgDkwSr8f2xV5itTL2HMsqWig"},"0x257bcd1ed883e25b48fac62800102b8bdcd706d19689425fe7f92abb535e7fba":{"description":"If this proposal gets approved, the mesa.eth ens domain will resolve to the latest release of Mesa, v1.4.0. The code can be found here: https://github.com/dOrgTech/dex-react/releases\n\nYou can verify the code and IPFS hash by cloning the repo, checking out the v1.4.0 commit, and running the following commands with node version 12.13.0:\n\n- yarn install --frozen-lockfile\n- yarn build\n- ipfs add dist -r -n\n\nYou can see the site on ipfs gateway here: \nhttps://gateway.ipfs.io/ipfs/QmPA3A3VCDAcWGEr7UYC4kSGZFF2mKRNi5ZG8BD73QBgVE/","title":"Set mesa.eth contenthash to IPFS hash of the latest release","hash":"QmTSbwVYpcujUxkyhpUuFc3m9cfwqqgc4eiewXXvMuuEVY"},"0x2602a13f759c20343f1ccefa97af273eaf9e4b11c1387d7906fd45c10c1125df":{"description":"Over the past few months, DXdao has been working to launch DXswap, a governance-enhanced fork of Uniswap. Development updates and community feedback have occurred on the forums, community calls and on keybase.\n\nThis proposal is meant to signal REP holder alignment with the DXswap Launch Parameters as agreed upon by the community over the last few weeks. The Launch Parameters cover initial fees and the initial liquidity supplied by DXdao treasury. More information and further discussion here: https://daotalk.org/t/dxswap-launch-parameters-seeking-community-feedback/1974/12 \n\nThe specific Launch Parameters for alignment and approval:\n\nFees\n- Protocol fee: 1/10th of swap fee\n- Default pool fee: 0.15%\n- Max pool fee: 10%\n\nDXdao sponsored pools\n- $1m total liquidity\n- DXD/ETH - $300k & 0.10% pool fee\n- DMG/ETH - $200k & 0.10% pool fee\n- PNK/ETH - $50k & 0.10% pool fee\n- ETH/Dai - $150k & 0.10% pool fee\n- ETH/USDC - $150k & 0.10% pool fee\n- ETH/USDT - $150k & 0.10% pool fee\n\nCode implementation can be found here. \nhttps://github.com/levelkdev/dxswap-core/pull/19 \n\nVoting for signals approval to move forward with DXswap Launch parameters.","title":"[Signal Proposal] DXswap Launch Parameters","hash":"QmRHUpJHNk8MwNZ2cRq3r5BPMev8kvfq7u4AUtZjmkjSjG"},"0x26605ac44027de3d2e03f3168040ce45ed9706970fef0fec2ad8db0e870bdbba":{"description":"*The proposal below would send 250 ETH from DXdao treasury to be deposited in Swapr on xDai by way of the dev multi-sig. It also includes 5 ETH for gas reimbursement. The [DAOtalk thread can be found here](https://daotalk.org/t/deposit-250-eth-in-swapr-on-xdai-proposal/2750).*\n\n### Background\n\nThe [latest release of Swapr](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/scheme/0xa5a41507127c04cefae0c55433a3b8213ec639ee8a440d3568863b55fda47f9e) includes xDai support. Last month, the [xDai Authorization proposal](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x2a4f24200eb1ef626e9aea29bad2494689f979c00c6fff17b5b0cd38712be426) funded the xDXdao base and now worker payments are being administered through xDXdao base. With stubbornly high gas prices on mainnet, the total value locked in xDai has more than tripled in the last month to [over $51m locked](https://defipulse.com/xdai).\n\nWith more users looking to save on gas costs, xDai represents a great growth opportunity for Swapr and DXdao liquidity would help make it more attractive to larger trades, earning fees for DXdao through the protocol fee and also as an LP. The previous proposal focused specifically on the WETH-WXDAI pair in order to [make it competitive with the Honeyswap pool](https://info.honeyswap.org/pair/0x01f4a4d82a4c1cf12eb2dadc35fd87a14526cc79). Swapr would also benefit from liquidity in additional pairs\n\n### Details\n\nThis proposal sends 250 ETH to the dev multi-sig address, previously identified as 0x5f239a6671bc6d2baef6d7cd892296e678810882 whose signatories have been verified as REP holders. The dev multi-sig will convert the ETH into the following tokens and then bridge over to xDai (on Omni bridge), and then deposit the tokens in xDXdao, where they will be deposited into Swapr by xDXdao via a proposal and the liquidity relayer.\n\nThe pair targets are:\n\n* WETH-WXDAI (25%)\n* USDC-WXDAI (25%)\n* WETH-WBTC (25%)\n* WETH-DPI (25%)\n\nThe percentages are suggestive, actual amounts may vary slightly. It will ultimately be up to xDXdao to deposit the funds in swapr.\n\n### Risks and considerations\n\nTransfer of these funds relies on the[ dev multi-sig](https://etherscan.io/address/0x5f239a6671bc6d2baef6d7cd892296e678810882). xDai also presents risks because security is dependent on its limited validator set. Additionally, cross-chain bridges are still new and not battle-tested.\n\nThis proposal will put the funds in xDXdao around ~$850k, depending on amount of worker proposals completed. This is about 2% of DXdao’s total assets. The transfer and liquidity deposit is worthwhile because of the opportunity to support Swapr while the market is moving to sidechains and Layer 2.\n\nThere is also upside in that the assets deposited will gain fees from trading, but there is also a risk of impermanent loss on each of the pools.\n\n### Gas costs\nThis proposal includes an additional 5 ETH to cover gas expenses incurred by the dev multi-sig, whose members have paid gas costs for treasury diversification proposals, xDai bridge proposals and other testing proposals. It has already incurred 1.83 ETH in costs over the last two months. The 5 ETH is meant to repay members for those costs and compensate for future gas costs.","title":"Deposit 250 ETH in Swapr on xDai","hash":"QmWEE288fdPPLUqxsVXM6phacgi8kaHxAvZWnS5rCUCZgt"},"0x26b61d4b29399f5887b7872ffefc00463d51fbbfc9b4603d60ce1ddfa8f87236":{"description":"Gas is low, time for a sync. It also marks pretty well another 6 months of contribution and my last sync was also after 6 months, I'll try to do these a little more often.\n\nThis also makes me think that in DAVI we should absolutely build a feature to automate this proposal creation, should be simple. \n\n[My previous Mainnet rep sync](https://develop.dxvote.dev/#/mainnet/proposal/0x63002319301437c4ed96148bb9e9b95ac752981bf79a5751c1770ca7572db216)\n\n[1933 REP](https://develop.dxvote.dev/#/xdai/proposal/0x223a51104bfa79dd7df828210954a0268bf70b31549306b7176fe23f23e12cbe)\n\n[2002 REP](https://develop.dxvote.dev/#/xdai/proposal/0xfa02f8f653daaaa3e3160fc5defed039c648e1c9cdbec2b5dae738604af6dc48)\n\n[2948 REP](https://develop.dxvote.dev/#/xdai/proposal/0xcbba59861ced43a022b2bf0bb5e26151b2e1088c7b0198d63b414732f6cf0aea)\n\n[2948 REP](https://develop.dxvote.dev/#/xdai/proposal/0xb399905e93fcc1ea604cc965a2622b39a62318706965aa13319784ad20a069f1)\n\n[3115 REP](https://develop.dxvote.dev/#/xdai/proposal/0x55a29dfa8c8a1f494741e9ba69292d462956edccc72f749eb83a90f67b170822)\n\n[2948 REP](https://develop.dxvote.dev/#/xdai/proposal/0xd624577094e9fe4ecaace1639aa0d33fcc2868b3d51a574cfa7a36b554ac7833)\n\n1933+2002+2948+2948+3115+2948 = 15894\n\nOn gnosis chain I will be on 32020 REP and after this sync on mainnet my total will be 32002 which seems correct.\n\nBEGIN KEYBASE SALTPACK SIGNED MESSAGE. kXR7VktZdyH7rvq v5weRa0zkLTK50O n6efJRAsAf1W1Na LbaPFnWlIPPTjIS 2VR42d9ihAKrZqA bJfde5QNUzXUPJm d5RRlsStBlucLn6 pSzeSzM9Ug1J0FX jIjgMbW9YhMF6Cv AHxMPRS3MDGwuH9 M3zWkwZng1vR88Y GE5mgGjbG1F81jK MKbda1gMoYckWMX 19jqe38WVkOgxGz EDBEu4jWXZWzAqI TvtevGOlP8k5MWT eUg5YA8Wczpu221 nr. END KEYBASE SALTPACK SIGNED MESSAGE.\n\n\n","title":"Ross Neilson Mainnet REP Sync 7/22","hash":"QmYEqiy3AGPHANpMPGQoPkYKZa31A91YiYD1s1kiBi1hde"},"0x27460cf125ed7c472499494931030c39a5009d5323644f7c54048f6b227bea52":{"description":"This proposal will set the main public resolver contract (https://etherscan.io/address/0x226159d592e2b063810a10ebf6dcbada94ed68b8) as the main resolver contract for the dutchX.eth domain. ","title":"set main public resolver to the dutchx.eth domain","hash":"Qme6fja8MnEXNJUXiBQbizgyG8Bxg1zjfpF5FaV6f4dfxN"},"0x27be8a93ca6901c1277c4ce0cfc26c74358d316ee079954ee0f8387a35d4a266":{"description":"This proposal places a 200 WETH order on CowSwap for DXD by approving 200 WETH to be spend by Cowswap and signing the following order:\nhttps://explorer.cow.fi/orders/0x75a9c9e5dce5848adcdf04534022a44f221aee8de5723cd2f76fddd9798769ca519b70055af55a007110b4ff99b0ea33071c720a6413e6f1 \n\nThis order is placed at 0.457 WETH/DXD in line with [New DXD Token Model](https://alchemy.3ac.vc/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xb7ff31ec2bcdb8a254b8a1b06c6d2080a4089135b03ed55e684fd41b5176d946) according to the [latest calculation for 70% of treasury NAV](https://docs.google.com/spreadsheets/d/1mS1sVmyP0Z3YiA1JiZpHgPHjSIh3da7MawpjQodE34Y/edit#gid=1664575995)\n\nThe order is a CowSwap liquidity order, which means it can be accessed by placing a limit order (not a swap) on Cowswap.","title":"CowSwap Liquidity Order 75a9c9e5 WETH / DXD","hash":"Qmei3DVogbVJ1dDoJi8r154fMap78JGS7eDVqj3hDpKkx1"},"0x27c74a7a92bcf0d55420b82129d9e8647b5e727ea7791be5c15de874e46839fb":{"description":"Proposal requesting compensation for (Ragnar) for creation of [article](https://medium.com/bitfwd/distributed-capital-formation-with-openraise-3af9a601ad63). Invoice attached.\n\n","title":"OpenRaise <> dxDAO Article (Ragnar)","hash":"QmZ6vSGEZJVrysAMKcCJnK8JywnptqQ4yKox7iXgzAFu7b"},"0x27d0c810db85665b9da80a420687c7505da6c23aeb8306a9f97291d350d47fd1":{"description":"\n\nThis proposal claims 71.05 DXD that has vested for Caney Fork Worker proposals from September 2020 to January 2022. This [spreadsheet calculates](https://docs.google.com/spreadsheets/d/1JLVg3muDyJXjTjPHb8567mqJVEHNi0hFs9qBjbGsD8k/edit?usp=sharing) the vested % (screen shot below), subtracting vested DXD that was claimed through a [previous on-chain proposal in June 2022](https://alchemy.3ac.vc/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x383546e559e370d4f6906d978a8603b12b13c888b5fc1e1592a09fa24550dd65).\n\nThis was discussed on [DAOtalk here](https://daotalk.org/t/caney-fork-vested-dxd-claim/4936).\n\n![Screenshot 2023-02-03 at 2.02.36 PM|580x322, 50%](https://global.discourse-cdn.com/standard14/uploads/daostack/original/2X/b/bfe07b2d5a1dab2ca1ea23d0a18f93acf41a6654.png)\n\n\n![Screenshot 2023-02-03 at 2.08.54 PM|690x142](https://global.discourse-cdn.com/standard14/uploads/daostack/optimized/2X/a/acd51c06c8c75207e1de769d6caf2cc874145c22_2_1380x284.png)\n\nThis DXD was earned through the worker proposals listed below: \n\n2020\n\n\n\n* [Worker Proposal - Caney Fork [July/August]](https://daotalk.org/t/proposal-governance-biz-dev-and-content-focused-rep-request/1775)\n* [Worker Proposal - Caney Fork [August/September]](https://daotalk.org/t/proposal-governance-biz-dev-and-community-request-for-worker-compensation/1888)\n* [Worker Proposal - Caney Fork [October/November]](https://daotalk.org/t/worker-proposal-caney-fork/2152)\n* [Worker Proposal - Caney Fork [December/January]](https://daotalk.org/t/caney-fork-worker-proposal-12-1-1-31/2491)\n\n2021\n\n\n\n* [Worker Proposal - Caney Fork [February/March]](https://daotalk.org/t/caney-fork-worker-proposal-feb-march-2021/2661)\n* [Worker Proposal - Caney Fork [April/May]](https://daotalk.org/t/caney-fork-worker-proposal-apr-may-2021/2805)\n* [Worker Proposal - Caney Fork [June/July]](https://daotalk.org/t/caney-fork-worker-proposal-june-july-2021-draft/2999)\n* [Worker Proposal - Caney Fork [August/September]](https://daotalk.org/t/caney-fork-worker-proposal-aug-sept-2021-draft/3167)\n* [Worker Proposal - Caney Fork [October/November] ](https://daotalk.org/t/caney-fork-worker-proposal-oct-nov-2021/3418)\n\n2022\n\n\n\n* [Worker Proposal - Caney Fork [Dec ‘21/January ‘22] ](https://daotalk.org/t/caney-fork-worker-proposal-dec-21-jan-22/3702)\n* [Worker Proposal - Caney Fork [Feb/Mar 2022]](https://daotalk.org/t/caney-fork-worker-proposal-feb-mar-2022/3997)","title":"Caney Fork Vested DXD Claim (Sep 2020 - Jan 2022)","hash":"QmeY6XR8oPPSH6MpV8cQALEG4UjJU565CZuMWs3NFTTnJ1"},"0x27d611db33ff2913b62c12a82f84740eb21b82456f1da5d6533cb092a0ee4c4e":{"description":"Putting this proposal in again as it ended with zero votes.\n\nxDXdao (on xDai) has an immediate need for xGEN to be used in xDXdao's governance process.    \n\nxDXdao treasury received 10,000 xGEN \nhttps://blockscout.com/xdai/mainnet/tx/0xb3bf66c61334442c0dc6e6c7442a8849b86f9df4c0b4c2cfb7523e0df66f732a\n\nIn return, the same wallet is requesting reimbursement in GEN from DXdao on mainnet (plus some associated gas fees to get the GEN back across to xDai)\n\nProposal summary request:\n10,000 GEN plus Gas fees of 0.03 ETH","title":"'Member Balancer' Reimbursement (GEN)... again","hash":"QmWetsA2MHkMEoNWbmA5VQVyVCDNHcmWHkEF7E6XUfJ48Y"},"0x28bf2f95865a2abb27114afaf6bec7d93ed97263e1d4b21740f4a17919e3ac6b":{"description":"This proposal covers the payment for a 6 month Tenderly license. Details outlines in this article: https://daotalk.org/t/dxdao-tenderly/2512\n\nAs we currently don’t hold USDT in the treasury, this proposal will create a treasury debt and can be redeemed by Tenderly as soon as the amount in USDT is covered.","title":"Tenderly Payment","hash":"QmXFSuSMvW1Au6wk4JdyPhFySRhcU2PbRhaqt1vXXUDbC7"},"0x28e1814898f3b52ec4e22a37d47a6e2ef58362f08ead772045109abcc234f111":{"description":"Guidelines for DXD Redemption Balancer, to be used for all DXD Redemption Balancer proposals going forward from proposal passage onwards.   \n\nAnyone redeeming DXD can use this method.\n\nCalculate NAV **[here](https://docs.google.com/spreadsheets/d/1mS1sVmyP0Z3YiA1JiZpHgPHjSIh3da7MawpjQodE34Y/)**. Be careful that DXD circulating supply includes any DXD sent to treasury as part of Redemption Balancer if the payout hasn’t been completed yet. i.e. If you are sending your DXD to the DAO as part of a Redemption Balancer proposal, then you must include any DXD in the circulating supply that has been sent to the DAO address since the last executed Redemption Balancer proposal.\n\nUse prices for assets in your NAV calculation at the time DXD was sent to the treasury.\n\nMultiple redemptions may occur at the same time, but, as above, you can only benefit from already executed proposals. If there are buybacks, Redemption Balancer proposals, or any other proposals in a pending state, then you must assume that they will NOT pass when calculating your 70%NAV figure.\n\nIn your DAOTalk post, include a screenshot of the 'Redemption Balancer Calc' sheet; example for my pending proposal below:\n\n![](https://i.ibb.co/Cns5GLY/dxd.png)\n\n(Note: this screenshot uses current prices, not the prices at the time of my proposal - so these numbers are not the numbers I am claiming, just illustrative of how a screenshot would look.)","title":"DXD Redemption Balancer Guidelines - Signal Proposal","hash":"QmQEvFc7fSafaetMLdGKwjzBs6UimfDJifFuE3rKF3G2ru"},"0x2973a82521762bc5cc5751acea9bb4f1de88719e865a342f223c1f5307a2dc3f":{"description":"# Open MultiCall Installation\n\nThis proposal installs the Open MultiCall on Mainnet, more details can be found here: [https://daotalk.org/t/proposing-a-new-multicall-installation/2790](https://daotalk.org/t/proposing-a-new-multicall-installation/2790)\n\n## Scheme Configuration\n\nPlugin to install (Open MultiCall): 0x34C42c3ee81A03FD9ea773987b4a6eF62f3fc151\n\n### Governance Parameters\n\n-   QueuedVoteRequiredPercentage: 50%\n    \n-   Queued Vote Period Limit: 21 days (1814400 seconds)\n    \n-   BoostedVotePeriodLimit: 1209600 (14 days)\n    \n-   PreBoostedVotePeriodLimit: 172800 (2 day)\n    \n-   ThresholdConst: 1200 (1.2)\n    \n-   QuietEndingPeriod: 345600 (4 days)\n    \n-   ProposingRepReward: 0 REP\n    \n-   VotersReputationLossRatio: 0%\n    \n-   MinimumDaoBounty: 250 GEN\n    \n-   DaoBountyConst: 10\n    \n\n  \n\n### How to verify?\n\nOpen MultiCall Contract:\n\n1.  0x34C42c3ee81A03FD9ea773987b4a6eF62f3fc151\n    \n2.  Verify Avatar is set correctly. Expected Value: 0x519b70055af55a007110b4ff99b0ea33071c720a\n    \n3.  Copy the hashed Governance Parameters from 8. voteParams\n    \n4.  Open 9. voting Machine and switch to Contract address\n    \n5.  In 1. Parameters insert the params & Query\n    \n6.  You will find the Governance Parameters and can compare them with the configuration above\n    \n\nNote: thresholdConst is a calculated value, where 1319413953331 = 1200.\n\n### Scheme Permissions\n\n[x](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xee31c2f8f3d6a398bc8bde027f98fa3dbe7a4af729ea60f1757e9b7e131e4287) Mint and burn reputation, send ETH and external & native tokens. Note: Cannot turned off (Activated by default, cannot be deactivated)\n\n[x](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xee31c2f8f3d6a398bc8bde027f98fa3dbe7a4af729ea60f1757e9b7e131e4287) Call genericCall on behalf of\n\n[] Register other plugins\n\n[] Add/remove global constraints\n\n[] Upgrade the controller\n\n  \n\n### How to verify?\n\nSee proposal section “Permissions” and compare with values above.\n\n### MultiCall Whitelist\n\nOpen MultiCall does not use a whitelist and can with interact with any contract","title":"Open MultiCall Installation","hash":"QmQLewym1MU1jpU7KxJRigTRPacifGb8EB9NSuJmQca5tS"},"0x29f6251fa6cbe63480d2d1caee30b20a05a64a83c6fce830f452fbef79bfbfaf":{"description":"In this proposal I will be requesting 37.255DXD to be sent to the following contract address 0x2748dCA38ffcb4D04B79F78d268c05A867e845f2.\n\nAs specified [in this daotalk post](https://daotalk.org/t/violet-vested-dxd-claim-2021-2023/4967/1) it will include bulk of may,june, july and august of 2022. The vesting contract has 3 years duration starting in May 2022 with 1 year cliff.\n\nHere is vesting contract creation transaction https://etherscan.io/tx/0x49b4f522098311aa7fd2bdda4fe308df34f9d9a51c475df43c4c6cf15ad31f89#eventlog where you can verify vesting contract address + parameters(if you to overview section, then input data and then decode input data)\n\nVesting amounts calculation(more detailed breakdown and proposals involved can be looked up on dao talk post):\n\n1. May - 8.575DXD\n\n2. June - 9.560DXD\n\n3. July- 9.560DXD\n\n4. August - 9.560DXD\n\n","title":"Violet Vesting contract May - August 2022 2/4","hash":"QmSeVzejJoN12CWAnwJJm3rG1W3wcK4rNg1VaB3VRvwYrB"},"0x2a4f24200eb1ef626e9aea29bad2494689f979c00c6fff17b5b0cd38712be426":{"description":"*This is a proposal to formally anoint the xDXdao base on xDai in order to outsource certain activities, particularly worker payments. This proposal also includes a 100 ETH transfer to the developer multi-sig to be converted into xDai and deposited into xDXdao base.*\n\n### Background\nDXdao’s home base is on mainnet Ethereum, but with the rising price of ETH and gas, it has become prohibitively expensive to operate all DAO functions on mainnet. This proposal is meant to identify `0xe716ec63c5673b3a4732d22909b38d779fa47c3f` as the DXdao base on the xDai Chain. This base will serve three primary functions:\n\n* Govern DXdao products on xDai\n* Vote on worker proposal submissions and handle worker payments\n* Vote on signal proposals related to DXdao governance\n\nIt should be noted that in any discrepancy, DXdao’s home on Ethereum mainnet supersedes xDXdao in all cases.\n\n### Initial funding and worker proposals\nSimultaneously, this proposal sends 100 ETH to the developer mult-sig, `0x5F239a6671BC6d2bAEf6D7Cd892296e678810882` which has been used previously for [Treasury Authorization proposals](https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x4e46a28e1215482e2280bca2dbae7765d77c3b4e82fd68b6e16d7d03b48bdc74) and with the 5 owners verified as REP holders with at least 0.5% REP. This multi-sig will be responsible for converting the ETH to Dai, bridging to xDai and depositing it into the xDXdao base identified above.\n\nMoving forward, worker proposals should be submitted to xDXdao under the same process outlined in the Worker Compensation guidelines and the soon to be updated Contributor Guidelines. All base compensation should be requested in xDai; contributors will be responsible for withdrawing the xDai to Ethereum mainnet or another withdrawal method. DXD compensation and REP awards will not be done through xDXdao. Contributors should record these in their proposal on xDai.\n\n### REP\nxDXdao REP is not the same as DXdao REP. How different DXdao bases reconcile REP is outside of the purview of this proposal.\nThere was a lengthy process to deploy xDXdao with a REP distribution based on DXdao home base on Ethereum mainnet. Not all mainnet REP was ported, specifically to Gnosis Safe users; there is a process for mainnet REP addresses to map an xDai address to hold its REP. Any address with mainnet REP is entitled to the same amount of REP in xDXdao.\nMainnet REP will remain the source of truth for DXdao. Mainnet REP requests should be noted in xDai proposals, but the actual mainnet REP awards will happen through DXdao home base on Ethereum mainnet and be batched in quarterly or half yearly increments and potentially in rewards to multiple addresses.\n\n### Risks and Concerns\nxDai is a sidechain, so its risk properties are based on the validator set, which is small. Additionally, bridging assets requires trust from workers to move their funds off of xDai. As a result, the value of assets stored in xDXdao should not exceed $500k.","title":"Authorize and Fund xDai DXdao Base","hash":"QmVEUhrou7FKayzgvwXGfDPCmmB6ZCpD4xCQBnqtMScLXK"},"0x2a64385f1465df89ddb27eb83f7a2c8172c403f7831363ff814be7ee150e2bb5":{"description":"The proposal sends 2400 USD in DXD to a vesting contract with the configuration agreed in the worker proposal https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x21dc2eba5e197170dce3248ac57a11debdd24a37d0236cc8da2da909170e5bf4\nThe rate of ETH/DXD is taken form the dxtrust.eth.link buy price and using 395 USD/ETH rate, the rate of USD/ETH at the moment of submitting this proposal.  2400/395/0.8836 = 6.8763 DXD","title":"DXD Vesting Payout Worker Proposal 07/20-08/20 of github:AugustoL","hash":"QmWLfKpm5ynFP8mdRHjbiuCWWjYQr8uK2jxNFxjWpYG34y"},"0x2b03fd502fb9894c5d9ad4d2608057eff41002acb735ee5ddfcf49943f47e8fa":{"description":"This proposal is a request for 100 ETH to be sent to the DXdev SAFE Multi-sig with the intent to exchange it to USDT and immediately return it to DXdao treasury. \n\n\nIn line with \"Treasury Diversification Authorization Proposal\": https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x5dd6b9bdace1905afcf68c13425b04eb229d5e31ea463b54f591ebd2df05de41\n\n\nAnd forum thread: https://daotalk.org/t/treasury-diversification-authorization-proposal/2541\n\n\nOwnership Verification for Multisig Addresses: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0x4e46a28e1215482e2280bca2dbae7765d77c3b4e82fd68b6e16d7d03b48bdc74\n\nThis will enable DXdao to continue to build its USD-based portion of the treasury. \n\n\nThe DXdev MS (3 of 5) is controlled by a set of active DXdao contributors who have significant REP holdings (that can be slashed by DXdao). This provides an additional safety mechanism if anything were to happen to the funds. MS wallet: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882\n\nProposal Request Summary: Send 100 ETH to DXdev MS: 0x5F239a6671BC6d2bAEf6D7Cd892296e678810882 To be exchanged to USDT and returned to DXdao treasury. ","title":"Exchange ETH to USDT for DXdao Treasury #11","hash":"QmPtx98aPrVZv9EoZL17dUZZuzzYRVqrBTNi6VzyfsydfA"},"0x2b29225f50c6366e07d27f35491a92f5c0b53e82574d2cf37fd227386cad679c":{"description":"This proposal claims Mainnet REP earned by SkyMine Labs for July 2021, August 2021, September 2021, and October 2021.\n\nThe following worker proposals were submitted and executed on xDai as part of DXdao’s effort to reduce cost overhead:\n\n[SkyMine Labs - 07/21 to 08/21 Contribution Recap & Payment](https://dxvote.eth.link/#/xdai/proposal/0x1ee03a7aaf51dbf1141231e2dea8def21fb3728a336baf53620bf521801b5cad) -> 4,928.60 mainnet REP earned\n\n[SkyMine Labs - 09/21 to 10/21 Contribution Recap & Payment](https://dxvote.eth.link/#/xdai/proposal/0x24c61c18ac1f4afc0ecd60f453022dea18063f70e15cc68c977d1753f0445750) -> 5,035 mainnet REP earned\n\nAs discussed on the May 26 Governance discussion, this proposal batches and claims the REP awards for these two proposals. In total, SkyMine Labs is claiming 9,963.6 Mainnet REP.\n\n","title":"Claim Mainnet REP for SkyMine Labs - Jul-Oct 2021","hash":"QmVW96N9DojaL8XLpbYETiBS859tToUwe6JZsHq9daC6dz"},"0x2b2b2cdb5f7b9006c898562332ef4cbb9c7d3c687f3a7a7b8cbf078673cec8d6":{"description":"I'm claiming funds for deployments & plugin installations:\n\nhttps://etherscan.io/tx/0x1c43a591106ede12d6ee0a3c3c9221fffd6e401ae13cba89f00f164c2eccb27b\n\nhttps://etherscan.io/tx/0x28087fb70f84f179943c1b7c10b82f306986870f2d03d3c648c8e88615b87287\n\nhttps://etherscan.io/tx/0xb87f4ee4518d412d0dd9fb105599cb8f7f8494f0d2bd7ff73231eec8195d60c1\n\nhttps://etherscan.io/tx/0xdccaf99e9d9467193f43909394ab75e5ddbaf6ccd450f3e3b01676f679057e1a\n\nhttps://etherscan.io/tx/0xd78cf118aee42ce2f39c298725ce82b21e520042b87ef1898d9f968ce2404ece\n\nhttps://etherscan.io/tx/0x5222fc9e29491d9c9e720d5b507cc3b5e491e3e4fc24beeb4d8e392337306958\n\nhttps://etherscan.io/tx/0x9a32a2cfd437ebde175619d88e2975c0a53a9157e0b0322189e5b95de0fb5b00\n\nhttps://etherscan.io/tx/0x4950bac749118c6ea834a7f07c08e0685092688b988101b7f7932e74f2db6ec5\n\nhttps://etherscan.io/tx/0xdb330dcf249a184e52ed438c44ec36a7447b7a0988317994166b8a6a92299f4e\n\nhttps://etherscan.io/tx/0x400ddada58eee70109492b9ffe2a5f4063a2d6c092633fadf51ad965b7052f8e\n\nhttps://etherscan.io/tx/0xb55b6758f722213c836f7459802d3851c6639bcbe4e830cd8adf3df2b89fad82\n\nadditionally 60$ for this proposal","title":"Claiming Funds for Deployment","hash":"QmU8h6pZpTAA5PxWXvWbzNV3PQ2gerVQwvKwiqH1oizpRd"},"0x2b5bd6d9fac819f46596e641568fccde8226a2edefa632377b7c4bf13c8a1dda":{"description":"*The proposal below would send 400 ETH from DXdao treasury to be deposited in Swapr on xDai by way of the dev multi-sig. This was discussed on [DAOtalk here](https://daotalk.org/t/deposit-400-eth-into-swapr-xdai-proposal/2821).*\n\n### Background\n\nxDXdao currently [holds $671k of liquidity in Swapr on xDai](https://deploy-preview-6--dxstats.netlify.app/#/account/0x3921d59090810c1d52807cd8ca1ea2289e1f89e6) with an additional $450k set to be deposited in the coming days. This has helped to attract users and volume to Swapr xDai, creating a base of liquidity for common pairs, hopefully enabling liquidity in smaller tokens. On xDai, Swapr is competing against [Honeyswap ($10m)](https://info.honeyswap.org/home) and [Baoswap ($26m)](https://baoboard.com/), although Honeyswap sees more trade volume. With eco-routing, Swapr plugs into these now, making Swapr the best trader experience on xDai now, with revenue opportunities from trades through base liquidity supplied by DXdao.\n\nSwapr Beta is just around the corner, which will feature a do-it-yourself farming experience. This will help Swapr capture the long-tail of new tokens, but base liquidity is needed to supplement and ensure a smooth experience.  \n\n### Details\n\nThis proposal sends 400 ETH to the dev multi-sig address, previously identified as 0x5f239a6671bc6d2baef6d7cd892296e678810882 whose signatories have been verified as REP holders. The dev multi-sig will convert the ETH into the following tokens and then bridge over to xDai (on Omni bridge), and then deposit the tokens in xDXdao, where they will be deposited into Swapr by xDXdao via a proposal and the liquidity relayer.\n\nThe pair targets are:\n\n* WETH-WXDAI (20%)\n* WETH-WBTC (20%)\n* USDC-WXDAI (20%)\n* WETH-DPI (20%)\n* WETH-STAKE (20%)\n\nThe percentages are suggestive, actual amounts may vary slightly. It will ultimately be up to xDXdao to deposit the funds in swapr.\n\n### Risks and considerations\n\nTransfer of these funds relies on the[ dev multi-sig](https://etherscan.io/address/0x5f239a6671bc6d2baef6d7cd892296e678810882). xDai also presents risks because security is dependent on its limited validator set. Additionally, cross-chain bridges are still new and not battle-tested.\n\nThis proposal will put the funds in xDXdao around ~$2.3m, depending on amount of worker proposals completed. This is about 4.5% of DXdao’s total assets. The transfer and liquidity deposit is worthwhile because of the opportunity to support Swapr while the market is moving to sidechains and Layer 2.\n\nThere is also upside in that the assets deposited will gain fees from trading, but there is also a risk of impermanent loss on each of the pools.\n\nThis is the first time DXdao would hold STAKE token, which is the underlying token for xDai, so it is a way of DXdao supporting the infrastructure.","title":"Deposit 400 ETH into Swapr xDai ","hash":"QmfXn6sNLPjTgq2kZuiDkxEmX9bSEPYCjzzU8iirD69EiK"},"0x2b8ea83d9f13055df5a4f4db70f430f1a16e9d1f8fb7a4b92a8ccea30eb8bccd":{"description":"This payout is for the second ETH payment related to LevelK’s worker proposal: https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xce68d8d2434ef23da4478b0d4a5085b967eafee381d40330d58d9395021331b4\n\nThe payment is 20.83 ETH which is 8000 USD at the current coingecko ETH price of $384.\n\nThe worker proposal covered a wide scope of responsibilities under the headings of Governance, Product, Community Building, and Security.  While I think we should all be moving towards more specific goals and deliverables, the dynamic nature of the DXdao and the range of my previous experience with DXdao calls for my attention across a range of topics.  I met some goals; some goals got pushed out, and many new concerns arose as the result of a growing treasury, community, and product suite.  I try to give a solid recap of my activities below, separated by category:\n\nGovernance\n- Helped develop and propose plan to improve DXdao and address community feedback about the bonding curve.  https://daotalk.org/t/dxdao-5-point-plan/1951\n- Pushed conversation about REP distribution: https://daotalk.org/t/rep-distribution-and-inflation/1649\n\nProduct\n- Coordinated Mesa releases and planning with Gnosis team: https://github.com/dOrgTech/dex-react/releases\n- Support coordination with potential IDO listings on Mesa such as Aluna and Dev Protocol\n- Support Chris Powers with development of DXswap strategy\n\nCommunity Building\n- Actively participate in conversations across all weekly calls, DAOtalk, Keybase, Alchemy, and Telegram\n- Support onboarding of luzzifoss https://alchemy.daostack.io/dao/0x519b70055af55a007110b4ff99b0ea33071c720a/proposal/0xc55227dead7e0995db600c4a198bfab8b5716b0eab87353694b0bd8ccd3b5b3f\n- Support establishment of weekly calls\n- Appear on and support DAO Rush week presentations\n- Provide feedback and review for Delphi Digital on their report\n- Helped develop DXdao worker opportunities doc <link>\n- Participated in calls with DAOstack team with hope of coordinating on development efforts\n- Various meetings in support of onboarding or partnership exploration\n\nSecurity\n\n- Described Proposal Monitoring and Code Auditing efforts: https://daotalk.org/t/proposal-monitoring-and-code-auditing/1836\n- Formulated proposal for DXswap Scheme audit: https://daotalk.org/t/dxswap-scheme-audit-proposal/1968","title":"ETH Payout Worker Proposal 07/20-08/20 for LevelK","hash":"QmdMiextmVxjDYhdckv36Ggo7id5CoXbadmTgxGFs4U6Gz"}}